{
  "name": "Accounting",
  "degree": "MBA",
  "program_description": "&nbsp; &nbsp; &nbsp;&nbsp;We are well recognized for delivering first-rate graduate education in our accredited programs to those interested in extraordinary quality and affordable cost. Our programs are designed for students from a wide variety of backgrounds including the liberal arts, sciences, education, law, business and other fields.<p>We attempt to attract a wide variety of students. There is no \"typical student.\" However, Anderson School students share two common denominators–all are energetic and ambitious. Come prepared to experience extensive interaction with other students and with the faculty. The learning environment will invigorate you because no class is larger than 60 students, most are 40 students or less.</p><p>Leading organizations are eager to hire our graduates. Full placement services are available to assist you with career choices and locating a position.</p>",
  "admission_requirements": "&nbsp; &nbsp; &nbsp;&nbsp;&nbsp;To qualify for the GMAT/GRE waiver you must have a BBA from an AACSB program and a minimum 3.5 GPA in all upper division coursework. In order to be granted the waiver you must attend our writing workshop and must have received a grade of B or better in a calculus course within the last 5 years or complete MGMT 500 in the admission semester. Subsequent semester registration will not be allowed until these two requirements are satisfied.&nbsp;<b>Spring 2015 semester is the last semester this waiver is available.</b>&nbsp;<br><br>Please read the whole MBA Waiver Policy:&nbsp;<a href=\"http://www.mgt.unm.edu/prospectivestudents/2012AACSBwaiver.pdf\" target=\"_blank\">Download MBA Waiver Policy</a>&nbsp;<div><br></div><div>We will accept either the GMAT or the GRE. The admissions committee requires a 500 or better on the GMAT or a GRE score that is deemed to be greater than or equivalent to 500 on the GMAT using a conversion tool available at:&nbsp;<a href=\"http://www.ets.org/gre/institutions/about/mba/comparison_tool/\" target=\"_blank\">http://www.ets.org/gre/institutions/about/mba/comparison_tool/</a>. The school designation code is 4845 for either exam. Test scores are valid for five years.<br></div>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Megan Hearting:</b></i>\n<b>Director, Student Services</b><br>\n<a target=\"_parent\" href=\"tel:5052773290\">(505) 277-3290</a><br>\n<a target=\"_parent\" href=\"mailto:mconner@unm.edu\">mconner@unm.edu</a><br><br>\n<i><b>Nicole Capehart:</b></i>\n<b>Student Success Manager</b><br>\n<a target=\"_parent\" href=\"tel:5052773290\">(505) 277-3290</a><br>\n<a target=\"_parent\" href=\"mailto:ncapehar@unm.edu\">ncapehar@unm.edu</a><br><br>\n<i><b>Joni Young:</b></i>\n<b>Professor</b><br>\n<a target=\"_parent\" href=\"tel:5052770334\">(505) 277-0334</a><br>\n<a target=\"_parent\" href=\"mailto:young@mgt.unm.edu\">young@mgt.unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}