{
  "name": "American Studies",
  "degree": "PhD",
  "program_description": "The Department of American Studies is committed to the interdisciplinary study of American culture and society as a whole. Besides general courses in American life and thought, six areas of study are offered: Cultural Studies (including folklore and material culture); Southwest Studies; Environment, Science and Technology; Popular Culture; Gender Studies; Race, Class and Ethnicity. Students consult with department faculty to develop individual, inter-departmental programs of study in the humanities and social sciences that focus on these or other significant aspects of American society and thought. <br>",
  "admission_requirements": "&nbsp;<h4>Admission</h4><p>The program is offered at the master’s and doctoral levels. The doctorate usually requires a Master of Arts degree in such majors as American Studies, Art History, History, English, Philosophy, Economics, Education, Political Science, Sociology or Anthropology. In making application, candidates are expected to submit a substantive letter of intent with a clear statement of their American Studies research interests and their goals in pursuing such investigations on a graduate level. Only candidates who show purpose and promise and whose research needs can be appropriately met will be admitted by a committee of the department faculty.</p><h4>Course Requirements</h4><p>At least 30 hours in residence beyond the M.A. are required for the doctorate; this requirement sometimes extends to 36 hours or even more, depending upon the breadth of the candidate’s background.</p><p>Taking into consideration the experience and purposes of each student, individualized programs will be planned to emphasize two major areas of interest with supplementary work in other areas.</p><p>The master’s is offered under Plan I (thesis) and Plan II (non-thesis) as described in this catalog. The master’s program in either case requires an interdisciplinary and interdepartmental grouping of courses for the study of American culture. Under Plan II, the student must successfully complete a minimum of 33 hours of graduate work. Plan I (thesis) calls for 27 hours of course work in addition to thesis hours.</p><p>All graduate students must take the pro-seminar, American Studies 500&nbsp;<em>American Culture Study</em>&nbsp;in the first fall semester of their graduate career and at least four other American Studies seminars.</p><h4>Foreign Language</h4><p>In addition to the course requirements for the doctorate, the American Studies Department language requirement may be fulfilled either through the various options approved by the Office of Graduate Studies or through satisfactory completion of an alternative methodology option to be determined by the student in consultation with the student’s committee on studies and the chairperson of the department.</p><h4>Examinations</h4><p>Students are expected to form a committee on studies after completing 12 hours of graduate credit. Decisions about course work and its distribution, the foreign language to be presented and any special problems related to the proposed area of concentration will be reached in consultation between the candidate and the committee on studies. All graduate students are required to take two exams. The first is the American Culture Study (ACS) exam, taken one year after entry into the program and based on the required pro-seminar and the ACS reading list. The second is taken after completion of course work. It is a written comprehensive examination, the primary purpose of which will be to ascertain the candidate’s ability at synthesizing the subject matter and various methodologies covered during his or her time in the program. Detailed guidelines for the comprehensive examination are available through the department.</p><h4>Dissertation</h4><p>The dissertation will concern itself with at least two disciplines in a specific area of American life and usually with more than two.</p>",
  "transfer_agreements": "",
  "career_opportunities": "<p>The graduate program in American Studies is designed to familiarize students with a wide range of scholarship as a basis for their pursuit of specific programs of study. American Studies graduates have pursued careers in academia, public policy, secondary education and cultural institutions in the arts, social sciences and government.&nbsp;</p>",
  "contact_information": "<i><b>Rebecca Schreiber :</b></i>\n<b>Graduate Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052770686\">(505) 277-0686</a><br>\n<a target=\"_parent\" href=\"mailto:rschreib@unm.edu\">rschreib@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}