{
  "name": "Anthropology",
  "degree": "MS",
  "program_description": "<p>Concentrations: Archaeology,&nbsp;Ethnology Anthropology, Evolutionary Anthropology, Public Archaeology.</p><p>The Master of Arts (M.A.) and Master of Science (M.S.) in Anthropology is offered under Plan 1 (thesis), subject to prior approval by a Committee of Studies in the appropriate concentration and Plan II according to the requirements specified earlier in the catalogue. No more than 8 hours of problems courses and no more than 6 hours of field courses may be applied toward the degree under Plan II.</p><p>Students desiring an interdisciplinary program may elect a minor or distributed minor, under Plan I or II, subject to the prior approval of an advisor in the appropriate area. A terminal master’s program in Anthropology is also offered for students who want specific training in a particular concentration.</p><p>There are no general departmental technical skills or foreign language requirements for the M.A. or M.S. degrees. However, students intending to pursue doctoral research should attempt to obtain such skills, whenever possible, during their master’s program.</p><p>All students are required to complete a master’s examination. For students who do not intend to continue in anthropology beyond the master’s degree, the examination will focus on the content of their course work and its relations to anthropology as a whole. For students wishing to enter the doctoral program in anthropology, this examination will also serve as a Ph.D. qualifying exam; its form and content will depend upon the anthropological concentration (archaeology, evolutionary anthropology, ethnology/linguistic anthropology) appropriate to the student's research interests. Further details about the master’s examination can be obtained from the department office.</p>&nbsp;",
  "admission_requirements": "&nbsp;<p>The Anthropology Graduate Application Committee will begin reviewing complete graduate applications on the first Friday of January and will not accept any files or additional information after that date. It is up to the student to allow adequate time (6 to 8 weeks prior to the department deadline) for processing and mail delivery of the application. The department will not accept faxed or Xeroxed copies of any information. There are no exceptions made.</p><p>The following materials must be included to complete the application file: three letters of recommendation, a letter of intent, official transcripts, GRE scores, the University of New Mexico graduate school application, Registration Information Form and application fee. Consult the department for further information.</p><p>Applicants to the graduate program in anthropology must identify their particular area of interest and their academic and professional goals in a letter of intent directed to the department’s Graduate Studies Committee. GRE scores (verbal/ analytical/quantitative) and three letters of recommendation also are required as part of the application which will be reviewed by the department’s Graduate Studies Committee. Acceptance into the program will depend upon: the number of openings available for new graduate students; the applicant’s potential as indicated by the materials submitted with the application; and agreement by an appropriate faculty person to act as advisor to the student. No student will be accepted into the program unless he or she can be placed under the direction of a faculty advisor who will help to plan the student’s program. Students admitted to the program may change their advisor, subject to prior approval by the new advisor. Students are admitted to a specific area of concentration and must petition the appropriate concentration faculty for acceptance into another concentration. Continuation in the program will require progress at a rate deemed satisfactory by the appropriate concentration faculty, which will review progress each year.</p><p>Within the anthropology graduate program, there are both general departmental requirements and requirements specific to a student’s concentration. The student must consult with the appropriate graduate advisor for information on concentration requirements before registering. General departmental requirements and concentration are described below.</p>",
  "transfer_agreements": "",
  "career_opportunities": "<p></p><p>Students who&nbsp;study&nbsp;anthropology at the graduate level may pursue&nbsp;careers in academia as researchers or instructors. &nbsp;Others may prefer to find work outside of academia, either directly after graduation or after obtaining a professional degree. &nbsp;Graduate study in anthropology is well suited for students planning on attending professional programs in law, public administration, social work, or business;&nbsp;or for students planning to enter&nbsp;any&nbsp;field of work that makes use&nbsp;of people skills, the ability to digest new information, and the ability to read and write analytically. &nbsp;Obtaining a master's degree may also qualify students&nbsp;who hold positions in public education or civil service for automatic pay increases&nbsp;based on their employer's salary schedule.</p><p></p><p></p><p><i></i></p><p></p>",
  "contact_information": "<i><b>Erika Gerety:</b></i>\n<b>Coordinator, Program Advisement</b><br>\n<a target=\"_parent\" href=\"tel:5052772732\">(505) 277-2732</a><br>\n<a target=\"_parent\" href=\"mailto:erika@unm.edu\">erika@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}