{
  "name": "Applied Behavior Analysis: Research-Based Interventions for Individuals with Disabilities Who Have Behavioral Challenges",
  "degree": "Grad Certificate",
  "program_description": "&nbsp;\n\n\t\t\t<br><p>The Graduate Certificate in&nbsp;<strong>Applied Behavior Analysis: Research-based Interventions for Individuals with Disabilities who have Behavioral Challenges</strong>&nbsp;is designed to prepare inservice special and general education teachers and related professionals as well as community providers (e.g., behavior therapists, developmental specialists, early interventionists) to conduct behavioral assessment with children and adults in need of behavior intervention services, provide behavior analytic interpretation of the results, and design and implement appropriate behavior interventions based on assessment results that will be implemented in home, school, and community settings.</p><p>The Graduate Certificate program is open to students pursuing a graduate degree in Special Education and in other related fields (e.g., Psychology) at the University of New Mexico and to individuals who minimally hold a bachelor’s degree and are interested in advanced training in behavioral analysis and intervention.</p><p>The certificate offers two options, each developed prospectively with the designated faculty certificate advisor: (1) Students successfully complete a minimum of 18 hours of coursework and an approved final capstone project or (2) Students successfully complete the requirements of (1) and also successfully complete an additional 6 hours of advanced field experience to fulfill the field experience requirements for credentialing as a Board Certified Behavior Analyst (BCBA). Option (2) would prepare them to apply for the national credentialing exam for BCBAs.<br></p><h2>Total Required Course Work for Option 1</h2><ul><li>SPCD 505 Seminar in Special Education: Advanced Applied Behavior Analysis (3)</li><li>SPCD 619 The Application of ABA to Academic Research in Special Education (3)</li><li>SPCD 595 Advanced Field Experience* (3)</li><li>Elective approved by faculty certificate advisor&nbsp;(3)</li></ul><h2>Total Required Course Work for Option 2</h2><ul><li>SPCD 505 Seminar in Special Education: Advanced Applied Behavior Analysis (3)</li><li>SPCD 619 The Application of ABA to Academic Research in Special Education (3)</li><li>SPCD 595 Advanced Field Experience* (9)</li></ul><p>*An additional course fee of $500.00 is required for each Advanced Field Experience course.</p><p></p>",
  "admission_requirements": "&nbsp;\n\t\t\n\t<h2>Prerequisite for Options 1 and 2</h2><ul><li>SPCD 582 Teaching Students with Intensive Communication Needs (3)</li><li>SPCD 519 Applied Behavioral Analysis in the Classroom (3)</li><li>SPCD 510 Special Education Law (3)</li></ul>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Liz Keefe:</b></i>\n<b>Program Coordinator</b><br>\n<a target=\"_parent\" href=\"tel:5052771587\">(505) 277-1587</a><br>\n<a target=\"_parent\" href=\"mailto:lkeefe@unm.edu\">lkeefe@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}