{
  "name": "Architecture",
  "degree": "MS",
  "program_description": "&nbsp;<p>The University of New Mexico offers two programs of study that lead to the nationally accredited first professional degree, Master of Architecture.</p><p>• The 2 Year Program of Study is composed of two parts: a four-year undergraduate program that leads to the Bachelor of Arts in Architecture degree and a two-year, 54-credit hour program of study that leads to the fully accredited Master of Architecture degree. The undergraduate program is a balance of liberal arts courses and core courses in architecture, while the graduate program is oriented to professional preparation through advanced and specialized course work. Students applying to the two-year graduate program must have successfully completed a four-year pre-professional degree program in architecture.</p><p>• The 3½ Year Program of Study is a 102 credit program designed for students with bachelor degrees from any field. These students may apply to the 3½-year program of study leading to the fully accredited Master ofArchitecture degree. This program allows fewer electives because it concentrates on professional preparation. Students in the 3½ year program of study bring to it a breadth of knowledge based on previous education and experience.</p><p>In addition to the above first professional degrees, we offer a post professional degree:</p><p>• The 1½ Year Program, leading to a Master of Science in Architecture degree, is for students who have already completed an accredited first professional degree and wish to obtain an advanced degree. In this program there are few specific established requirements. Students are encouraged to propose the most professionally and personally useful course of studies with their faculty advisor. Students in the program are expected to take advantage of the special opportunities offered by this program and our unique physical/social setting to pursue individualized educational goals.</p>",
  "admission_requirements": "&nbsp;<h2>Application</h2><p>Deadline to apply for the Fall Semester is&nbsp;<strong>February 1st</strong>. Should this date occur on a weekend, the Monday following becomes the receive-by deadline.</p><p>Application materials must be sent to two places. The following must be sent to the Office of Admissions:</p><ol><li><p><a href=\"http://www.unm.edu/apply/\">Apply to UNM online.</a></p></li><li><p>The non-refundable $50.00 Application Fee which can be paid online with a Visa or Master credit cards.</p></li></ol><p>The following must be sent to the School of Architecture and Planning:</p><ol><li><p><a href=\"http://ogs.unm.edu/resources/ogs-forms/letter-of-intent.html\">Letter of Intent</a>&nbsp;(one page).</p></li><li><p>Portfolio of creative work (bound 8.5 X 11 inch format).</p></li><li><p>Three Letters of Recommendation (<a href=\"http://ogs.unm.edu/resources/ogs-forms/documents/Recommend.pdf\">Recommendation Form</a>).</p></li><li><p>Resume.</p></li><li><p>One Official Transcript (unopened) from&nbsp;<strong>each</strong>&nbsp;academic institution (except UNM) previously attended.</p></li></ol><p>Please identify which Master of Architecture Program of Study you are applying to: the 2 year or 3.5 year. Note: GRE scores are not required. The above items should be hand delivered or mailed to:<br>University of New Mexico School of Architecture and Planning<br>Attn: Graduate Advisor<br>MSC 04-2530<br>2401 Central Avenue NE<br>Albuquerque, New Mexico 87131-0001</p><h2>Contact</h2><p>If you have questions or would like to schedule an appointment, please call the front desk at 505-277-1303 or the graduate advisor at 505-277-1303 or email&nbsp;<a href=\"http://saap.unm.edu/about/sap-people/staff-profiles/elizabeth-rowe.html\">Elizabeth Rowe:</a>&nbsp;&nbsp;<a href=\"mailto:erowe@unm.edu\">erowe@unm.edu</a>.</p>",
  "transfer_agreements": "",
  "career_opportunities": "<p>People need places to live, work, play, learn, worship, meet, govern, shop, and eat. Architects are responsible for designing these places, whether they are private or public; indoors or outdoors; or rooms, buildings, or complexes. Architects discuss with clients the objectives, requirements, and budget of a project. In some cases, architects provide various predesign services, such as feasibility and environmental impact studies, site selection, cost analyses and land- use studies, and design requirements. For example, architects may determine a building’s space requirements by researching its number and types of potential users. After discussing and agreeing on the initial proposal, architects develop final construction plans that show the building's appearance and details for its construction. Accompanying these plans are drawings of the structural system; air-conditioning, heating, and ventilating systems; electrical systems; communications systems; plumbing; and, possibly, site and landscape plans.<br></p><p>In developing designs, architects must follow building codes, zoning laws, fire regulations, and other ordinances, such as those requiring easy access by people who are disabled. Computer-aided design and drafting (CADD) and building information modeling (BIM) technology have replaced traditional drafting paper and pencil as the most common methods for creating designs and construction drawings. Architects also may help clients get construction bids, select contractors, and negotiate construction contracts. As construction proceeds, architects may visit building sites to ensure that contractors follow the design, keep to the schedule, use the specified materials, and meet work-quality standards. The job is not complete until all construction is finished, required tests are conducted, and construction costs are paid. &nbsp;</p><p></p><h1><span class=\"large-bold\"><span class=\"large-bold\"></span></span></h1><h5></h5><h2></h2>",
  "contact_information": "<i><b>Elizabeth Rowe:</b></i>\n<b>Senior Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052771303\">(505) 277-1303</a><br>\n<a target=\"_parent\" href=\"mailto:sedmora@unm.edu\">sedmora@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}