{
  "name": "Art History",
  "degree": "PhD",
  "program_description": "<p>The Department offers degrees in two fields: art studio and art history.&nbsp;The Master of Fine Arts (M.F.A.) degree in Art Studio student can focus on painting and drawing, photography, printmaking, art and ecology, electronic arts, or 3D. Students interested in&nbsp;art history&nbsp;can pursue&nbsp;the Master of Arts (M.A.) and the Doctor of Philosophy (Ph.D.) with a concentration in either the Arts of the Americas or the Arts of the Modern World.</p><p>All students admitted to the graduate studio program are given studio space on campus. Admission is selective and limited by the number of studio spaces available. All photography graduate students are given both darkroom and individual studio spaces.</p><p><strong>NOTE:</strong>&nbsp;The art studio printmaking program and the art history programs in Arts of the Modern World and Arts of the Americas (both M.A. and Ph.D.) are recognized by the Western Interstate Commission on Higher Education (WICHE) for inclusion in their Out-of-State Programs at In-State Tuition. Qualified residents of the 15 participating states in the Commission may enroll at reduced tuition rates in these three programs.</p><p>The general requirements of the University for the M.A. and Ph.D. degrees are given in earlier pages of this catalog. The requirements for the M.F.A. are given within this departmental text.</p>&nbsp;",
  "admission_requirements": "&nbsp;Applicants for admission to the Ph.D. program should have an M.A. in art history or, in exceptional circumstances as approved by the admitting faculty, in such cognate disciplines as history, anthropology, archaeology, or American Studies. Those admitted to the Ph.D. program without an M.A. in art history may be required to take additional graduate courses beyond the minimum Ph.D. requirement of 48 hours of course work; in all cases they must take and pass the M.A. comprehensive examination.<p>As part of the application for admission to graduate study, the student must submit materials as follows:</p><ol><li>Application for Admission, Registration Information and application fee.</li><li>Two sets of official transcripts from all institutions previously attended.</li><li>Three Letters of Recommendation.</li><li><strong>Statement of Intent</strong>. A clearly written statement of intent describing in detail reasons for wishing admission. In evaluating this written statement, both its form and content will be carefully considered. This statement, no more than three pages in length (typewritten), should include the following:<ul><li>&nbsp;&nbsp; • the proposed field of concentration;<br>&nbsp;&nbsp; • a self-evaluation of current work;<br>&nbsp;&nbsp; • an account of any special experiences which might indicate a background in art more extensive than most students with a B.A. degree;<br>&nbsp;&nbsp; • a statement of goals while attending and after completing graduate study;<br>&nbsp;&nbsp; • reasons for choosing the University of New Mexico as a place for graduate study.</li></ul></li><li><strong>Writing Sample.</strong>&nbsp;A recent example of creative scholarship in the form of an academic paper or article must be submitted for evaluation. This material will not be returned unless accompanied by a stamped, self-addressed envelope.</li></ol><p>All items mentioned above should be mailed directly to the Graduate Office, Department of Art and Art History, MSC04 2560, 1 University of New Mexico, Albuquerque, NM 87131-0001.</p><br>",
  "transfer_agreements": "",
  "career_opportunities": "<p>&nbsp;“The art history program emphasizes the study of visual art as a means of understanding the intellectual and cultural history of humanity. The program provides a firm grounding in both western and non-western art history within the context of a liberal arts education. Undergraduate work covers the broad range of art history” (from UNM Art History website). &nbsp;A bachelor's degree is the minimum formal education required. Some areas may require a graduate degree, or may assist employment in highly competitive areas. Art history is a broad degree that can lead to job opportunities in many diverse fields. Therefore, it is critical that students gain related experience and skills through internships, part-time work, or volunteering in their field. &nbsp;Students develop wide-ranging skills in visual/data analysis, communication, human relations, and research/education.&nbsp;</p>",
  "contact_information": "<i><b>Kat Heatherington:</b></i>\n<b>Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052776672\"> (505) 277-6672</a><br>\n<a target=\"_parent\" href=\"mailto:art255@unm.eduu\">art255@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}