{
  "name": "Asian Studies",
  "degree": "BA",
  "program_description": "Asian Studies is an interdisciplinary program bringing together the resources and faculty of various departments at the University of New Mexico relating to Asia. The program facilitates undergraduate major and minor courses of study, supports special courses and lectures with Asian content, and provides scholarships for students wishing to further their Asian language proficiency. An excellent university fosters a culturally comprehensive curriculum with a global perspective. Asia--the largest, historically oldest, and most populous segment of the world--should be prominent in the curriculum. Asian Studies also emphasizes understanding the global village concept from the perspective of historical and everyday experiences of Asian countries and cultures. <br><br>",
  "admission_requirements": "",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Jonathan Porter:</b></i>\n<b>Director </b><br>\n<a target=\"_parent\" href=\"tel:5052775214\">(505) 277-5214</a><br>\n<a target=\"_parent\" href=\"mailto:porter@unm.edu \">porter@unm.edu </a><br><br>",
  "online": "partial",
  "keywords": "Asia Asian Interdisciplinary Multidisciplinary Language Linguistic Culture Cultural Society Social Societal Sociocultural Culturally History Global International World Historical Country Countries Nation National China Science Transformation Middle East Bangladesh Bahrain Afghanistan Armenia Azerbaijan Bhutan Brunei Burma Cambodia Chinese Cyprus East Timor Georgia India Indonesia Iran Iraq Israel Japan Jordan Kazakhstan Kuwait Kyrgyzstan Laos Lebanon Malaysia Maldives Mongolia Nepal North Korea South Oman Pakistan Palestine Philippines Qatar Russia Saudi Arabia Singapore Sri Lanka South Korea Syria Taiwan Tajikistan Thailand Turkey Turkmenistan United Arab Emirates Uzbekistan Vietnam Yemen Beijing Hong Kong new Delhi Tokyo Seoul Pyongyang Ankara Abu Dhabi",
  "moratorium": null
}