{
  "name": "Athletic Training",
  "degree": "BS",
  "program_description": "<strong>Curriculum</strong>\n<p>The University of New Mexico Athletic Training Education Program \n(UNM-ATEP) is dedicated to maintaining an educational program that meets\n the standards and guidelines set forth by the following governing \nbodies: National Athletic Trainers’ Association – Education Council \n(NATA-EC), Board of Certification (BOC); and Commission on Accreditation\n of Athletic Training Education (CAATE).&nbsp; Currently, the UNM-ATEP is \naccredited by CAATE.</p>\n<p><strong>Clinical Education</strong></p>\n<p>The UNM-ATEP includes both didactic (classroom) and clinical \ncomponents.&nbsp; The clinical education allows the athletic training student\n (ATS) to apply theories and concepts learned in the classroom.&nbsp; The \nclinical education includes clinical hours with a variety of athletic \nteams at the high school, intercollegiate, clinical and professional \nlevels.&nbsp; These experiences are invaluable in preparing the ATS for \nfuture employment opportunities.</p>\n<p>Assignments to various clinical settings are designed to expose ATS \nto the various aspects of athletic training.&nbsp; While completing their \nclinical education, the ATS must be directly supervised by a Preceptor. \nAlternative clinical education settings may be utilized and may include \nsports medicine clinics, physical therapy clinics, college or university\n health centers, hospital emergency rooms, physician’s offices, or other\n health care settings.</p>\n<p>A minimum of four semesters of clinical course work are required in \nthe University of New Mexico Athletic Training Education Program.&nbsp; Each \nATS will have the opportunity to gain experience in four major areas: \ngender, varying levels of risk, protective equipment, and medical \nexperiences.</p>",
  "admission_requirements": "Applications are distributed and collected by ATEP Faculty every fall semester to students who have completed or are currently enrolled in pre-requisite classes.",
  "transfer_agreements": "",
  "career_opportunities": "<p>Evaluate, advise, and treat athletes to assist recovery from injury, avoid injury, or maintain peak physical fitness. Their\nclients include everyone from professional athletes to industrial workers. Recognized by the American Medical\nAssociation as allied health professionals, athletic trainers specialize in the prevention, assessment, treatment, and\nrehabilitation of musculoskeletal injuries. Athletic trainers are often one of the first heath care providers on the scene when\ninjuries occur, and therefore must be able to recognize, evaluate, and assess injuries and provide immediate care when\nneeded. &nbsp;A bachelor’s degree from an accredited college or university is required for almost all jobs as an athletic trainer. A\nbachelor’s degree with a major in athletic training from an accredited program is part of the requirement for becoming\ncertified by the Board of Certification (BOC). Athletic trainers may need a master’s or higher degree to be eligible for some\npositions, especially those in colleges and universities, and to increase their advancement opportunities. Because some\npositions in high schools involve teaching along with athletic trainer responsibilities, a teaching certificate or license could\nbe required.&nbsp;</p>",
  "contact_information": "<i><b>Susan McGowen:</b></i>\n<b>Faculty Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052771355\">(505) 277-1355</a><br>\n<a target=\"_parent\" href=\"mailto:yorex@unm.edu\">yorex@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}