{
  "name": "Biochemistry",
  "degree": "BA",
  "program_description": "Biochemistry is an undergraduate major in the College of Arts &amp; Sciences. The Bachelors <br>degree in Biochemistry meets or exceeds all of the curricular recommendations suggested <br>by both the American Chemical Society and the American Society of Biochemistry and <br>Molecular Biology. In addition, the program is consistent with current national <br>recommendations for education practices in the 21st century. <br>Curricular Overview <br>Although the major in Biochemistry is offered by the College of Arts and Sciences, the <br>Department of Biochemistry and Molecular Biology is organizationally and physically part of <br>the School of Medicine just north of the main campus. Some courses are given on the main <br>campus, while more advanced courses and senior research are conducted in two modern, <br>excellently equipped building in the Medical School complex. <br>",
  "admission_requirements": "",
  "transfer_agreements": "",
  "career_opportunities": "<p>The best reason for studying Biochemistry is that it is the study of ourselves and our chemical relationship with the\nenvironment. Beyond this intrinsic interest, Biochemistry is a foundation for many careers. It provides an excellent\npreparation for graduate work in Biochemistry, microbiology, immunology, and other biomedical sciences. Biomedical\nengineering, the designing of materials and instruments for therapy and diagnosis, has roots in Biochemistry. Much of the\nwork of the director of a clinical laboratory is biochemical. Recombinant DNA research and monoclonal antibody\nproduction provide new diagnostic tools, new therapies, new ways to fight pests, improve agriculture, and clean the\nenvironment. Pharmaceutical companies need biochemists to design and evaluate new drugs. The Biochemistry major is\nan excellent preparation for professional training in medicine, dentistry, clinical nutrition, public health, and veterinary\nmedicine. Finally the Biochemistry major, with its broad foundation in biology, chemistry, physics, and math, is an ideal\nprogram for future science teachers. (UNM Department of Biochemistry and Molecular Biology Brochure)&nbsp;</p>",
  "contact_information": "<i><b>Marcy Osgood:</b></i>\n<b>Undergraduate Program Director</b><br>\n<a target=\"_parent\" href=\"tel:5052728184\">(505) 272-8184</a><br>\n<a target=\"_parent\" href=\"mailto:MOsgood@salud.unm.edu\">MOsgood@salud.unm.edu</a><br><br>",
  "online": "partial",
  "keywords": "Biology Chemisty Biologist Chemist Chemicals Molecule Molecular Disease Medical Medicine Clinic Clinical Health Doctor Nurse Pre-med Pre Med Pharmacy Pharmaceutical Pre-pharmacy Dental Dentist Phenomena Pre-dental Metabolism Metabolic Cancer Therapeutics Science Scientist Technology Life Healthcare Laboratory Experiment Observe Experimentation Test Hypothesis Hypothesize Control",
  "moratorium": null
}