{
  "name": "Biology",
  "degree": "PhD",
  "program_description": "&nbsp;The Biology Program has 39 tenure-track faculty, including a National Academy member, a MacArthur Fellow, and three Guggenheim award recipients. Our research is featured regularly in Science and Nature, and covers the gamut of modern biology: from cellular and molecular biology, through ecology and evolutionary biology, to interdisciplinary or computational ventures with the Departments of Mathematics &amp; Statistics, Computer Science, Chemistry, and the Health Sciences Center. The research problems investigated vary from theoretical through computational to applied. Many faculty focus their research in New Mexico and the Southwest, while others explore Mexico, Antarctica, Australia and Africa. We also conduct laboratory-based studies of model organisms, like yeast, C. elegans and Drosophila, and of non-traditional organisms such as marsupials, molluscs and parasites.<p>The Department of Biology also hosts a wide range of research facilities and centers geared toward supporting cutting-edge research. Please visit&nbsp;<a href=\"http://biology.unm.edu/\" target=\"_blank\">our web home page</a>&nbsp;to learn about all our facilities. In short, we have everything we need to support the biological research you wish to carry out.</p><p>The Biology Program offers M.S. and Ph.D. degrees. Our program is thriving—currently, more than 100 students are enrolled—and offers a variety of well-funded research projects that welcome graduate student participation. Our department provides an excellent atmosphere for graduate students to reach their full potential—rigorous, collaborative, and responsive to the need of the students. Graduate students are involved in departmental decisions, and the Biology Graduate Student Association has funds to support research in the department. Ultimately, our graduates are successful in advancing in their chosen careers, and leave UNM having developed friendships and collegial networks that last a lifetime.</p>",
  "admission_requirements": "&nbsp;Applications to the Biology graduate program are reviewed by a departmental committee that evaluates both the potential of the applicant to complete graduate work and the availability of a suitable faculty member to supervise the applicant.<p>In addition, the committee ensures that each applicant meets the following&nbsp;<strong>admission requirements</strong>&nbsp;of:</p><ol><li>a Bachelor's degree from an accredited college or university; the degree must be granted prior to entering the UNM graduate program, but does not have to be in the biological sciences;</li><li>an overall grade point average (GPA) of at least 3.2 (on a 4.0 scale) in biology and other science courses (chemistry, physics and mathematics);</li><li>having taken the GRE within the past five years (the GRE Biology subject test or a subject test in another relevant major discipline is not required, but recommended);</li><li>two semesters of introductory biology, one semester of genetics, and at least 12 hours of upper division (300 and above) biology courses;</li><li>a clearly written letter of intent that demonstrates specific goals and an understanding of graduate education; and</li><li>three letters of recommendation, an official set of transcripts, and a Departmental Application Information Form (see details in the section on Application Procedures).</li></ol><p>Extremely well-qualified students who do not satisfy all of these requirements may petition the selection committee for an exception to be granted.</p><p><strong>Advice on Being a Successful Applicant:</strong></p><ol><li>Review the research interests of the Biology faculty. Admission to the Biology Graduate Program is dependent upon a faculty member agreeing to serve as your advisor. Most successful applicants have communicated with potential advisors prior to submitting an application. This ensures that there are faculty willing to serve as your advisor and that the local research interests suit your goals as well.</li><li>Get your application in early. The Biology Department Graduate Selection Committee (GSC) will review all applications received by January 3rd. Review of applications received after that date will depend upon the availability of positions in the program.</li><li>Make sure your application is complete. The GSC considers the entire portfolio. Complete applications are more informative and generally viewed more favorably.</li><li>Prepare a clear, well-written letter of intent. This is very important. These personal statements are critical for faculty evaluating your goals and fit to their own research interests. This letter also is used to identify potential advisors within the program.</li><li>If you do not meet all of the admission requirements listed above, address this directly in your letter of intent. It is best not to leave potential gaps in your portfolio unaddressed and open to speculation.</li></ol>",
  "transfer_agreements": "",
  "career_opportunities": "<p>&nbsp;Our present-day world offers unprecedented challenges and opportunities for those interested in the science of Biology. The subjects of study for UNM biologists literally span the globe - from bacteria in the Antarctica, Yellowstone's hot springs or New Mexico's deep caves; to parasites from Indian elephants or South American snails; to the immune system of Australia's platypus; to the plants of southern Africa. Studies underway at UNM reveal patterns and processes in entire ecosystems and watersheds, reveal the complexities posed by the 10,000 genes of the bread mold Neurospora, or use the methods of computational biology to explore the redundancy inherent in genetic networks. World class studies of southwestern plants, fruit fly development, fungal genomics, life history theory, biological scaling, and behavioral ecology, to name but a few, are all underway here. The Biology Department is not just for researchers—it is also a great venue for students to explore the mysteries of life&nbsp;(UNM Department of Biology website).&nbsp; A bachelor's degree is the minimum formal education required. However, many employers also require graduate school. For example, they may require a master's degree, and some require a Ph.D., M.D., or J.D. (law degree).&nbsp;</p>",
  "contact_information": "<i><b>Cheryl Martin:</b></i>\n<b>Graduate Program Coordinator</b><br>\n<a target=\"_parent\" href=\"tel:5052771712\">(505) 277-1712</a><br>\n<a target=\"_parent\" href=\"mailto:BioGrad@unm.edu\">BioGrad@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}