{
  "name": "Biomedical Engineering",
  "degree": "MS",
  "program_description": "The M.S. and Ph.D. programs in Biomedical Engineering prepare students for careers in solving engineering problems in health care, biomedical research, and biotechnology. Areas of current faculty research include biomaterials, nanobiotechnology, bioanalytical microsystems, patient-care devices, tissue engineering, flow cytometry, disease processes, clinical translation, and molecular and cellular systems. Instruction includes 5 core courses, a seminar and numerous electives taught by Affiliated Faculty and others within the School of Engineering, School of Medicine, College of Arts and Sciences, and College of Pharmacy.",
  "admission_requirements": "<p>Applications may be submitted for entry to UNM degree programs leading to either the&nbsp;<em>Ph.D. In Engineering With A Concentration In Biomedical Engineering</em>, or the&nbsp;<em>Master's of Science in Biomedical Engineering</em>.</p><p><em>Until further notice, applications to the UNM Biomedical Engineering Graduate Program may be submitted at any time, and will be reviewed upon receipt.&nbsp; Please disregard other notices of deadlines concerning admissions to School of Engineering graduate programs.</em></p><p><strong>How to apply:</strong></p><p><strong>Step 1.</strong>&nbsp;<a href=\"https://www8.unm.edu/pls/banp/zwskauth.p_disploginnew?in_id=&amp;cpbl=&amp;newid=\">Click here</a>&nbsp;or browse to https://www8.unm.edu/pls/banp/zwskauth.p_disploginnew?in_id=&amp;cpbl=&amp;newid=</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - A page will open titled \"Admissions Login - New User\"</p><p><strong>Step 2.</strong>&nbsp;Enter an alphanumeric username of up to 9 characters, and a 6 number PIN.</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - A page will open titled \" Select an Application Type\"</p><p><strong>Step 3.</strong>&nbsp; In the pull down menu, select \"Albuquerque Graduate Studies\", and hit the \"Select\" button</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - A page will open titled \"Select an Application Term\"</p><p><strong>Step 4.</strong>&nbsp;Enter desired application term, and hit the \"Fill out application\" button</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - A form will open titled \" Albuquerque Graduate Studies - Term 2011 - Login ID: xxxxxx\"</p><p><strong>Step 5.</strong>&nbsp;Fill out the form.</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - At the pull down menu titled \"Intended field of study\", select \"PHD Engineering\".</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Regardless of whether you are applying for the&nbsp;<em>Ph.D. In Engineering With A Concentration In Biomedical Engineering</em>, or the&nbsp;<em>Master's of Science in Biomedical Engineering</em>, perform all steps below as given.</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - At the pull down menu titled \"Intended field of study\", select \"PHD Engineering\".</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;- At the pull down menu titled \"If you are applying for a PhD in Engineering, select a program from the list below\", select \"Biomedical Engineering\".</p><br><strong>Step 6.</strong>&nbsp;&nbsp;Upon completing and submitting your application, send an e-mail to<p>Ms.&nbsp;<a href=\"mailto:jowhite@unm.edu\" title=\"Jocelyn White\">Jocelyn White</a>&nbsp;and Professor&nbsp;<a href=\"mailto:graves@unm.edu\" title=\"Steven Graves\">Steven Graves</a></p><p>informing them of your application.</p><p><strong>Step 7.</strong>&nbsp;From each institution you have attended at the college level, request an official transcript be sent to the UNM Office of Admissions. Do not list study abroad programs separately if they are included as part of a transcript program from an accredited U.S. institution.</p><p><strong>Step 8.</strong>&nbsp;By courier, U.S. postal mail, or hand-delivery to</p><p>Ms. Jocelyn White<br>Biomedical Engineering Graduate Program<br>Farris Engineering 209D<br>MSC01 1120<br>1 University of New Mexico<br>Albuquerque, New Mexico 87131</p><p>send the following 2 items:</p><p>- A letter of intent, briefly describing your experience and objectives in undertaking graduate study in Biomedical Engineering, maximum 2 pages, typed, double-spaced. In the letter, state the degree program to which you are applying, either the M.S. or Ph.D.<br><br>- Three letters of recommendation using&nbsp;<a href=\"http://bme.unm.edu/WCMS/common/docs/admissions/BME_Recommendation_Letter_Form.pdf\">this form</a>, in a sealed envelope signed diagonally across the sealed envelope flap.</p><p><strong>Step 9.</strong>&nbsp;Arrange for GRE General Test scores to be sent directly to UNM by the test agency, institutional code 4845.<br><br><strong>Step 10.</strong>&nbsp;Foreign applicants only must arrange for TOEFL scores to be sent directly to UNM.</p><p><br>For further information, contact Ms.&nbsp;<a href=\"mailto:jowhite@unm.edu\" title=\"Jocelyn White\">Jocelyn White</a>&nbsp;, UNM BME Graduate Program +1-505-277-5606.</p>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Jocelyn White:</b></i>\n<b>Program Coordinator</b><br>\n<a target=\"_parent\" href=\"tel:5052775606\">(505) 277-5606</a><br>\n<a target=\"_parent\" href=\"mailto:JoWhite@unm.edu\">JoWhite@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}