{
  "name": "Biomedical Sciences",
  "degree": "PhD",
  "program_description": "<p>Financial support packages are provided by the program for the first 10 months and are offered to all highly qualified, first-year PhD students. As of Fall 2012, students receive an annual stipend of $25,000, payment of student health insurance premiums, and remission of tuition and GPSA fees. Additionally, students are responsible for the payment of certain student fees, including the Health Sciences Center library fee.&nbsp; International students will also be responsible for a one-time UNM Global Education Office fee of $125.00 (subject to change).</p><p>During the first academic year, all students share a one-year core curriculum. Additionally, students complete three separate Research Rotations to get experience and exposure to the various research areas available at the UNM Health Sciences Center.&nbsp;&nbsp;</p><p>The funding for PhD students is provided through the end of the first academic year (May 31) by the BSGP. During the first year, students identify a research mentor who will assume the financial responsibility starting June 1 and provide the resources necessary for the student to conduct their dissertation research. Students are funded by their research mentor (advisor), and/or<a href=\"http://hsc.unm.edu/research/brep/traininggrants.shtm\">training grants</a>, and/or the research mentor’s department. Students are responsible for identifying a research mentor prior to end of the first academic year in order to continue to progress in the program. The program provides guidance and a variety of opportunities during the first academic year of the program for students to successfully identify research mentors.</p><p>At the end of the first year, PhD students choose a research advisor, declare an area of specialization, and take and pass a qualifying exam so that they may advance to candidacy. Students also choose a faculty Committee on Studies to help guide them through their thesis/dissertation research. In their third or fourth year, all students must successfully complete a comprehensive examination which is administered by their Committee on Studies.</p><p>The next generation of experimental biomedical scientists must be equipped to work productively and in teams with mathematical, computational and physical scientists and engineers in order to answer critical biological questions in the 21st century. There are<a href=\"http://hsc.unm.edu/research/brep/traininggrants.shtm\">different interdisciplinary opportunities</a>&nbsp;for BSGP students beginning in their second year.</p>In subsequent years, students complete advanced coursework and laboratory research in preparation for completing their PhD dissertation. Most students complete their PhD degrees within 4-6 years.&nbsp;",
  "admission_requirements": "&nbsp;<ul><li>BS, BA, or equivalent 4-year degree from an accredited US institution or a recognized foreign institution</li><li>Overall 3.0 GPA on a 4.0 scale (also preferred in all science courses)</li><li>&nbsp;Completion of the following coursework, with a grade of “B” or higher:<ul><li>&nbsp;Biological Sciences:&nbsp; 2 Semesters</li><li>General Chemistry:&nbsp;&nbsp;&nbsp;&nbsp; 2 Semesters</li><li>Organic Chemistry:&nbsp;&nbsp;&nbsp;&nbsp; 2 Semesters</li><li>Physics: &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp; &nbsp;&nbsp;&nbsp; 2 Semesters</li><li>Biochemistry:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp; 1 Semester</li><li>Calculus:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp; 1 Semester</li></ul></li><li>Official GRE scores:&nbsp; Revised GRE minimum scores will be posted as soon as the Admissions Committee has had time to study the concordance released by ETS<ul><li>Minimum combined (Verbal + Quantitative) score of 1000 (or the revised GRE equivalent)<ul><li>A minimum GRE Verbal score of 450 or 150-152 revised GRE Verbal score</li><li>A minimum GRE Quantitative score of 550 or 146-147 revised GRE Quantitative score</li></ul></li><li>&nbsp;Minimum of 3.5 on the Analytical Writing test</li><li>Subject scores are not required and will not be considered</li></ul></li><li>Official TOEFL scores (<em>international students only</em>)<ul><li>Minimum score of 92 iBT</li></ul></li><li>Previous laboratory research experience; not required, &nbsp;but highly desirable</li><li>Technical Standards Required to Perform the Essential Functions of the BSGP Curriculum:<ul><li>Observation:&nbsp; The applicant must be able to function effectively in a laboratory setting and must be able to observe and accurately acquire information from numerous sources, including, but not limited to, written documents, images, lectures, and videos.&nbsp; This requires functional visual, auditory, and somatic sensation.</li><li>Communication:&nbsp; The applicant must be able to effectively speak, read, write, and comprehend English in order to communicate his or her discoveries to the scientific community.</li><li>Motor function and coordination:&nbsp; The applicant must have sufficient motor function to perform the required laboratory tasks.&nbsp; This may include both gross and fine motor function, as well as the functional use of touch, vision, and hearing.</li><li>Intellect:&nbsp; The applicant must be able to identify, define, and solve problems, with the ability to accurately measure, calculate, reason, integrate, analyze and synthesize data, and to apply these skills in a variety of settings.</li><li>Professionalism:&nbsp; The applicant must possess good emotional health and be capable of developing and retaining mature, professional, responsible, and effective relationships, to exercise good judgment, and to demonstrate the degree of honesty and integrity outlined in the Biomedical Research Education Program Code of Professional Conduct.</li><li>Applicants must be able to meet the technical standards with or without reasonable accommodation.</li></ul></li></ul><p>In accordance with the Americans with Disabilities Act (ADA), The University of New Mexico School of Medicine Biomedical Sciences Graduate Program will implement policy and procedures to ensure equal access to educational opportunities for persons with disabilities.</p>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Sarah Martinez:</b></i>\n<b>Senior Program Manager</b><br>\n<a target=\"_parent\" href=\"tel:5052721921\">(505) 272-1921</a><br>\n<a target=\"_parent\" href=\"mailto:STMartinez@salud.unm.edu\">STMartinez@salud.unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}