{
  "name": "Chemistry",
  "degree": "PhD",
  "program_description": "&nbsp;Most graduate students enroll in this program. While at least 18 credit hours of formal lecture courses at the 500 level are required for the degree, the central focus is on research. This effort culminates in the preparation and defense of a dissertation describing an original contribution to the field of chemistry. Intensive training in research prepares Ph.D. candidates for a career in university teaching and research, industrial or governmental research, or college teaching.<p>The Ph.D. preliminary examination includes two components: cumulative examinations and the oral defense of a research proposal. The cumulative examinations are used to ensure that each student develops adequate depth of knowledge in one or more of the broad areas of chemistry: analytical, biological/biophysical, inorganic, organic, physical. These examinations are given eight times each academic year. A student must pass five of the examinations within sixteen attempts in order to be admitted to candidacy for the Ph.D. degree. The cumulative examinations generally emphasize a knowledge of chemistry fundamentals and familiarity with the current literature.</p><p>During the student's fourth semester in the program, he or she is expected to prepare, present, and defend a proposal that defines the goals, rationale, and methodology of the anticipated research. The research proposal is presented in seminar form and is then defended orally before the student's Committee-on-Studies. This defense provides the oral examination traditionally required for admission to candidacy for the Ph.D. degree. After admission to candidacy, the student completes the dissertation research and writes the dissertation under the supervision of the research advisor. The final examination for the Ph.D. is an oral defense of the dissertation.</p><p>The time required to complete all requirements for the Ph.D. degree depends on the student's preparation prior to entering the program and on his or her drive and perseverance in following through a research plan. However, many students are able to earn a Ph.D. in four to five years.</p>",
  "admission_requirements": "&nbsp;Chemistry&nbsp;and Chemical Biology normally accepts applications for Fall semester only. For best consideration, the applications should be submitted before February 1. Late applications&nbsp;are considered on the basis of availability. Only completed files&nbsp;are reviewed and it is the responsibility of the applicant to make sure all required materials are sent in a timely fashion. The applicants are strongly urged to allow adequate time (6 to 8 weeks prior to the department deadline) for processing and mail delivery of the application. The department does not accept faxed or Xerox copies of any information.",
  "transfer_agreements": "",
  "career_opportunities": "<p>&nbsp;The Department of Chemistry and Chemical Biology at the University of New Mexico has both undergraduate and graduate degree programs. An undergraduate B.A. or B.S. degree in chemistry provides a range of career choices from medicine to quantum theory. Undergraduate research opportunities exist in all fields and the Department encourages chemistry majors to pursue independent research with a faculty mentor. The graduate program offers the M.S. and Ph.D. degrees in analytical, biological, biophysical, inorganic, organic, theoretical and physical chemistry. (UNM Department of Chemistry and Chemical Biology website) &nbsp;A bachelor's degree is the minimum formal education required. However, many employers&nbsp;also&nbsp;require graduate school. For example, they may require a master's degree, and some require a Ph.D., M.D., or J.D. (law degree).&nbsp;</p>",
  "contact_information": "<i><b>Karen McElveny:</b></i>\n<b> Program Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052776655\">(505) 277-6655</a><br>\n<a target=\"_parent\" href=\"mailto:kamc@unm.edu\">kamc@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}