{
  "name": "Chemical Engineering",
  "degree": "MS",
  "program_description": "<p>Chemical engineers are at the forefront of biotechnology and\nbiomedicine, semiconductor manufacturing and data storage devices, and advanced\nmaterials.&nbsp;Chemical engineering is also widely applied to environmental\nprotection and remediation, process development and safety, and hazardous waste\nmanagement.&nbsp;</p><p>The <b>Chemical Engineering undergraduate program at the University of New Mexico</b>\n offers broad training in the fundamentals of mathematics, physics, \nchemistry and the engineering sciences. These are integrated with the \nchemical engineering “core” which includes&nbsp;thermodynamics, heat, \nmomentum and mass transport, chemical reaction engineering, design, and \nprocess control.&nbsp;More than half of our undergraduate students\nparticipate in the cutting-edge research projects of our faculty, \nsometimes\nleading to opportunities to travel and present at conferences.&nbsp;<br></p><p>Among the exciting research areas, UNM\nchemical engineers apply principles of biology to address drug delivery for\ncancer treatment and understand the mechanisms of degenerative diseases, and\ndevelop new materials for tissue repair, medical diagnosis, and next-generation\nenergy technology. </p><p>This research is conducted in\nwell-funded programs through the Center for Biomedical Engineering, Center for\nEmerging Energy Technology, and the Center for Microengineered Materials.</p><p>\n\n</p><p>The program is accredited by the\nEngineering Accreditation Commission of ABET,&nbsp;<a href=\"http://www.abet.org/\" target=\"_Blank\">http://www.abet.org/</a>.</p>&nbsp;",
  "admission_requirements": "<ul><li>Domestic and International applications should apply to the University online (<a href=\"https://app.applyyourself.com/AYApplicantLogin/fl_ApplicantLogin.asp?id=unmgrad\" target=\"_blank\">https://app.applyyourself.com/AYApplicantLogin/fl_ApplicantLogin.asp?id=unmgrad</a>).<br><br></li><li>The online application process will guide you through which materials are required by the University to finalize your application.<br><br></li><li>The department also requires GRE General Test scores, a Letter of Intent, and three letters of recommendation.<br><br></li><li>The Letter of Intent should briefly describe your experience and objectives in undertaking graduate study in Chemical Engineering and can be submitted through the online system.<br><br></li><li>GRE scores and TOEFL scores (for international applicants) are required and should be submitted to the University directly by ETS (Institution code = 4845; do department code is needed). During the online process, please report your scores unofficially for review.<br><br></li><li>Recommendation letters should be submitted directly by your recommenders through the online system. Specific directions are included within the application system.</li></ul><p><strong></strong></p><br><strong>Deadlines</strong><br><br><table><tbody><tr><td><strong>Semester</strong></td><td><strong>Priority Deadline</strong></td><td><strong>Final Deadline</strong></td></tr><tr><td>Fall</td><td>January 15</td><td>July 15 (Domestic)<br>March 1 (International)<br><br></td></tr><tr><td>Spring</td><td>July 15</td><td>November 10 (Domestic)<br>August 1 (International)<br><br></td></tr><tr><td>Summer</td><td>April 29 (Domestic)<br>January 1 (International)</td><td>April 29 (Domestic)<br>January 1 (International)<br><br></td></tr></tbody></table><p>Apply by the priority deadline for best consideration for reserach assistantships or other departmental financial aid.</p><p>&nbsp;</p>",
  "transfer_agreements": "",
  "career_opportunities": "<p>Design chemical plant equipment and devise processes for manufacturing chemicals and products, such as gasoline,\nsynthetic rubber, plastics, detergents, cement, paper, and pulp, by applying principles and technology of chemistry,\nphysics, and engineering. &nbsp;A bachelor's degree is the minimum formal education required. However, many employers also require graduate\nschool and some require a Ph.D., M.D., or J.D. (law degree).&nbsp;</p>",
  "contact_information": "<i><b>Jocelyn White:</b></i>\n<b>Program Advisement Coordinator</b><br>\n<a target=\"_parent\" href=\"tel:5052775606\">(505) 277-5606</a><br>\n<a target=\"_parent\" href=\"mailto:jowhite@unm.edu\">jowhite@unm.edu</a><br><br>\n<i><b>Sang Han:</b></i>\n<b>Professor and Graduate Advisor </b><br>\n<a target=\"_parent\" href=\"tel:5052773118\">(505) 277-3118</a><br>\n<a target=\"_parent\" href=\"mailto:meister@unm.edu\">meister@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}