{
  "name": "Chicana and Chicano Studies",
  "degree": "BA",
  "program_description": "<p>The Chicana and Chicano Studies program at the University of New Mexico is an interdisciplinary program with a foundation in Chicano and Latino studies. The mission of the program is to promote critical understanding of Chicano Hispano Mexicano communities through teaching, research, and community partnerships. This program accomplishes its mission by offering an undergraduate major, minor, and two certificate programs as well as sponsoring and participating in community initiatives and public lectures. The curricula and community engagement efforts focus on (1) Chicana and Chicano cultural studies, (2) politics and social justice, and (3) the transnational US-Mexico experience. Our curricula areas allow us to offer courses concerned with gender and sexuality, race and ethnicity, arts and culture, political and social mobilization, immigration and citizenship, history and heritage, land grant studies, Chicana feminism and Queer theory. The three areas are addressed through a curricula taught in both English and Spanish and maintain a regional and transnational focus in New Mexico, the U.S. Southwest, and Mexico.</p><p>Students may take any of the Chicana and Chicano Studies courses as electives, or they may enroll in the Chicana and Chicano Studies Minor or certificate programs through the&nbsp;College of Arts and Sciences Advisement Center. Additionally, students in the Bachelor of Liberal Arts&nbsp;or in American Studies may design a special focus in Chicana and Chicano Studies for their major. <br></p>&nbsp;",
  "admission_requirements": "",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Antoinette Marie Rael:</b></i>\n<b>Administrative Assistant</b><br>\n<a target=\"_parent\" href=\"tel:5052776414\">(505) 277-6414</a><br>\n<a target=\"_parent\" href=\"mailto:arael64@unm.edu\">arael64@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": "Chicana Chicano Mexico Mexicano Latin Latino America Hispanic History Historical Culture Cultural Social Society Sociocultural Interdisciplinary Multidisciplinary politics policies political educational economic economy art artistic analysis analyze language linguistic ethnic community organize organizations global globe world international",
  "moratorium": null
}