{
  "name": "Civil Engineering",
  "degree": "MS",
  "program_description": "<p>Civil\nengineers plan, design and develop communities, roads, bridges, buildings, and\ntransit systems while solving problems associated with water resources, energy,\nand pollution.&nbsp;</p>\n\n<p>The <b>Civil Engineering undergraduate&nbsp;program at the University of New Mexico</b> is designed to enable future engineers\nto enjoy both the opportunity to tackle a wide variety of problems and the\nsatisfaction of being at the forefront of action in serving society.&nbsp;Students\nchoose an emphasis in geotechnical, environmental, structural, transportation,\nor water resources. During the first two years, courses include physical sciences,\nmath, and engineering. The following two years include civil engineering\nclasses capped by a senior design course in which teams of students work on\nreal engineering projects.&nbsp; </p><p>The UNM Department of Civil Engineering focus is on\nsustainability and sustainable infrastructure. Green building practices and\nindustrial ecology are just some of the Department's&nbsp;teaching and research areas.&nbsp;</p>\n\n<p>The program is accredited by the\nEngineering Accreditation Commission of ABET,&nbsp;<a href=\"http://www.abet.org/\" target=\"_Blank\">http://www.abet.org/</a>.</p>&nbsp;",
  "admission_requirements": "",
  "transfer_agreements": "",
  "career_opportunities": "&nbsp; &nbsp; &nbsp;&nbsp;With a degree in Civil Engineering from UNM, students are&nbsp;ready to:<p></p><ul><li>Improve drinking water and wastewater treatment<br></li><li>Design and implement sustainable technologies<br></li><li>Develop and maintain high-tech structures and transportation systems<br></li><li>Repair infrastructure all around the globe<br></li></ul><p></p>",
  "contact_information": "<i><b>Missy Garoza :</b></i>\n<b>Coordinator of Program Advisement</b><br>\n<a target=\"_parent\" href=\"tel: 5052776633\"> (505) 277-6633</a><br>\n<a target=\"_parent\" href=\"mailto:mgaroza@unm.edu \">mgaroza@unm.edu </a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}