{
  "name": "Classical Studies",
  "degree": "BA",
  "program_description": "<p>Whether you dream of reading Homer and Vergil in the original or want to understand how ancient Greece and Rome continue to exert a powerful influence upon contemporary culture, Classical Studies offers a comprehensive program of classical languages, cultures and traditions with several options to choose from.</p><p>The major in Classical Studies has two concentrations: students who wish to engage in a variety of approaches and disciplines (such as History, Art History, Philosophy, and Religious Studies) choose the Civilization Concentration, while students whose main focus is to read classical works in the original Greek and Latin choose the Language Concentration.</p><p>There are also minors in Classical Studies, Greek, and Latin.&nbsp;\n\t\t\n\t</p>",
  "admission_requirements": "",
  "transfer_agreements": "",
  "career_opportunities": "<p>Classical studies is particularly concerned with the ancient cultures of the Greeks and Romans – the Greek and\nRoman languages and literatures, art and material cultures, philosophy, history, political theory, law, and religion.\nTopics that concerned the ancient Greeks and Romans are still valuable to today’s society. These include the nature of\nfate, identity and gender, the individual and society, the nature of good and evil, the nature of truth and reality, the\nresponsibility of the individual, the best form of government, definitions of justice and law, and the meaning of heroism.\nA concentration in classical studies helps prepare students who later want to pursue studies in medicine, law,\ngovernment, and other professions. The study of classics is widely regarded as good preparation for those fields, and\nis especially good preparation for law school, since both law and classics emphasize careful reading and analysis of\ntext.&nbsp;</p>",
  "contact_information": "<i><b>Osman Umurhan:</b></i>\n<b>Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052774771\">(505) 277-4771</a><br>\n<a target=\"_parent\" href=\"mailto:umurhan@unm.edu\">umurhan@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": "Classic Classical Foreign Language Literature Literary Latin Ancient Greek archaeology art history humanities english philosophy medieval athens athenian rome roman culture cultural social compare comparitive",
  "moratorium": null
}