{
  "name": "Clinical Laboratory Sciences",
  "degree": "MS",
  "program_description": "<p>The Medical Laboratory Sciences Program trains students to enter the fast paced world of the Medical Technologist (MT)/Clinical Laboratory Scientist (CLS). This career encompasses clinical testing in the fields of chemistry, hematology, microbiology, immunology, urinalysis, and blood banking. With the significant advances in medical research, health care has become increasingly dependent on a growing number of complex laboratory tests and procedures to diagnose and treat diseases. The MT/CLS student will become an important member of the health care team who will be responsible for providing this essential service.</p><p>The MT/CLS profession requires a broad general science background and specialized laboratory education to become proficient in the performance of laboratory procedures. After graduation, our students will be able to choose from a variety of career paths ranging from management to clinical bench work in a hospital or research laboratory. They will be responsible for the quality and accuracy of these lab results, providing critical information for diagnosis and treatment of patients. Our trained professionals will find challenging opportunities for employment in hospitals and independent laboratories, physicians’ offices, clinics, research, industry, and educational institutions.</p>",
  "admission_requirements": "<p>Formal admission to the University is an initial requirement for admission to the Master of Science in Clinical Laboratory Science Degree Program. Applications for graduate admission and information are available from the Program of Medical Laboratory Sciences, University of New Mexico, HSSB 217, 505-272-5434. Acceptance into the program will be based on the recommendations of the Department of Pathology and the Admissions Committee.</p><p>Up to 5 students are admitted each year into the Master of Science in Clinical Laboratory Science Program. A good academic record is essential, but it does not guarantee acceptance. Screening of applications for Fall admission will begin on June 15th each year. Applications received by this date will be given first consideration for admission. Applications received after this date but before the University deadline for the Fall semester will be considered on a space available basis only. Students are admitted once a year, with classes beginning in the Fall semester. Students must have a baccalaureate degree and have at least a 3.0 on the last 50 credits or total of their bachelor degree program. Six basic areas are considered in the selection process:</p><ol><li>Earned baccalaureate degree</li><li>Certified Medical Technologist/Clinical Laboratory Scientist</li><li>The student’s academic record</li><li>Three letters of Reference</li><li>Life Experiences</li><li>Personal Interview</li></ol><p>Hard copy applications may be requested directly from the Office of Admissions or downloaded from the Graduate Studies Web site (<a href=\"http://www.unm.edu/grad/\">http://www.unm.edu/grad</a>). The Graduate Studies office holds application files for two years.</p><p>Deadline: Applications are due no later than June 15th. Admission is for the Fall semester of the same year of application. Those applicants who are provisionally selected will be notified in early July. However all applicants will be notified of their admission status. Selection will be given to qualified persons regardless of their race, color, religion, national origin, age, qualified disability or military involvement. Equal opportunity for admission is given to all qualified applicants.</p><p>Advisement and Interview sessions will be scheduled through the Program of Medical Laboratory Sciences. Call the office at (505) 272-5434 for an appointment.</p><br>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Susan Dellinger:</b></i>\n<b>Administrative Assistant</b><br>\n<a target=\"_parent\" href=\"tel:5052725434\">(505) 272-5434</a><br>\n<a target=\"_parent\" href=\"mailto:SDellinger@salud.unm.edu\">SDellinger@salud.unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}