{
  "name": "Clinical and Translational Science",
  "degree": "Grad Certificate",
  "program_description": "The Certificate Program in Clinical and Translational Science (CTS) is \n\tdesigned to meet the needs of a variety of learners who are seeking exposure \n\tto clinical and translational research competencies.&nbsp; The CTS Certificate \n\tProgram, along with the Master of Science in Biomedical Sciences, Clinical \n\tResearch concentration (<a href=\"http://hsc.unm.edu/research/brep/mscrabout.shtm\">MS-BIOM-CR</a>), is an \n\teducational component of the UNM HSC Clinical and Translational Science \n\tCenter (CTSC). The CTSC is a Health Sciences Center initiative to integrate \n\tand expand the reach of biomedical research from the laboratory to clinical \n\tand medical practice: promoting a bench to bedside to community effort. \n\tIncreasingly, pressing global health problems have led educators to \n\taccelerate the training of clinical, basic science, and translational \n\tresearchers. Therefore, this program will provide students the basic tools \n\tnecessary to translate scientific discovery into actionable solutions.",
  "admission_requirements": "The CTS Certificate Program is open to individuals that have already \n\tcompleted doctoral-level training in the areas of basic science, public \n\thealth, medical, clinical, engineering or social science (MD, PhD, PharmD, \n\tScD, etc). Individuals with a strong interest in expanding their skills in \n\tClinical and Translational research who are receiving additional training at \n\tUNM (i.e. post-doctoral and clinical fellows), or those that are currently \n\temployed at UNM as junior faculty are strongly encouraged to apply. \n\tAdditionally, students currently seeking a graduate degree in these \n\tareas may be considered for admission, if space is available.",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Sarah Martinez:</b></i>\n<b>Senior Program Manager</b><br>\n<a target=\"_parent\" href=\"tel:5052721921\">(505) 272-1921</a><br>\n<a target=\"_parent\" href=\"mailto:STMartinez@salud.unm.edu\">STMartinez@salud.unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}