{
  "name": "Communication",
  "degree": "PhD",
  "program_description": "<p>Concentrations: intercultural communication, health communication and mass communication</p><p>Doctoral study in the Department of Communication and Journalism aims to prepare students to become scholars and professionals who are conversant with one or more areas in the field of communication. Departmental faculty offer courses in intercultural communication, health communication and mass communication. Because of the wide diversity of disciplinary approaches represented in the work of the department, the graduate program is open to students with undergraduate preparation in communication, journalism, the humanities, the social sciences and other fields related to the study of human communication. For all candidates, admission must be approved by the departmental committee on graduate studies.</p><p>Academic requirements for the Ph.D. in Communication consist of an intensive program of course work, research and professional development. The doctoral degree requires a minimum of 48 graduate credit hours with at least 36 graduate credit hours of course work beyond the Master’s degree.</p>&nbsp;",
  "admission_requirements": "&nbsp;<p>All application materials submitted remain the property of the University of New Mexico and will not be returned. The University and the Department require a 3.0 GPA for admission to graduate study. The evaluation of your application will be based on a composite assessment of the materials listed below.&nbsp;<br><br><a name=\"Forms\"></a>1.&nbsp;<b>Application for Admission</b>&nbsp;and&nbsp;<b>Registration Information Form.</b>&nbsp;For a copy of these forms, go to&nbsp;<a href=\"http://ogs.unm.edu/resources/ogs-forms/index.html\" target=\"_blank\">OGS Forms.</a>&nbsp;For International students,click on the \"Start International Application\" button. Our major code is 284 (#17) and our graduate unit is communication (#16).</p><p><a name=\"Scores\"></a>2.&nbsp;<b>GRE General Test scores</b>&nbsp;(and&nbsp;<b>TOEFL/The Michigan Test</b>&nbsp;for international students). For a site that carries several practice tests, including the GRE, click<a href=\"http://www.testpreview.com/\">here</a>.&nbsp;<br></p><ul><p><b>The GRE General Test</b><br>The Communication &amp; Journalism Graduate Committee requires a combined Verbal and Quantitative score that equals at least 300. The GRE is available as a computer-based exam. Information on computerized tests and test dates for the GRE are available at your nearest University Testing Center (advanced registration is required) or you may call (609) 771-7670, Educational Testing Services in Princeton, New Jersey or reach their website&nbsp;<a href=\"http://www.gre.org/\">here.</a>&nbsp;The UNM Testing Center's phone number is (505) 277-5345. When filling out your registration, you will be asked to write in codes for institutions to which you want your scores sent. Our department codes are as follows: Institution - 4845; Department - 4506 or 4599.<br><br><b>TOEFL or The Michigan Test</b>&nbsp;(for International Applicants only)<br>International applicants must have, in addition to the GRE scores, certified results of the TOEFL or The Michigan Test sent to the Office of International Admissions. These scores will then be forwarded to the Department. Although the UNM Office of International Admissions considers a score of 560 on the paper-based TOEFL as a qualification to process an application for admission,&nbsp;<b>our department requires a score of at least 600</b>. If you are taking the computer-based TOEFL, the required score is 250. On the Michigan Test, your score needs to be at the 80thpercentile or above. All scores must arrive at the Office of International Admissions before the deadline in order for your file to be reviewed. For a TOEFL link, go to the international admissions link&nbsp;<a href=\"http://www.unm.edu/~apply/intlgrad.htm/\">here</a>.</p></ul><a name=\"Transcripts\"></a>3.&nbsp;<b>One official transcript</b>&nbsp;from each institution that you have attended must be sent to the Deparment of Communication and Journalism. A second official copy must be sent to UNM Admissions. Specifically, an official transcript must have a seal, stamp, or signature from a designated official. International students must send one official transcript in the original language and one official transcript in English.&nbsp;<br><br>4.&nbsp;<b>Official Diplomas or Degree Certificates</b>&nbsp;(if you are an International Student) one in the original language and one in English from each institution. A second copy must be sent to UNM's International Admissions Office.&nbsp;<br><br><a name=\"Letters\"></a>5.&nbsp;<b>Letters of Recommendation (3-4)</b>. Recommendations should come from former professors or those who are familiar with your academic work. Recommendations from graduate students (i.e., teaching assistants) are not appropriate. Academic recommendations are more helpful and carry more weight than do those from current/previous employers. The writer of the letter should seal the envelope and sign along the seal. U.S. residents please use the forms that are available at the OGS website&nbsp;<a href=\"http://ogs.unm.edu/resources/ogs-forms/index.html\" target=\"_blank\">here</a>. Go to OGS Forms.&nbsp;<br><br><a name=\"Statement\"></a>6.&nbsp;<b>Written Statement of Purpose/Letter of Intent</b>&nbsp;Your statement should be a total of at least three double-spaced typed pages.<br><ul><p><b>Part One:&nbsp;</b>Identify your specific interests in Communication and any special areas of study in our Department (intercultural, interpersonal, organizational, rhetorical, health, or mass communication). Talk about why you are interested in our program.&nbsp;<br><br><b>Part Two:&nbsp;</b>Describe a study or project that you would want to investigate during your graduate studies in Communication. Cite publications and other resources that you used to develop your statement of purpose.</p></ul><a name=\"Resume\"></a>7.&nbsp;<b>Résumé</b>&nbsp;or&nbsp;<b>Academic Vita</b>&nbsp;<br><br><a name=\"Assistantship\"></a>8.&nbsp;<b>Application for Teaching</b>&nbsp;or&nbsp;<b>Research Assistantship</b>&nbsp;can be downloaded as a<a href=\"http://www.unm.edu/~cjdept/academic/tara_app.pdf\">PDF form</a>. Additional information on asssistantships can be obtained<a href=\"http://www.unm.edu/~cjdept/academic/assistant.html\">&nbsp;here</a>.<a name=\"Sample\"></a>9.&nbsp;<b>All Ph.D. applicants must also submit a writing sample</b>&nbsp;(i.e., articles submitted for publication, conference papers, chapters of thesis, paper for a class). Videotapes are not appropriate.&nbsp;<br><br><a name=\"Fee\"></a>10.&nbsp;<b>An application fee of $50.00.</b>&nbsp;A check or money order should be made out to the University of New Mexico. The fee is non-refundable and cannot be waived. The University will not process your application until they receive the application fee. Please note,&nbsp;<i>Do not send the application fee to the department.</i>Send the application fee to the Office of Admissions, or the Office of International Admissions.&nbsp;<br><br><a name=\"More\"></a>11.&nbsp;<b>Any additional material</b>&nbsp;that you think will be useful to us in evaluating your application should be sent to the department.&nbsp;<br><br>If you have questions regarding the admission process or procedures, please contact the administrative assistant for the graduate program at (505) 277-1903. If you have any questions about the graduate program as a whole, contact&nbsp;<a href=\"mailto:ilia@unm.edu?subject=Prospective%20grad%20student%20question\">Dr. Ilia Rodríguez</a>&nbsp;or&nbsp;<a href=\"mailto:schaefer@unm.edu?subject=Prospective%20grad%20student%20question\">Dr. Richard Schaefer</a>, Co-Graduate Directors. For information on reapplications or readmission applications, or Change of Degree/Major applications, please see the \"Admission/Readmission Guidelines\" in your packet or call or write with your questions. <br>",
  "transfer_agreements": "",
  "career_opportunities": "<p>&nbsp;UNM’s B.A. degree in Communication “helps to prepare students for a variety of careers including: sales, positions in organizations emphasizing internal communication, organizational training, management, human resources, or any career that involves or emphasizes communication” (from the UNM Department of Communication &amp; Journalism website). Students choose to focus on one of five areas: intercultural communication, interpersonal communication, mass communication, organizational communication, or rhetoric. &nbsp;A bachelor's degree is the minimum formal education required. Some areas may require a graduate degree, or may assist employment in highly competitive areas. Communication is a broad degree that can lead to job opportunities in many diverse fields. Therefore, it is critical that students gain related experience and skills through internships, part-time work, or volunteering in their field of interest as undergraduates. Information on C&amp; J internships can be found at: http://www.unm.edu/~cjdept/curriculum/internships.html&nbsp;</p>",
  "contact_information": "<i><b>   Gregoria A. Cavazos :</b></i>\n<b>Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel: 5052771903\"> (505) 277-1903</a><br>\n<a target=\"_parent\" href=\"mailto:cjadvise@unm.edu \">cjadvise@unm.edu </a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}