{
  "name": "Community and Regional Planning",
  "degree": "MCRP",
  "program_description": "<p>The MCRP degree program is a two-year course of study requiring minimum of 50 credits of course work as indicated in the program of study; the Graduate Review; and a thesis or professional project to be presented in public. The MCRP degree is designed to allow students to pursue a concentration consistent with their professional objectives. The completion of a concentration allows students to match academic interests with potential employment opportunities. There are three MCRP Concentrations offered:</p><h3><a href=\"http://saap.unm.edu/academic-programs/community-regional-planning/graduate-degree.html#\">Community Development</a></h3><h3><a href=\"http://saap.unm.edu/academic-programs/community-regional-planning/graduate-degree.html#\">Natural Resources &amp; Environmental Planning</a></h3><h3><a href=\"http://saap.unm.edu/academic-programs/community-regional-planning/graduate-degree.html#\">Physical Planning &amp; Design</a></h3><br>&nbsp;",
  "admission_requirements": "&nbsp;<h2>About</h2><p>The MCRP degree program is a two-year course of study designed to allow students to pursue a concentration consistent with their professional objectives.&nbsp; Three concentrations are offered:&nbsp;Community Development, Natural Resources and Environmental Planning, and Physical Planning and Design. The completion of a concentration allows students to match academic interests with potential employment opportunities.</p><h2>Applications</h2><p>Applications are accepted primarily for the fall semester. Spring admission will be considered for special circumstances only. Applications are not considered for the summer term.&nbsp; The priority postmark deadline for the fall semester is January 30th; however, applications will be accepted through June 15 on a space available basis. Prospective applicants should consult the&nbsp;<a href=\"http://catalog.unm.edu/catalogs/2012-2013/colleges/architecture/comm-reg-plan/graduate-program.html\">Graduate Program</a>&nbsp;section of the Catalog to review current policies and guidelines.</p><p>The following materials must be sent electronically to the UNM Admissions Office:</p><ul><li><a href=\"http://www.unm.edu/apply/\">UNM Graduate Admissions Application</a></li><li>Application $50 Admission fee</li></ul><p>In addition, applicants must send the following materials to the Community &amp; Regional Plannign Program:</p><ul><li>Letter of Intent</li><li>Three Letters of Recommendation (one must be from an academic source, i.e. professor or advisor)</li><li>Curriculum Vitae (Resume)</li><li>Official transcripts from all higher education institutions attended.</li></ul><p><strong>Materials are evaluated based on the critera below:</strong></p><h3>Strength of the Letter of Intent based on the following</h3><h3>Demonstrated capacity to do high quality graduate study</h3><h3>Strength of letters of Recommendation</h3><h2>Contact</h2><p>For questions about the MCRP admissions process, please contact&nbsp;<a href=\"http://saap.unm.edu/about/sap-people/staff-profiles/elizabeth-rowe.html\">Beth Rowe,</a>&nbsp;SA•P Graduate Advisor: (505) 277-1303,&nbsp;<a href=\"mailto:erowe@unm.edu\">erowe@unm.edu</a>.</p><p>CRP Program Mailing Address:<br>Community + Regional Planning Program<br>ATTN:&nbsp; Graduate Advisor<br>MSC04 2530<br>1 University of New Mexico<br>Albuquerque, NM 87131-0001</p><h2>Admissions Decisions</h2><p>The Admissions Committee reviews, discusses, and ranks all applications,identifying the degree to which each meets the criteria and satisfies the academic prerequisites. Applicants then are notified whether they are:</p><ul><li>Admitted</li><li>Conditionally admitted pending receipt of formal contents of the application</li><li>Placed on the waiting list for admission should a space open up</li><li>Not Admitted</li></ul><p>Those who do not gain admission are encouraged to contact the&nbsp;<a href=\"http://saap.unm.edu/academic-programs/community-regional-planning/directors-message.html\">CRP Director</a>&nbsp;for an explanation and to assess the feasibility of a successful reapplication.</p>",
  "transfer_agreements": "",
  "career_opportunities": "<p>Planners develop long- and short-term plans to use land for the growth and revitalization of urban, suburban, and rural\ncommunities, while helping local officials make decisions concerning social, economic, and environmental problems. In large\norganizations, planners usually specialize in a single area, such as transportation, demography, housing, historic\npreservation, urban design, environmental and regulatory issues, or economic development. In small organizations, planners\ndo various kinds of planning. (UNM CRP website).&nbsp;</p>",
  "contact_information": "<i><b>Elizabeth Rowe:</b></i>\n<b>Senior Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052771303\">(505) 277-1303</a><br>\n<a target=\"_parent\" href=\"mailto:sedmora@unm.edu\">sedmora@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}