{
  "name": "Computed Tomography",
  "degree": "Certificate",
  "program_description": "&nbsp; &nbsp; &nbsp;&nbsp;This 12-month program is an advanced specialty course intended for advanced imaging specialists who desire specific training in CT. The CT Certificate Program at the University of New Mexico is designed to prepare those individuals interested in sitting for the: 1) America Registry of Radiologic Technologists Computed Tomography (CT) specialty exam.<br>",
  "admission_requirements": "&nbsp; &nbsp; &nbsp;&nbsp;Individuals who have completed the Associate of Science degree program in Radiography can also choose to complete the baccalaureate degree with a concentration in radiography. They have a choice of two emphases. 1) Magnetic Resonance Imaging; or 2) Computed Tomography.<p>Students choosing the Bachelor of Science degree path must first declare Radiologic Sciences as their major at the time of University admission. The application deadline for admittance into the Computed Tomography or Magnetic Resonance Imagine program is June 1st of each year. Program information is provided upon request from the Radiologic Sciences Department at the UNM School of Medicine. Application submission is required directly to the Radiologic Sciences Program to include: references and official transcripts from all prior colleges attended. A selection committee may choose 6-8 students for each program. The program’s selection process does not discriminate against any applicant based on sex, age, race, religion, creed, or national origin.</p><p>Individuals who have completed a certified Radiography program and hold certification as a Radiologic Technologist by the American Registry of Radiologic Technologies (ARRT) may apply for admission to complete the certificate in Computed Tomography or Magnetic Resonance Imaging. Applicants must submit copies of all transcripts to The University of New Mexico Office of Admissions.</p>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Pamala Garcia-Ramirez:</b></i>\n<b>Program Coordinator</b><br>\n<a target=\"_parent\" href=\"tel:5052725254\">(505) 272-5254</a><br>\n<a target=\"_parent\" href=\"mailto:PKGarcia@salud.unm.edu\">PKGarcia@salud.unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}