{
  "name": "Comparative Literature & Cultural Studies",
  "degree": "MA",
  "program_description": "<p>The Program in Comparative Literature and Cultural Studies offers an interdisciplinary B.A., a B.A. second major and minor, and both an M.A. and a graduate minor. Students define their own field of study as they complete core courses in cultural and literary studies and critical theory offered by participating departments and programs across the university.</p><h3>Potential Fields of Study and Inquiry</h3><p>Students in the program have defined a wide variety of fields of study, including, images of motherhood in Greek tragedy, the migration of Flamenco to New Mexico, theories of monsters, sites of Memory in Haitian women's writing, postmodernity in Chinese architecture, environmental justice and the silicon chip industry, and the cultural politics of the debate on capital punishment.</p><p>Possible academic trajectories may be: How do language, literature, film and other media operate? What allows us to understand (or misunderstand) meaning? Where do stories come from and what purposes do they serve? How do racial, sexual, national and class identities come to seem \"normal\"? What happens when different cultural traditions collide or collaborate? Are we born or do we become women or men? Where does taste come from? Does the medium in which an idea is expressed matter? Is literature merely a reflection of society or is it an agent of change? The Program in Comparative Literature and Cultural Studies provides students with a framework for responding to these kinds of questions.</p><p>Both the undergraduate and graduate programs offer students an exceptional opportunity to devise their own program of study and to work in close collaboration with faculty advisors. B.A. students may choose from two concentrations, the cultural studies concentration and the comparative literature concentration. M.A. students may choose a concentration in cultural studies, comparative literature or classics.</p><ul><li><a href=\"http://www.unm.edu/~fll/pdfs/grad_clcs_checklist.pdf\">Graduate Checklist for CL/CS</a></li><li><a href=\"http://www.unm.edu/~fll/pdfs/clcs_program_req.pdf\">CL/CS Program Description &amp; Requirements</a></li><li><a href=\"http://www.unm.edu/~fll/pdfs/clcs_phd_links.pdf\">Resource Links to CL/CS Ph.D. Programs at Other Institutions</a></li></ul><h4>Introduction to Graduate Study in Comparative Literature Criticism and Theory</h4><p>This course is required for all CL/CS graduate students and provides an introduction to tools used regularly in the fields of comparative literature and cultural studies for analyzing literary and cultural texts. It introduces influential movements in theory (including structuralism, psychoanalysis, Marxist criticism, deconstruction, cultural studies, postcolonial studies, gender and sexuality theory) by looking at their practitioners and their critical filiations. Our focus will be on learning how to ask the questions that these movements have used productively to analyze culture, as well as on identifying an argument's limits.</p><h3>The M.A. Program</h3><p>The M.A. Program is recognized as a strong bridge program for students wishing to prepare themselves for an outstanding doctoral program in Film Studies, Cultural Studies, Comparative Literature and Classics. Students hone their writing, their analytic ability their theoretical acumen, their awareness of literary and cultural movements, and their foreign or classical language skills through interdisciplinary course work, intensive study for comprehensive exams, and by taking advantage of the option to write a thesis.</p><h4>The Comparative Literature Concentration</h4><p>Comparative Literature inquires about the intersections of cultural traditions as well as the forces that create a sense of their difference. Comparatists generally work in two or more languages and have a knowledge of the literature, film, visual art and other media produced in a particular period by multiple cultures. They are frequently concerned with theoretical questions about how meaning works and how texts are constructed and have an effect on readers or viewers.</p><p>Increasingly, comparatists have focused on how to approach the study of world literature. B.A. and M.A. students choosing the comparative literature concentration divide their course work beyond core requirements evenly between literatures written in two different languages or cultural works associated with two different linguistic traditions.</p><h4>The Cultural Studies Concentration</h4><p>Cultural Studies inquires about the relationships of power and/or meaning that are developed, registered and disseminated by literary and cultural works. Scholars and students working in cultural studies are often as interested in popular texts (magazine articles, blogs, billboards, video performances . . .) as they are in elite culture. Increasingly, cultural studies has become associated with set of analytic moves for approaching questions of race, gender, sex, class, nation and the transnational. B.A. and M.A. students choosing the cultural studies concentration divide their course work beyond core requirements evenly between the study of theories and approaches to culture, on the one hand, and study of a field of their own, which they identify in consultation with their advisor (and committee members).</p><h4><a href=\"http://www.unm.edu/~fll/grad_classics.html\">The Classics Concentration</a></h4><p>(M.A. only -- Classics exists as a separate major on the&nbsp;<a href=\"http://www.unm.edu/~fll/ug_classics.html\">B.A. level</a>): Classics demands a rigorous knowledge of Classical languages and exposure to the history and cultural concerns of the Ancient World. M.A. students in the concentration divide their course work between advanced language study and courses focusing on the history, art, literature, culture and archaeology of the Ancient world.</p>\n\n\t\t\t&nbsp;",
  "admission_requirements": "",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Monica Cyrino:</b></i>\n<b>Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052774771\">(505) 277-4771</a><br>\n<a target=\"_parent\" href=\"mailto:pandora@unm.edu\">pandora@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}