{
  "name": "Computational Science and Engineering",
  "degree": null,
  "program_description": "The Computational Science and Engineering (CSE) certificate program is an interdisciplinary graduate program open to students in the following participating departments: Biology, Chemical and Nuclear Engineering, Chemistry, Civil Engineering, Computer Science, Earth and Planetary Sciences, Electrical and Computer Engineering, Mathematics, Mechanical Engineering, Physics and Astronomy and Psychology. It is also open to students who already have a graduate degree in a mathematical, scientific or engineering discipline. Its purpose is to prepare students to effectively use high-performance computing within their disciplines.<br><p>A Master’s or Ph.D. degree with a certificate in computational \nscience and engineering is a degree in one of the participating \ndepartments. To complete the CSE program with degree students must:</p><ul><li>Complete all degree requirements of their home department.</li><li>Complete the two course sequence CS/MATH 471 (<em>Introduction to Scientific Computing</em>) and CS 442/ECE 432 (<em>Introduction to Parallel Processing</em>).</li><li>Master’s\n Students: In addition to the two course sequence, complete 6 hours from\n the approved list of CSE electives or 3 hours from the approved list of\n CSE electives and a thesis.</li><li>Ph.D. Students: In addition to the \ntwo course sequence, complete 9 hours from the approved list of CSE \nelectives, at least one of which is listed outside the home department.</li><li>At\n least one faculty member from the Associated Faculty list must be on a \nstudent’s Master’s or Ph.D. committee, and any thesis must contain a \nsignificant computational component.</li><li>CSE students from the \nComputer Science Department will be required to complete at least two \nCSE electives in an application area, or, for Master’s students electing\n the thesis option, the one CSE elective must be in an application area \nand the thesis must have a significant applied computing component.</li></ul><p>To complete the post-degree CSE program students must:</p><ul><li>Complete the two course sequence CS/MATH 471 (<em>Introduction to Scientific Computing</em>) and CS 442/ECE 432 (<em>Introduction to Parallel Processing</em>).</li><li>In addition to the two course sequence, complete 9 hours from the approved list of CSE electives.</li><li>Complete\n an advanced computation project (minimum of 3 credit hours), under the \ndirection of one of the associated faculty, and present it at an open \nforum.</li></ul><br>",
  "admission_requirements": "Admission to the CSE program is based on academic record and letters of recommendation. GRE scores may also be considered for students in a degree program. Prerequisites for admittance into the CSE program in addition to a bachelor’s degree are:<ul><li>For the certificate with degree, admission to a participating department. For post-degree CSE students, a graduate degree in a mathematical, scientific or engineering discipline and official enrollment at the University of New Mexico. (Non-degree status is acceptable. However, for the certificate to be posted on the transcript, a student must be admitted to a participating department.)</li><li>One year of general college physics or chemistry.</li><li>One year of differential/integral calculus, a course in multivariable calculus, a course in differential equations and a course in linear algebra.</li><li>A course in computer programming (either FORTRAN, C or C++) or equivalent experience. It is required that a second course on the level of CS 251L be completed or equivalent experience demonstrated as prerequisite to CS 442/ECE 432.</li></ul><p>Students may petition the Program Committee to substitute a course (of an equivalent number of credit hours) for any of the courses of the approved curriculum.</p>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Andrea Mammoli:</b></i>\n<b>Program Faculty Coordinator</b><br>\n<a target=\"_parent\" href=\"tel:5052779215\">(505) 277-9215</a><br>\n<a target=\"_parent\" href=\"mailto:mammoli@unm.edu\">mammoli@unm.edu</a><br><br>\n<i><b>Monika Nitsche:</b></i>\n<b>Program Faculty Coordinator</b><br>\n<a target=\"_parent\" href=\"tel:5052774613\">(505) 277-4613</a><br>\n<a target=\"_parent\" href=\"mailto:nitsche@math.unm.edu\">nitsche@math.unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}