{
  "name": "Computer Science",
  "degree": "PhD",
  "program_description": "<p>Computer\nscientists deal with computational systems large and small, cyber-security,\ndata mining, bioinformatics, visual computing, artificial intelligence and\nmore. </p>\n\n<p>The <b>Computer Science undergraduate program at the University of New Mexico&nbsp;</b>provides\nstudents\n with a well rounded general education and a broad set of skills and\nknowledge in the basic areas of computer programming and computer \nscience.&nbsp;The program allows for computer science electives and requires \na&nbsp;minor\nfield of study; these allow students to customize their education in \nComputer\nScience and its applications in a direction suited to \nstudents'&nbsp;individual goals.\nAlternatively they may elect to direct their studies toward a particular\napplication area such as business, linguistics, mathematics, or the \nsciences.&nbsp;UNM Computer\nScience students can work with faculty on research in areas including \ncyber-security,\ncomputational biology, visual computing and physical interaction.</p>\n\n<p>The program is accredited by the&nbsp;<a href=\"http://www.abet.org/\" target=\"_blank\">Computing Accreditation Commission\nof ABET</a>. <br></p>&nbsp;",
  "admission_requirements": "",
  "transfer_agreements": "",
  "career_opportunities": "&nbsp;\n\t\t\n\t<p>With a degree in Computer Science from UNM, students are&nbsp;ready to:</p>\n\n<ul><li>Protect computational systems from malicious acts<br></li><li>Scale up computational systems to solve large societal\nchallenges<br></li><li>Develop new ways to visualize and interact with data<br></li><li>Work with molecular computing<br></li></ul>",
  "contact_information": "<i><b>   Lynne Jacobsen  :</b></i>\n<b>Coordinator of Program Advisement</b><br>\n<a target=\"_parent\" href=\"tel: 5052773112\"> (505) 277-3112</a><br>\n<a target=\"_parent\" href=\"mailto:csinfo@cs.unm.edu  \">csinfo@cs.unm.edu  </a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}