{
  "name": "Construction Management",
  "degree": "M.C.M.",
  "program_description": "<p>Construction\nmanagement is a combination of engineering technology, construction \ntechniques,\nand management to meet the needs of the rapidly growing construction \nindustry.&nbsp;Construction managers oversee the entire construction process,\n coordinating\ncontractors, setting timetables, and monitoring costs. </p><p>The <b>Construction\nManagement program at the University of New Mexico&nbsp;</b>prepares students to use\nmachines, materials, money and people efficiently to achieve maximum profit and\ncomplete construction projects on time to the satisfaction of the owner. A meld of engineering, construction,\nmanagement, and business gives the student a background and understanding of\nmanagement’s point of view in the construction industry. Students have the\nopportunity to work on real-life projects with mentors, such as planning and\ndesigning the construction of facilities ranging from a wastewater treatment\nlagoon to an 80-foot pedestrian bridge. </p><p>\n\n\n\n</p><p>The\nConstruction Management program is accredited by the <a href=\"http://acce-hq.org/baccalaureateprograms.htm\">American Council for&nbsp;Construction Education</a>.</p>&nbsp;",
  "admission_requirements": "",
  "transfer_agreements": "",
  "career_opportunities": "With a degree in Construction Management from UNM, students are&nbsp;ready to:<p></p><ul><li>Plan, coordinate, budget, and supervise construction projects<br></li><li>Collaborate with architects, engineers, and other construction and other construction and building specialists<br></li><li>Analyze and improve productivity of construction projects<br></li><li>Manage heavy construction equipment</li></ul>",
  "contact_information": "<i><b>Missy Garoza :</b></i>\n<b>Coordinator of Program Advisement</b><br>\n<a target=\"_parent\" href=\"tel: 5052776633\"> (505) 277-6633</a><br>\n<a target=\"_parent\" href=\"mailto:mgaroza@unm.edu \">mgaroza@unm.edu </a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}