{
  "name": "Counselor Education",
  "degree": "PhD",
  "program_description": "Consistent with the goals and vision of the College of Education, the Counselor Education Program is&nbsp;committed to promoting excellence and diversity in teaching, scholarship, and community service. We work to&nbsp;promote an understanding of human development and psychological health that will improve and foster optimal&nbsp;potential for individuals, families, and our communities. The program features an integration of theory,&nbsp;research, and practice and interdisciplinary collaboration that is intended to prepare counselors who are&nbsp;informed, who will be sensitive to the diversity and uniqueness of individuals, families, and communities, and&nbsp;who will value and promote the dignity, potential and well-being of all people.The doctoral program is intended to enable qualifying Master’s level counselors to extend their career&nbsp;opportunities. Ordinarily students enter the Ph.D. program having already earned a Master’s degree in&nbsp;Counseling, having developed their counseling skills, and being license eligible as a professional counselor. The&nbsp;Ph.D. program prepares students to demonstrate proficiency in research, &nbsp;counseling theory and practice,&nbsp;teaching, supervision, consultation, and diversity studies, beyond the competencies required of Master’s level&nbsp;counselors. To this end we are especially invested in our doctoral students being able to articulate an integrative&nbsp;theory of professional counseling, engaging in supervised practice of counseling supervision, teaching, research,consultation, and developing expertise in understanding the variety of social ecological factors that advance&nbsp;wellness within people. The Ph.D. program is not a psychology program and does not prepare students for&nbsp;Licensure as a psychologist.&nbsp;",
  "admission_requirements": "&nbsp;To apply to the Ph.D. &nbsp;Program contact the Counselor Education Program by calling &nbsp;(505) 277-4535, or&nbsp;emailing a request to &nbsp;divbse@unm.edu. You will be sent an application packet that includes the &nbsp;program&nbsp;information sheet, program application, and three Letters of Recommendation. Please carefully follow the&nbsp;instructions contained in the application packet you receive. &nbsp;In order to be considered, letters of&nbsp;recommendation must be signed by you with the waiver option indicated. &nbsp;The personal statement/intent and&nbsp;writing sample must be submitted in hardcopy by you. Also, be aware that you need to apply to the Office of&nbsp;Admissions either submitting a paper application or for faster service apply online at www.unm.edu/~grad. You&nbsp;will also need to turn in an Official transcript from every University or institution of higher learning that you&nbsp;have attended. Transcripts can take up to a month to be sent from your prior universities. Be sure to request&nbsp;them as soon as possible. Applications without transcripts are incomplete and not reviewed. There is a nonrefundable application fee of $50.00. Application deadline for receipt of all materials and fees is November 1st.",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Jean Keim:</b></i>\n<b>Program Coordinator</b><br>\n<a target=\"_parent\" href=\"tel:5052774535\">(505) 277-4535</a><br>\n<a target=\"_parent\" href=\"mailto:jkeim@unm.edu\">jkeim@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}