{
  "name": "Counseling",
  "degree": "MA",
  "program_description": "&nbsp;The Counselor Education Program within the College of Education at the University of New Mexico offers both&nbsp;Master’s and Doctoral degrees that are accredited by the Council for the Accreditation of Counseling and Related&nbsp;Educational Programs (CACREP). The Master’s degree requires a minimum of 60 semester credit hours of course&nbsp;work and is designed for students to develop the requisite competencies for a career as a professional counselor.&nbsp;Tracks in Clinical Mental Health Counseling (formerly Community Counseling) and School Counseling are&nbsp;currently available. The Clinical Mental Health Counseling track is currently accredited under the 2001 Standards&nbsp;for Community Counseling as a Community Counseling program. &nbsp; The 2009 Standards combine two previous&nbsp;areas (Community and Mental Health) into Clinical Mental Health Counseling. &nbsp;As part of the regular reaccreditation process, the Counselor Education Program is in the process of seeking accreditation under the 2009&nbsp;standards for the Clinical Mental Health Counseling Program. The School track is also accredited by CACREP&nbsp;and seeking reaccreditation with no name change. The Master’s degree program currently meets the preparatory&nbsp;standards for eligibility for licensure as a Licensed Mental Health Counselor (LMHC) in New Mexico and State&nbsp;Board of Education certification as a school counselor.",
  "admission_requirements": "&nbsp;Application and Admission ProceduresPlease carefully follow the instructions &nbsp;on the &nbsp;application instruction checklist which you can access on the&nbsp;Counselor Education webpage &nbsp;Counselor Education @ UNM College of EducationApplication to the Counselor Education MA program includes &nbsp;application fee, official transcripts, &nbsp;a completed&nbsp;university application form (found on the UNM Office of Graduate Studies webpage) and a program application,&nbsp;(found on the program website). The Counselor Education application form requires a description of previous&nbsp;college course work, employment history, three references, and a personal statement/letter of intent. The Master’s&nbsp;degree application does not require the GRE. Application deadline is November 1stfor admission in the following&nbsp;Fall semester. Students are admitted for the semester for which they are accepted. Deferring admissions requires&nbsp;entire program faculty approval. Application deadlines are firm. Only those applications that are complete(including all paperwork, fees, transcripts, etc.) will be reviewed. No Exceptions. We recommend you&nbsp;submit both Admissions and Program application materials at least two weeks before the deadline dates to&nbsp;ensure the processing of your application. For questions about the Master’s of Arts in Counseling, pleasecontact the Counselor Education office by calling (505) 277-4535, or emailing divbse@unm.edu.It is your responsibility to ensure that all application materials have been received and are on file in&nbsp;Simpson Hall. You may check on the status of your application by calling or emailing the program&nbsp;office.How your Application is EvaluatedSix criteria are applied in evaluating your application. Applications that address each of these issues receive more&nbsp;consideration.1. Academic Record and PotentialThe Graduate School and the Counselor Education Program seek students who have an undergraduate grade point&nbsp;average (GPA) of 3.0 (B). Students must have a bachelors degree or be in their last semester of their&nbsp;undergraduate program. If your undergraduate grades are not representative of the academic work you are&nbsp;currently capable of, you can indicate that your last two years of undergraduate work are more representative of&nbsp;your academic potential or present grades you achieved as a non-degree graduate student.2. Academic BackgroundWe are seeking students who have 18 credit hours of upper division (300-400 level course) undergraduate and/or&nbsp;graduate course work in the behavioral sciences. Courses that can be used to satisfy this requirement may include,&nbsp;for example, Education, Psychology, Family Studies, Sociology, Anthropology, Nursing, and Social Work,&nbsp;depending on the course content.3. Relevant Work ExperienceWe will assess the quality of your work/volunteer experience and its relevance to your development as a&nbsp;counselor. It is to your advantage to tell us about your work/volunteer training including experiences teaching,&nbsp;working in human service settings, providing counseling services, etc.4. Letters of RecommendationYou &nbsp;MUST &nbsp;submit three letters of recommendation for your application to be considered complete. One&nbsp;recommendation letter must be from a professor and the other two may be either academic or from work&nbsp;supervisors, each of whom can attest to your motivation and potential. Although we provide forms for the referee&nbsp;to complete, many referees prefer to write letters on their own stationary. This is fine but they MUST still&nbsp;complete &nbsp;the numerical ratings on our reference form. Personal or character &nbsp;references from friends, clergy, politicians, or family members are usually not rated as highly as detailed letters from individuals who know about&nbsp;the counseling profession and are in a position to judge your professional and academic potential.5. Personal Statement (3 pages maximum)Please tell us about your goals, your motivation for becoming a counselor, and what you can accomplish by&nbsp;studying at UNM’s Counselor Education Program. Describe personal and professional experiences and&nbsp;characteristics that you believe support your candidacy. We consider your statement a “sample” of what we can&nbsp;expect from you as a student. Preference is given to applicants who present an organized and well written&nbsp;rationale for pursuing graduate studies in Counseling.&nbsp;6. Multi-Cultural CompetenceIn your personal statement describe your understanding or cultural pluralism. Tell us about your experiences or&nbsp;studies of people from cultures, backgrounds, or beliefs different from your own.Interview with the FacultyTypically about half of the applicants (selected from an initial screening based on the aforementioned criteria) are&nbsp;invited to interview with the faculty. This provides us with the opportunity to meet potential students and for you&nbsp;to expand on your qualifications for admission to the Counselor Education Program. These interviews are only&nbsp;done in person.",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Jean Keim:</b></i>\n<b>Program Coordinator</b><br>\n<a target=\"_parent\" href=\"tel:5052774535\">(505) 277-4535</a><br>\n<a target=\"_parent\" href=\"mailto:jkeim@unm.edu\">jkeim@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}