{
  "name": "Creative Writing",
  "degree": "MFA",
  "program_description": "<h3><b>M.F.A. in Creative Writing (54 hours)</b></h3><p>The UNM Master of Fine Arts degree in Creative Writing is designed for students committed to pursuing the writing life. This three-year degree combines studio-based workshops in fiction, poetry and creative nonfiction with craft seminars and coursework in literature, teaching pedagogy, and professional writing. Students also spend each of their final two semesters working individually with a faculty mentor towards the development of a book-length manuscript suitable for publication.&nbsp;&nbsp;The Department's&nbsp;widely published creative writing faculty, Russo Visiting Professorship, Taos Summer Writing Conference, and a national literary magazine, all make for an exciting atmosphere for the study of writing.</p><p>Applicants to the M.F.A. program should already hold a Bachelor’s degree. The program requires 48 credit hours of coursework (excluding dissertation hours); a comprehensive exam; and a creative dissertation. There is no foreign language requirement for the completion of the M.F.A.</p><p>The M.F.A.’s 48 credit hours of coursework are distributed over core requirements that include ENGL 501 Introduction to the Profession for Writers;&nbsp;6 credit&nbsp;hours of&nbsp;ENGL 587 Genre Studies; six writing workshops; two professional preparation courses; at least four courses distributed across different periods of literary history, theory, or rhetoric studies; and an additional&nbsp;3 credit hours of electives. The program also requires 6 credit hours of dissertation that do not count toward the 48 credit hour coursework requirement.</p><p>The M.F.A. program requires a comprehensive examination that serves also as the introduction to, or preface for, the student’s creative dissertation. The M.F.A. degree is conferred when the dissertation is completed, defended, and approved.</p>\n\n\t\t\t&nbsp;",
  "admission_requirements": "&nbsp;\n\t\t\n\t<h3><strong>Application Deadline</strong></h3><p>Fall semester: January 15</p><p>A Bachelor’s Degree is required for all applicants to the Master’s Programs in English and to the M.F.A. in Creative Writing. A Master’s Degree in English or Comparative Literature is required for all applicants to the Ph.D. program.</p><p>All applicants must provide full transcripts, a letter of intent, a writing sample, transcripts from all previously attended postsecondary institutions, GRE scores for the General Aptitude Test (and the Advanced Subject Test in English Literature for applicants to the M.A. in Language and Literature and to the Ph.D. program), and three letters of recommendation.</p><p>Early application is recommended (all paperwork must be received on or before the listed deadline). Decisions on applications received by January 15 are announced by April 15.</p>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Ezra Meier:</b></i>\n<b>Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052774437 \">(505) 277-4437</a><br>\n<a target=\"_parent\" href=\"mailto:nezra@unm.edu\">nezra@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}