{
  "name": "Criminology",
  "degree": "BA",
  "program_description": "<p>\n<b>Major\nin Criminology</b></p><p>\nThe Sociology\nDepartment offers a specialized program in criminology, designed to\ngive students a comprehensive introduction to the field. Courses\nfocus on the characteristics and causes of crime and deviance and on\nthe origins, nature and consequences of societal reactions to crime\nand deviance, giving particular attention to the criminal justice\nsystem. Basic instruction is also given in sociological theory and\nresearch methods.</p><p>\nThe program is\nparticularly appropriate for students wishing to pursue one of the\nfollowing career options:</p><ul>\n\t<li><p>\n\tgraduate work\n\tin the social sciences with a special emphasis on criminology or\n\tcriminal justice</p>\n\t</li><li><p>\n\ta career in\n\tcriminal justice (e.g., law enforcement, corrections, crime\n\tprevention), especially in agencies or departments involved in\n\tplanning and evaluation</p>\n\t</li><li><p>\n\ta career in\n\tlaw, social work or counseling</p>\n</li></ul><p>\n<br>\n</p><p>\nStudents must\ncomplete 34 hours of course work in criminology– 28 hours core and\n6 hours of pertinent electives as advised.</p><p>\nCore courses:\n101; 205; 213; 380; 312; 371; 381L; two of 412, 414, 416, 423, 424,\n425, and 426. Generally, students should follow core courses in\nsequence, beginning with 100-level requirements, proceeding to\n200-level requirements, and so on. Electives: students must choose 6\nhours (two courses) of electives from the approved list available\nfrom the Department of Sociology or any upper-division Sociology\ncourse. Students may not count the same course as both a core course\nand an elective. Some upper-division electives require other courses\nas prerequisites.</p>",
  "admission_requirements": "<p>In order to be\nadmitted to the criminology major, students must complete SOC 101 and\neither SOC 205 or SOC 213.<br></p><p>\n<b>A\ncumulative grade point average of 2.25 or better in all courses\ncompleted is required for regular admission to the criminology major.</b></p>",
  "transfer_agreements": "",
  "career_opportunities": "<p>A bachelor's degree is the minimum formal education required. Most entry-level positions for criminology majors reside\nwith law enforcement, governmental, or social service agencies/organizations. Students must usually be willing to start in\nan entry-level position in order to prepare for advancement. Depending upon the student’s career goals, many employers\nalso require graduate education. For example, a master’s degree in criminal justice, forensic science, social work,\ncounseling, public administration, or business may be required for positions involving therapy or higher levels of\nadministration, forensics, and research. A doctorate is required for university-level teaching positions.&nbsp;</p>",
  "contact_information": "<i><b>Ann Mazur:</b></i>\n<b>Senior Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052773490\">(505) 277-3490</a><br>\n<a target=\"_parent\" href=\"mailto:maz@unm.edu\">maz@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}