{
  "name": "Dance",
  "degree": "MFA",
  "program_description": "The Master of Fine Arts in Dance is a three-year terminal degree that serves a select population of emerging artists pursuing a future in professional performance, choreography, and teaching. The degree requires choreography of at least two works per year and the creation and presentation of a full evening’s work supported by a written dissertation in the final year. Opportunities for graduate students to teach in the dance program are available for qualified students, which includes mentoring by graduate faculty. Graduate assistantships are available that provide scholarship and stipends.",
  "admission_requirements": "<p>All questions should be directed to: (505) 277-4332<br>(your call will be directed to appropriate advisor)</p><p>FAX (505) 277-8921<br>e-mail: theatre@unm.edu or dance@unm.edu&nbsp;</p><table><tbody><tr><td><strong>Admission Deadlines</strong></td><td>&nbsp;</td><td>&nbsp;</td></tr><tr><td><strong>Semester &nbsp;</strong>&nbsp;</td><td><strong>Domestic Applicants</strong></td><td><strong>International Applicants</strong></td></tr><tr><td>Fall:</td><td>February 15</td><td>May 1</td></tr><tr><td>Spring:</td><td>None accepted</td><td>&nbsp;</td></tr><tr><td>Summer:</td><td>None Accepted</td><td>&nbsp;</td></tr></tbody></table><br><p>If you wish to be considered for financial aid the deadline is February 1.</p><p>To receive an early response, applicants are encouraged to submit a complete application as early as possible.</p><p>International applicants require additional materials and are processed through The University of New Mexico’s International Admissions Office. Call (505) 277-5829 or e-mail: goglobal@unm.edu for more information.</p><p>Programs in the Department of Theatre and Dance are accredited by the National Association of Schools of Theatre (NAST) and the National Association of Schools of Dance (NASD).</p><p>To enter the program, the student should have completed an undergraduate major in theatre or dance or have taken a minimum of 24 hours in Theatre and/or Dance, including History, Criticism, Dramatic Literature, Directing, Playwriting, Choreography, Technical Theatre and Performance. However, students with undergraduate degrees in other disciplines are eligible for admittance. Contact the Department for information.</p><p>The student applying for admission should obtain a Self-Managed Application from the Office of Admissions:<br>Call: (505) 277-4332<em><br></em>Online application form:&nbsp;<a href=\"http://www.unm.edu/grad\">http://ogs.unm.edu</a>&nbsp;(click forms)</p><p>Other application materials required by the department:<br>• Three letters of recommendation<br>• Academic/scholarly writing sample<br><br><strong>For the M.F.A. in Dramatic Writing–</strong><br>• A full-length script (stage, screen television play; drama or comedy or two one-act plays)</p><p><strong>For the M.F.A. in Dance–</strong><br>• A resume of educational and professional dance experience<br>• A 12-minute VHS videotape or DVD of recent choreography or dance performance work</p>",
  "transfer_agreements": "",
  "career_opportunities": "<p>Dancers express ideas, stories, rhythm, and sound with their bodies. They use a variety of dance forms that allow free\nmovement and self-expression, including classical ballet, modern dance, and culturally specific dance styles. UNM offers\na Bachelor of Arts in Dance that “presents a broad perspective on dance training within a liberal arts context. Students are\nwell prepared to pursue both graduate work and professional careers in dance education, dance history/criticism and\ndance performance. The Flamenco Focus is the only program in the United States to offer a fully developed curriculum in\nFlamenco Dance technique” (from UNM Dance Dept. website).&nbsp;</p><div><p>Students develop wide-ranging skills that can be applied in a wide range of occupations, including the performing arts.\n“The dance major’s presentation skills, ability to perform in public, and control of the body provides a solid basis for\nworking effectively with others. Dance also develops the ability to concentrate intensely, listen introspectively, observe\nkeenly, sol problems creatively, think critically, collaboratively develop a project, work independently, work under\npressure, meet deadlines, and maintain composure when faced with the unexpected” (from University of Texas – Austin\nFine Arts Career Services website). A bachelor's degree is typically the minimum formal education required. Some areas\nmay require a graduate degree, or may assist employment in highly competitive areas.&nbsp;</p></div>",
  "contact_information": "<i><b>Sarah Lentz:</b></i>\n<b>Department Administrator</b><br>\n<a target=\"_parent\" href=\"tel:5052772737\">(505) 277-2737</a><br>\n<a target=\"_parent\" href=\"mailto:\tslentz@unm.edu\">slentz@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}