{
  "name": "Dental Hygiene",
  "degree": "MS",
  "program_description": "The University of New Mexico offers a Master of Science in Dental \nHygiene in continuation to the Bachelor Degree in Dental Hygiene. The \npurpose of the Master of Science Degree Program in Dental Hygiene is to \nprovide New Mexico with a program aimed at developing dental hygienists \nto teach, develop dental health programs in a variety of settings, \nconduct research and provide care as collaborative dental hygiene \npractitioners. The purpose of this program is consistent with the \nmission of the University of New Mexico which is to educate students by \ndeveloping their intellectual and creative skills and capabilities so \nstudents may be well equipped to participate in the world as productive \nand enlightened individuals.\n<p>The Master of Science Degree Program In Dental Hygiene will enable the graduate-level prepared dental hygienist to:</p>\n<ul><li>build on the knowledge gained in Baccalaureate Degree dental hygiene.</li><li>prepare and specialize in dental hygiene.</li><li>enhance decision-making skills by participating in graduate level dental hygiene courses.</li><li>develop problem-solving skills for independent dental hygiene practice.</li><li>contribute to the dental hygiene scientific body of knowledge.</li><li>conduct research and theory development in the dental hygiene sciences.</li><li>expand the scope of general knowledge by participating in University elective courses.</li><li>provide career opportunities in alternative practice settings.</li><li>build a foundation for future doctoral education in related disciplines.</li><li>develop collegiate relationships with practicing healthcare professionals.</li><li>participate in graduate dental hygiene internship experiences in \neducational settings, rural areas, industry and community outreach \nsites.</li></ul>",
  "admission_requirements": "<p>Formal admission to the office of graduate studies at the University \nof New Mexico is an initial requirement for admission the Master of \nScience Degree Program in Dental Hygiene. Applications for graduate \nadmission are available from the Division of Dental Hygiene, University \nof New Mexico. The Division of Dental Hygiene will recommend acceptance \ninto the program; however, final determination of admittance will be \noffered by the UNM Office of Graduate Studies. The following documents \nmust be submitted to the Division of Dental Hygiene for admittance to \nthe program:</p>\n<ol><li>Application to <a href=\"http://www.unm.edu/%7egrad/\">Office of Graduate Studies.</a></li><li>Photocopy of National Dental Hygiene Board Examination results.</li><li>Proof of a bachelor's degree in dental hygiene or a related field \nand in the latter case, have completed an accredited certificate or \nassociate degree program in dental hygiene. Proof should be provided by \nofficial college transcripts.</li><li>Evidence of an undergraduate overall quality point average of at least 3.0 on a 4.0 scale.</li><li>Three letters of recommendations</li><li>Interview with Admissions Committee</li><li>Completion of a certificate or associate degree program in dental hygiene which has been accredited by CODA</li><li>A copy of current American dental hygiene license</li></ol>\n<strong>Deadline:</strong> Both applications are due <strong>no later than January 31</strong> for priority admission status or <strong>April 15</strong>\n for general admission. Admission is for the fall semester. Those \napplicants who are provisionally selected will be notified in May. All \napplicants will be notified of their admission status. Selection will be\n given to qualified persons regardless of their race, color, religion, \nnational origin, age, qualified disability or military involvement. \nEqual opportunity for admission is given to all qualified applicants.<br>\n\n\n\t\t\t&nbsp;",
  "transfer_agreements": "",
  "career_opportunities": "<p>Dental hygienists remove soft and hard deposits from teeth, teach patients how to practice good oral hygiene, and provide other preventive dental care. Hygienists examine patients’ teeth and gums, recording the presence of diseases or abnormalities. They remove calculus, stains, and plaque from teeth; perform root planing as a periodontal therapy; take and develop dental x rays; and apply cavity-preventive agents such as fluorides and pit and fissure sealants. In some States, hygienists administer anesthetics; place and carve filling materials, temporary fillings, and periodontal dressings; remove sutures; and smooth and polish metal restorations.</p><p>Dental hygienists work in clean, well-lighted offices. Important health safeguards include strict adherence to proper radiological procedures and the use of appropriate protective devices when administering anesthetic gas. Dental hygienists also wear safety glasses, surgical masks, and gloves to protect themselves and patients from infectious diseases. Flexible scheduling is a distinctive feature of this occupation. Fulltime, part-time, evening, and weekend schedules are widely available.&nbsp;</p><p></p><p>Dental&nbsp;hygienists must be licensed by the state in which they practice. To qualify for licensure in nearly all states, a candidate must graduate from an accredited dental hygiene school and pass both a written and clinical examination. The American Dental Association’s Joint Commission on National Dental Examinations administers the written examination, which is accepted by all states and the District of Columbia. A minimum of an Associate degree or certificate in dental hygiene is generally required for practice in a private dental office. A Bachelor’s or Master’s degree usually is required for research, teaching, or clinical practice in public or school health programs. UNM offers dental hygiene degrees at both the Bachelor’s and Master’s levels.&nbsp;</p><p></p>",
  "contact_information": "<i><b>Cynthia Guillen:</b></i>\n<b>Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052728205\">(505) 272-8205</a><br>\n<a target=\"_parent\" href=\"mailto:cguillen@salud.unm.edu\">cguillen@salud.unm.edu</a><br><br>\n<i><b>Rudy Hunter:</b></i>\n<b>Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052724513\">(505) 272-4513</a><br>\n<a target=\"_parent\" href=\"mailto:ladelton@salud.unm.edu\">ladelton@salud.unm.edu</a><br><br>",
  "online": "degree completion",
  "keywords": null,
  "moratorium": null
}