{
  "name": "Early Childhood Multicultural Education",
  "degree": "BS",
  "program_description": "The Early Childhood Multicultural Education Program (ECME) is a baccalaureate-level, competency-based, teacher preparation program at the University of New Mexico. Students who complete the program graduate with a Bachelor of Science Degree in Education with&nbsp;ECME&nbsp;as their major. Graduates of the program develop the required competencies and become eligible to apply for licensure in Early Childhood Education, Birth to Grade 3, from the New Mexico Public Education Department.&nbsp;ECME&nbsp;students spend their freshman through senior years completing progressively more intensive course work relevant to the education of infants, toddlers, preschoolers, and children in kindergarten through third grade.&nbsp;ECME&nbsp;Majors are expected to complete nine credit hours of practicum in accordance with program requirements. These practica allow students to gain direct experience with young children in a diversity of programs designed for infants and toddlers, preschool-age, and in Kindergarten through Third Grade classrooms. Students are placed in program-approved, community-based programs where they gain knowledge and insight from teachers already working in the field. In their final semester,&nbsp;ECME&nbsp;Majors complete 12 credit hours of student teaching consisting of 16 full-time weeks in an approved placement. In addition to considering multiple curricular approaches, the&nbsp;ECMEprogram emphasizes the contextual dimensions of early childhood education, including diversity of culture, language, community, and economic status.&nbsp;",
  "admission_requirements": "",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>David Atencio:</b></i>\n<b>Program Coordinator</b><br>\n<a target=\"_parent\" href=\"tel:5052773757\">(505) 277-3757</a><br>\n<a target=\"_parent\" href=\"mailto:atencio1@unm.edu\">atencio1@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}