{
  "name": "Earth and Planetary Sciences",
  "degree": "PhD",
  "program_description": "&nbsp;\n\t\t\n\t<p>The Department of Earth &amp; Planetary Sciences offers the M.S. and Ph.D. degrees. In addition to the application form and fee and official transcripts for all college study required by the Office of Admissions, the Department requires a Departmental application, three letters of recommendation, a letter of intent, unofficial transcript copies, and general GRE scores for admission consideration. Application instructions and forms for admission, financial aid, and letters of recommendation are available from the Department of Earth &amp; Planetary Sciences via our Web site:&nbsp;<a href=\"http://epswww.unm.edu/\">http://epswww.unm.edu</a>.</p><p>Entering graduate students must demonstrate via their transcripts that they have received rigorous scientific preparation in courses relevant to graduate study in earth, planetary, atmospheric, or environmental science. Because the E&amp;PS Department offers graduate training in many aspects of the earth sciences, there is no single list of courses that must have been completed prior to graduate study. Necessary background courses must instead be mutually agreed upon by the student, thesis advisor, and thesis committee, and must be approved by the Graduate Committee. It is expected that some students will need to take one or more 300-level EPS courses in order to prepare them adequately for their graduate programs; such courses must be taken as early in those students’ programs as possible. No graduate credit can be earned for 300-level classes in E&amp;PS. Entering graduate students are expected to have completed the equivalent of Math 162 and 163, Chemistry 121 and 123L and 122 and 124L, and Physics 160 and 161 (calculus I and II, general chemistry I and II, and calculus-based physics that includes mechanics, electricity, heat, and magnetism). If one or more of these courses has not been taken, it will be formally identified as a deficiency that must be made up within the student’s first year in the graduate program. Additional coursework in math, chemistry, physics, statistics, or biology is encouraged. No graduate credit can be earned for 100- or 200-level math and science classes.</p><p>Students with a B.S. degree are generally admitted into the M.S. program. Under certain circumstances direct admission to the Ph.D. program from a B.S. degree may be possible. General requirements for the M.S. and Ph.D. degrees are stated in the earlier pages of this catalog. Each candidate will meet with their advisor, during the first week or so of the first semester of enrollment. The results of this interview will determine in part the student’s ensuing schedule. M.S. candidates are required to pass an examination involving the preparation and defense of a thesis proposal during the second semester of enrollment. Ph.D. candidates are required to pass a Comprehensive Examination, during the third semester of post-M.S. enrollment, involving the preparation and defense of two dissertation proposals.</p>",
  "admission_requirements": "&nbsp;\n\t\t\n\t<p><strong>Application Deadlines<br></strong></p><table><tbody><tr><td>Fall semester:</td><td>January 15 (with financial aid)</td></tr><tr><td>&nbsp;</td><td>April 1 (without financial aid)</td></tr><tr><td>Spring semester:</td><td>November 1</td></tr></tbody></table><br>",
  "transfer_agreements": "",
  "career_opportunities": "<p></p><p></p><p>Students who study&nbsp;earth and planetary science&nbsp;at the graduate level may pursue&nbsp;careers in academia as researchers or instructors. &nbsp;Others may prefer to find work outside of academia, either directly after graduation or after obtaining a professional degree. &nbsp;Graduates&nbsp;may find themselves conducting research or filling advisory roles&nbsp;for government agencies, businesses, or non profit organizations. &nbsp;Obtaining a doctoral&nbsp;degree may also qualify students who hold positions in public education or civil service for automatic pay increases based on their employer's salary schedule.</p><p></p>",
  "contact_information": "<i><b>Cindy Jaramillo:</b></i>\n<b>Administrative Assistant</b><br>\n<a target=\"_parent\" href=\"tel:5052771635\">(505) 277-1635</a><br>\n<a target=\"_parent\" href=\"mailto:epsdept@unm.edu\">epsdept@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}