{
  "name": "Economics",
  "degree": "PhD",
  "program_description": "<p>A minimum of 48 hours of course work at the graduate level (with no more than 6 hours of approved 300- and 400-level courses) is required.&nbsp; Courses taken under a Credit/No-credit option do not count toward the required 48 hours of course work.&nbsp; Also, a minimum of 18 hours of dissertation credit (ECON 699) is required.&nbsp; A student may not count dissertation hours toward the 18 required hours until after successful completion of the core examination.&nbsp; In addition to the core curriculum requirements, all doctoral students must successfully complete a concentration consisting of at least nine (9) hours of approved economics courses and a secondary concentration consisting of at least six (6) hours of approved economics courses.&nbsp; All doctoral students must pass the core theory examination, a written examination in econometrics, and a research requirement in their concentration.</p><h4><strong>Core Requirements</strong></h4><p>All Ph.D. students are required to complete a theory sequence and three core courses in statistics and econometrics, which gives the student an additional concentration (see below).&nbsp; The basic sequencing of the core curriculum consists of the following courses:</p><table><tbody><tr><td><strong>Semester</strong></td><td><strong>Required Courses</strong></td></tr><tr><td>Fall (Year 1)</td><td>ECON 595 Workshop in Applied&nbsp;Economics&nbsp;(week prior to Fall semester)<br>ECON 501 Microeconomics I<br>ECON 504 Mathematical Tools and Economic Models<br>ECON 506 Macroeconomics I<br>ECON 508 Statistics and Introduction to Econometrics</td></tr><tr><td>Spring (Year 1)</td><td>ECON 513 Microeconomics II<br>ECON 514 Macroeconomics II<br>ECON 509 Econometrics I</td></tr><tr><td>Fall (Year 2)</td><td>ECON 510 Econometrics II</td></tr></tbody></table><p><br>As part of his or her core curriculum all Ph.D students are also required to take at least one 500-level economics course that is not within the micro or macro curriculum, the econometrics curriculum, and is outside his or her concentration or secondary concentration.&nbsp; This course should be taken as a candidate's schedule permits.</p><h4>Concentrations</h4><p><strong>The department offers three Ph.D. concentrations:</strong></p><ul><li>Environmental/Natural Resource Economics</li><li>Public Economics</li><li>International Development and Sustainability</li></ul><p>A student is required to have a concentration in which he/she has successfully completed 9 credit hours of study and a secondary concentration in which he/she has successfully completed 6 credit hours of study. As discussed above, the core requirements in econometrics will give the student an additional secondary concentration in econometrics. The courses available in each concentration are:</p><table><tbody><tr><td><strong>Concentration</strong></td><td><strong>Courses Offered</strong></td></tr><tr><td>Environmental/Natural Resource Economics</td><td>ECON 540 Natural Resource, Environmental and&nbsp;Ecological Modeling I<br>ECON 542 Topics in Environmental,&nbsp;Resource and Ecological Economics<br>ECON 543 Natural Resource, Environmental and Ecological&nbsp;Economics<br>ECON 544 Environmental Economics</td></tr><tr><td>Public Economics</td><td><p>ECON 560 Public Economics<br>ECON 562 Evaluation of Public Programs<br>ECON 564 Seminar in Health Economics<br>ECON 565 Topics in Public Economics<br>ECON 583 Development Economics</p></td></tr><tr><td>International Development and Sustainability</td><td>ECON 581 International Development and Finance<br>ECON 582 Topics in International and&nbsp;Sustainable Development<br>ECON 583 Development Economics<br>ECON 585&nbsp;Sustainable Development</td></tr></tbody></table><p><br>Topics courses may be repeated for credit toward the degree, but only three credits of any given topics course may be counted toward the concentration.</p><p>ECON 560 and ECON 562 are required for a concentration in Public Economics.&nbsp;Requirements for the Ph.D. secondary concentration in Public Economics are one of ECON 560 or ECON 562, with the second course chosen from any of 560, 562, 564, or 565.</p><p>In addition to completing the three required courses in the chosen concentration, the student must take two additional courses at the 500 level to complete a secondary concentration. There are also \"wildcard\" courses with which a student can augment his or her education.</p>&nbsp;",
  "admission_requirements": "&nbsp;\n\t\t\n\t<h3>Applying to the Graduate Program in the Department of Economics at the University of New Mexico</h3><h4><strong>Domestic Applicants</strong></h4><p>The University of New Mexico (UNM) has a two part submission process for domestic applicants with some materials sent directly to the Office of Admissions, and other materials sent directly to the Department of Economics. The Office of Admissions collects the Application, Application Fee, GRE Scores, and, eventually, official transcripts (please see below). Applicants may complete either an electronic application or a paper application. Detailed instructions, as well as the applications themselves, may be found at the&nbsp;<a href=\"http://admissions.unm.edu/\" target=\"_blank\" title=\"Website for the Office of Admissions at UNM\">Office of Admissions website</a>.</p><p>As mentioned above, the Department of Economics requires applicants to provide current (within three years) GRE Scores. Results of the GRE should be sent directly to UNM by ETS; UNM's code is 4845 and the department code is 1801. For testing information, study aids, and other general questions, visit the&nbsp;&nbsp;<a href=\"http://www.ets.org/\" target=\"_blank\" title=\"ETS website \">ETS website</a>.&nbsp;</p><p>The Department of Economics collects the CV (curriculum vitae or resume, including current contact information), Statement of Intent, three Letters of Recommendation, and Official Transcripts from each institution of higher learning that the applicant has attended. The Department of Economics will forward all official transcripts to the Office of Admissions, so the applicant does not need to supply a second set of transcripts to the Office of Admissions. Although not required, UNM has a&nbsp;<a href=\"http://econ.unm.edu/graduate-program/Grad%20program%20prospective%20info/LOR%20Form/New%20Letter%20of%20Recommendation%20Form.pdf\" target=\"_blank\" title=\"Letter of Recommendation Form \">Supplemental Form</a>&nbsp;we would like to accompany your Letters of Recommendation. &nbsp;Additionally, you may find our&nbsp;<a href=\"http://econ.unm.edu/graduate-program/Grad%20program%20prospective%20info/Application%20Checklist.pdf\" target=\"_blank\" title=\"ECON Grad application checklist\">Application Checklist</a>&nbsp;as well as&nbsp;<a href=\"http://econ.unm.edu/graduate-program/Grad%20program%20prospective%20info/Letter%20of%20Intent%20Guidelines.pdf\" target=\"_blank\" title=\"Guidelines from writing your letter of intent\">Guidelines for Writing Your Letter of Intent</a>&nbsp;useful tools when completing and putting together your application materials. And Please see our&nbsp;<a href=\"http://econ.unm.edu/graduate-program/frequently-asked-questions-.html\" target=\"_blank\" title=\"Economics FAQ page\">Frequently Asked Questions page</a>&nbsp;for answers to many common problems and issues.&nbsp;</p><p><strong>These materials should be submitted directly to</strong>:&nbsp;</p>The Department of EconomicsMSC 05-30601 University of New MexicoAlbuquerque, NM &nbsp;87131-0001<br><h4><strong>International Applicants</strong></h4><p>It is highly recommended that international applicants carefully read the International Admissions Guidelines section of the<a href=\"http://admissions.unm.edu/international/international-admissions-guidelines.html\" target=\"_blank\" title=\"International Admissions Guidelines\">Admissions &amp; Recruitment Services website</a>. Beyond all of the above requirements, international applicants must also submit certified English translations of all of their academic records. Additionally, international applicants must submit their results of the TOEFL, or other acceptable English Proficiency Test.&nbsp;</p><h4><strong>Deadlines</strong></h4><p>The Department of Economics admits for the Fall term only. Please do not apply for Spring or Summer because your application will not be reviewed.&nbsp;</p><p><strong>March 1st</strong>:&nbsp;&nbsp;Applicants seeking financial aid &amp;&nbsp;<strong>ALL</strong>&nbsp;International Applicants</p><p><strong>July 1st</strong>:&nbsp;&nbsp;Domestic Applicants not seeking financial aid</p><p>All domestic students are encouraged to fill out the FAFSA form, in order to qualify for any income based scholarships that may be available. The earlier this form is submitted, the greater likelihood of need based aid being awarded. Please visit the&nbsp;<a href=\"http://www.fafsa.ed.gov/\" target=\"_blank\" title=\"FAFSA website\">FAFSA website</a>&nbsp;for more information.&nbsp;</p><p>The Department of Economics looks forward to reviewing your application. If you should have any questions regarding the required materials, the application process, or for additional information on our graduate program, please do not hesitate to contact our Academic Advisor (<a href=\"http://econ.unm.edu/graduate-program/rikk@unm.edu\" target=\"_blank\">econgrad@unm.edu</a>, 505-277-3056), or our Graduate Director, Jennifer Thacher (<a href=\"http://econ.unm.edu/graduate-program/jthacher@unm.edu\" target=\"_blank\">jthacher@unm.edu</a>, 505-277-1965). <br></p>",
  "transfer_agreements": "",
  "career_opportunities": "<p>&nbsp;Economics is the social science that studies the production, distribution, and consumption of wealth, goods and services. Economics explains how people interact within markets to get what they want or accomplish certain goals. Since economics is a driving force of human interaction, studying it often reveals why people and governments behave in particular ways. In short, economics includes the study of labor, land, and investments, of money, income, and production, and of taxes and government expenditures. Economists&nbsp;seek&nbsp;to measure well-­‐being, to learn how well-­‐being may increase overtime, and to evaluate the well-­‐being of the rich and the poor. Although the behavior of individuals is important, economics also addresses the collective behavior of businesses and industries, governments and countries, and the globe as a whole. Microeconomics starts by thinking about how individuals make decisions. Macroeconomics considers aggregate outcomes. The two points of view are essential in understanding most economic phenomena. Some of the areas of specialization within economics include labor markets, industrial organization, urban systems, mathematical economics, international trade and finance, history of economic thought, monetary systems, public finance, econometrics, and comparative economic systems. &nbsp;A bachelor's degree is the minimum formal education required. However, many employers also require graduate school. For example, they may require a master's degree, and some require a Ph.D., M.D., or J.D. (law degree).&nbsp;</p>",
  "contact_information": "<i><b>Jeffrey Newcomer Miller:</b></i>\n<b>Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052773056\">(505) 277-3056</a><br>\n<a target=\"_parent\" href=\"mailto:jnewcomermiller@unm.edu\">jnewcomermiller@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}