{
  "name": "Educational Diagnosis",
  "degree": "Grad Certificate",
  "program_description": "&nbsp;\n\t\t\n\tEducational Diagnosticians are uniquely qualified to provide skilled educational assessment services to children with disabilities. Using their combined classroom teaching experience and diagnostic skills, Educational Diagnosticians conduct valid, individualized assessments to determine eligibility, develop effective instruction&nbsp;and programming, and monitor student progress. Throughout the United States, there is a demand for qualified assessment specialists as school districts implement large-scale assessment requirements and individualized student evaluations required by federal law. In New Mexico, there is a significant need for Educational Diagnosticians in both urban as well as rural school districts.<br><br><p>Assuming sufficient resources, we plan to offer two (2) required core EDPP courses every semester. &nbsp;Students interested (but who have not yet completed their prerequisites to enable them to apply for acceptance in the Program) may take up to five designated courses prior to being formally accepted into the EDPP. Since many students are planning to be working/teaching while enrolled in the EDPP, all core courses will not begin prior to 4:15pm.</p><h3>Program Options</h3><p><strong>Option One (1):</strong>&nbsp;The entire program can be completed in 4 consecutive (fall, spring, summer, and fall) semesters. This option will begin Fall Semester, 2013. Students who have completed their prerequisites or have already been accepted into the program will be able to be seated in this first Option One Cohort 2013-4014. All students taking this option must be accepted into the EDPP. Exceptions will be made for those students who complete their prerequisites by the start of the third (summer) semester and have been accepted into the program.</p><p><strong>Option Two (2):</strong>&nbsp;In the interest of providing students flexibility, students who need/wish to take the core courses at a slower pace will be able to take one class per semester. Students can take any and all of the core courses that are permitted without acceptance into the program.</p><br>",
  "admission_requirements": "&nbsp;\n\t\t\n\t<h3>General Prerequisites:</h3><ul><li>Statistics&nbsp;</li><li>2 reading methods classes</li><li>Human/child development</li><li>Psychology and education of exceptional person</li></ul><h3>Special Education Prerequisites completed (must be taken at graduate level):</h3><ul><li>SPCD 510 Special Education Law</li><li>SPCD 517 or SPCD 527 Assessment for Students with Disabilities</li><li>SPCD 519 ABA/Behavior Management or SPCD 518 Classroom Organization and Positive Behavioral Supports</li></ul>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Liz Keefe:</b></i>\n<b>Program Coordinator</b><br>\n<a target=\"_parent\" href=\"tel:5052771587\">(505) 277-1587</a><br>\n<a target=\"_parent\" href=\"mailto:lkeefe@unm.edu\">lkeefe@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}