{
  "name": "Electrical Engineering",
  "degree": "BS",
  "program_description": "<p>Electrical engineers\nwork with the systems that power our world and design the devices that process our\nvast stores of data. They use mathematics, physics and other sciences in\nconjunction with computers, electronic instrumentation and other tools to\ncreate a range of systems including integrated circuits, telecommunication\nnetworks, wireless communication systems, diagnostic medical equipment, “green”\nenergy and&nbsp;more.</p><p>\n\n</p><p>Since the\ntechnology in computer engineering changes very rapidly, the <b>Electrical Engineering\nundergraduate program at the University of New Mexico</b>&nbsp;stresses fundamental concepts as\nwell as current application methods. Students have the opportunity to work on robots,\nnanotechnology, optoelectronics, pulsed power, fusion science and more. Electrical\nengineering students at UNM might work with architecture students to design a\nsolar-powered home, collaborate with fellow students on a swarm of networked\nrobots, or contribute to research as an undergraduate working with\ninternationally renowned faculty on sources of high power such as microwaves<a name=\"_GoBack\"></a>, quantum dots, and reconfigurable antennas.</p><p>The program is accredited by the\nEngineering Accreditation Commission of ABET,&nbsp;<a href=\"http://www.abet.org/\" target=\"_Blank\">http://www.abet.org/</a>.</p>\n\t\t\n\t<style>\n.disc_list {list-style-type:disc}\n</style>",
  "admission_requirements": "<p><b>There are three minimum requirements for admission to undergraduate study in the Electrical Engineering or Computer Engineering program:</b> </p>\n\n<style>\n.disc_list {list-style-type:disc}\n</style>\n\n<ol>\n\t<li>Completion of at least 26 semester hours applicable to the degree, with a minimum GPA of 2.20 out of a possible 4.3 and a minimum grade of C for every course. If more than 26 hours applicable to the degree have been completed, the minimum GPA of 2.20 also applies to those hours.</li>\n\n\t<li>Completion of at least 18 semester hours of freshman-year technical subjects, with a minimum GPA of at least 2.50 and a minimum grade of C for every course. Courses must include Math 162, Math 163, ECE 101, ECE 131, Physics 160, 161/161L, and:\n\t\t<ul class=\"disc_list\">\n\t\t\t<li>for the Electrical Engineering Program: Chemistry 121 and Chemistry 123L\n\t\tand additional courses selected from the following:</li>\n\t\t\t<li>for the Electrical Engineering Program: math, chemistry, physics</li>\n\t\t</ul>\n\t</li>\n\n\t<li>Completion of English 101 or its equivalent with a minimum grade of C.</li>\n\n</ol>",
  "transfer_agreements": "<p>For transfer students, admission to an ECE program depends upon evaluation of the student's transcripts by the ECE Admissions Committee through the department's chair and the associate chair for Undergraduate Programs.</p> <a href=\"http://unm-wild-weasel.herokuapp.com/transfers/cnm/Electrical_Engineering_Agreement.pdf\" target=\"_blank\">CNM Transfer Agreement</a>",
  "career_opportunities": "<p>With a\ndegree in Electrical Engineering from UNM, students are&nbsp;ready to:</p><ul>\n <li>Design next generation global\n     positioning systems</li>\n <li>Enhance radar communications</li>\n <li>Develop new broadcast and\n     communication systems</li>\n <li>Work with a global\n     interdisciplinary team to tackle many of the vast challenges facing\n     society today</li>\n</ul>",
  "contact_information": "<p><i><b>Christina Garcia:</b></i></p>\n<b>Academic Advisor</b><br \\=\"\">\nECE Bldg. Rm. 115<br \\=\"\">\n<a href=\"tel:5052771435\">(505)277-1435</a><br \\=\"\">\n<a href=\"mailto:cgarcia@ece.unm.edu\">cgarcia@ece.unm.edu</a><br><br \\=\"\">",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}