{
  "name": "Elementary Education (Bilingual Endorsement)",
  "degree": "BSED",
  "program_description": "<p>The curriculum leading to the Bachelor’s Degree (B.A.Ed. or B.S.Ed.) in Secondary Education is designed for students preparing to teach in middle schools, junior high schools or senior high schools (grades 7-12). The program of studies for the Secondary Education major and licensure preparation has three components:</p><ul><li>General Education Requirements</li><li>Concentration-Teaching Field Requirements</li><li>Professional Education Requirements</li></ul><p>Students must meet with a College of Education Academic Advisor for initial consultation about their program, and their secondary faculty advisor through out their program. The Secondary Education faculty advisor must approve enrollment into the professional licensure courses that are offered in a Fall/Spring sequence.</p>",
  "admission_requirements": "<strong>Bilingual Education (27 credit&nbsp;hours):</strong>&nbsp;Students may elect to pursue a New Mexico K-12 endorsement in Bilingual Education with a Spanish/English or Navajo/English area of focus. However, in order to meet federal and state requirements for the 7-12 school curriculum, secondary students interested in a bilingual education endorsement must have a first concentration-teaching field in one of the academic content areas such as Communicative Arts, Social Studies, Mathematics, Life Science, or Earth Science, or French, German, or Spanish listed above in the Secondary Concentration-Teaching Fields section. They may then complete requirements for the bilingual education endorsement as an additional teaching credential. Students must see a Bilingual Education Program advisor in the Department of Language, Literacy and Sociocultural Studies (LLSS) for current information about Bilingual Education Endorsement requirements and approval of entry into Bilingual Education concentration courses.",
  "transfer_agreements": "",
  "career_opportunities": "<p>&nbsp;Teachers act as facilitators or coaches, using interactive discussions and “hands-on” approaches to help students learn and apply concepts in subjects such as science, mathematics, or English. &nbsp;50&nbsp;states&nbsp;and the District of Columbia require public school teachers to be licensed. In most states a prerequisite for licensure is a bachelor’s degree. Usually licensure is granted by the State Board of Education or a licensure advisory committee. Requirements for regular licenses to teach kindergarten through grade 12 vary by state.&nbsp;</p>",
  "contact_information": "<i><b>Department of Teacher Education<br>Phone: (505) 277-4533<br>ted@unm.edu<br></b></i>",
  "online": "partial",
  "keywords": "teaching teacher preperation education",
  "moratorium": null
}