{
  "name": "Elementary Education",
  "degree": "MA",
  "program_description": "<p>The Elementary Education Program offers graduate degrees that contain components for licensure as an elementary educator in the State of New Mexico as well as for practicing teachers for continued professional development.</p><p>M.A. in Elementary Education (for Licensed Teachers)</p><p>32+ Credit Hours</p><p>M.A. in Elementary Education with Alternative Route to K-8 Licensure<br>36 Credit Hours</p><p>Prospective M.A. students must apply for admission and be formally admitted by the program faculty.&nbsp; Candidates are required to develop and follow a planned program of studies made up of courses selected with the approval of a faculty advisor.&nbsp; Courses taken without an advisor's prior approval may not be accepted toward completion of the M.A. degree.</p>",
  "admission_requirements": "<p>M.A. in Elementary Education (for Licensed Teachers)</p><ol><li>Meet UNM Office of Graduate Studies (OGS) requirements;</li><li>Have an overall GPA of 3.0 in the last 2 undergraduate years in the major field of study; and</li><li>Hold a valid teaching license.</li></ol><p>M.A. in Elementary Education with Alternative Route to K-8 Licensure</p><ol><li>Pass the New Mexico Teacher Assessment: Basic Skills Examination;</li><li>Meet UNM Office of Graduate Studies (OGS) requirements; and</li><li>Have an overall GPA of 3.0 in the last 60 hours of university coursework.</li></ol><p>A complete online application packet must be submitted to the Department of Teacher Education.&nbsp; Admission is based on space availability.</p>",
  "transfer_agreements": "",
  "career_opportunities": "<p>&nbsp;Teachers act as facilitators or coaches, using interactive discussions and “hands-on” approaches to help students learn and apply concepts in subjects such as science, mathematics, or English. &nbsp;50&nbsp;states&nbsp;and the District of Columbia require public school teachers to be licensed. In most states a prerequisite for licensure is a bachelor’s degree. Usually licensure is granted by the State Board of Education or a licensure advisory committee. Requirements for regular licenses to teach kindergarten through grade 12 vary by state.&nbsp;</p>",
  "contact_information": "<i><b>Department of Teacher Education<br>(505) 277-9439<br>ted@unm.edu<br></b></i><br>",
  "online": "partial",
  "keywords": "principal school leadership educational licensure administrator",
  "moratorium": null
}