{
  "name": "Elementary Education (Teaching English as a Second Language Endorsement)",
  "degree": "BSED",
  "program_description": "<p>The curriculum leading to the Bachelor’s Degree (B.A.Ed. or B.S.Ed.) in Secondary Education is designed for students preparing to teach in middle schools, junior high schools or senior high schools (grades 7-12). The program of studies for the Secondary Education major and licensure preparation has three components:</p><ul><li>General Education Requirements</li><li>Concentration-Teaching Field Requirements</li><li>Professional Education Requirements</li></ul><p>Students must meet with a College of Education Academic Advisor for initial consultation about their program, and their secondary faculty advisor through out their program. The Secondary Education faculty advisor must approve enrollment into the professional licensure courses that are offered in a Fall/Spring sequence.</p>",
  "admission_requirements": "<strong>Teaching English to Speakers of Other Languages (36 credit hours):</strong>&nbsp;Students may elect to pursue a K-12 endorsement in Teaching English to Speakers of Other Languages (TESOL). However, in order to meet federal and state requirements for the 7-12 school curriculum, secondary students must have a first&nbsp;teaching field in one of the academic content areas such as Communicative Arts, Social Studies, Mathematics, Life Science, Earth Science, or French, German, or Spanish listed above in the Secondary&nbsp;Teaching Fields section. They may then complete requirements for the TESOL endorsement as an additional teaching credential. See a TESOL Program advisor in the Department of LLSS for current information about the TESOL Endorsement requirements and approval of entry in TESOL endorsement courses.",
  "transfer_agreements": "",
  "career_opportunities": "<p>&nbsp;Teachers act as facilitators or coaches, using interactive discussions and “hands-on” approaches to help students learn and apply concepts in subjects such as science, mathematics, or English. &nbsp;50&nbsp;states&nbsp;and the District of Columbia require public school teachers to be licensed. In most states a prerequisite for licensure is a bachelor’s degree. Usually licensure is granted by the State Board of Education or a licensure advisory committee. Requirements for regular licenses to teach kindergarten through grade 12 vary by state.&nbsp;</p>",
  "contact_information": "<i><b>Teacher Education Offices</b></i><br>\n<a target=\"_parent\" href=\"tel:5052774608\">(505) 277-4533</a><br>\n<a target=\"_parent\" href=\"mailto:tkeyes@unm.edu\">ted@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": "teaching teacher preperation education",
  "moratorium": null
}