{
  "name": "Emergency Medical Services",
  "degree": "BS",
  "program_description": "The UNM EMS Academy is home to New Mexico’s only Bachelor of Science \nprogram in EMS, and is one of only 13 programs offering a Bachelor’s \ndegree in EMS in the U.S.\n\n<p>Offered through the University of New Mexico School of Medicine, our \nprogram is one of a very few programs administered through an academic \nDepartment of Emergency Medicine. This provides our students exceptional\n opportunities to be mentored by Emergency Medicine faculty and \nresidents, and to participate in the day-to-day activities of a busy \nacademic medical center.</p>\n\n<p>Our curriculum was designed to teach and train paramedic leaders to \nbe better prepared to handle the realities of a new era in prehospital \nmedicine. By the time they leave EMSA, our graduates are excellent \nclinicians, teachers, researchers and leaders. They have the breadth of \nknowledge to think independently, and to push the development of EMS. \nThe program prepares students for advanced study; many of our graduates \ngo on to obtain advanced degrees in education and science, medicine, \nphysician assistant studies and business.</p>\n\n<p>Following the tradition of the UNM School of Medicine, our curriculum\n places emphasis on both the science and the humanity of prehospital \nmedicine, throughout all four years of study. Our curriculum begins with\n general education, including courses in the humanities, the social \nsciences, and the basic sciences. These courses, including work in \nhistory, philosophy, language, and anthropology provide a critical \ngeneral education. Students are then required to undertake advanced \ncoursework in the sciences, which provides a critical framework for \nsubsequent studies in clinical paramedicine. During the first two years \nof the program, students become EMT-Basics, and learn the fundamentals \nof prehospital medicine.</p>\n\n<p>The focal point of the BS in EMS program is the core paramedic \ntraining courses, which are usually undertaken in the third year of the \nprogram. Course content is based on the current Paramedic National \nStandard Curriculum, and the program is fully accredited by the \nCommittee on Accreditation of EMS Programs. These courses are taught by \nnationally recognized faculty, all who have extensive backgrounds in the\n delivery of prehospital care. The courses include classroom and \nlaboratory work, as well as clinical experiences in area hospitals and \nEMS agencies.</p>\n\n<p>During the final year of the program, students undertake advanced \ncoursework in clinical EMS, and in research and education. Students may \ntake advanced coursework offered by the UNM Anderson School of \nManagement, the College of Education, and the College of Arts and \nSciences.</p>",
  "admission_requirements": "The BS program may be started either as an incoming first-year \nstudent at UNM, or as a student transferring with advanced standing from\n a recognized two- or four-year college or university.\n<p>There are separate application processes for admission to the \nUniversity of New Mexico, and to the EMS Academy. An EMS admissions \ncommittee evaluates all prospective students.</p> \nProspective students should contact our academic advisor well in \nadvance of their intended matriculation.  The BS degree program begins \nin the fall semester of each year. The priority deadline for \napplications to UNM is mid-June. For more information, contact our \nacademic advisor Shelly McLaughlin,\n\t\t\n\t<a href=\"mailto:SJMcLaughlin@salud.unm.edu\">SJMcLaughlin@salud.unm.edu </a> or the UNM Admissions Office at: <a href=\"http://admissions.unm.edu/general-information/index.html\">http://admissions.unm.edu/general-information/index.html</a>.",
  "transfer_agreements": "",
  "career_opportunities": "<p>Emergency medical technicians (EMTs) and paramedics administer first-aid treatment and life-support care to sick or\ninjured persons in pre-hospital setting. Depending on training level, EMTs administer drugs, orally or by injection, and\nperform intravenous procedures under a physician's direction. In addition to operating equipment such as\nelectrocardiograms (EKGs), external defibrillators and bag-valve mask resuscitators in advanced life-support\nenvironments. EMTs assess the nature and extent of illness or injury to establish and prioritize medical procedures.\nEMTs coordinate with other emergency medical team members and police and fire department personnel and are\nresponsible for communicating with dispatchers and treatment center personnel to provide information about situation,\nto arrange reception of victims, and to receive instructions for further treatment. Working in pairs, EMTs perform\nemergency diagnostic and treatment procedures, such as stomach suction, airway management or heart monitoring,\nduring ambulance transport. Because emergency services function 24 hours a day, EMTs and paramedics have\nirregular working hours.&nbsp;</p><div><p>A high school diploma, usually, is required to enter a formal EMT training program. All 50 States require certification\nfor each of the EMT levels. In most States, and the District of Columbia, registration with National Registry for\nEmergency Medical Technicians (NREMT) is required at some or all levels of certification. Some States administer\ntheir own certification examination or provide the option of taking either the NREMT or State examination. To maintain\ncertification, EMTs and paramedics must recertify, usually every two years. UNM offers a BS in Emergency Medicine\nwith three areas of concentration: Clinical Care, EMS Administration, and EMS Education and Training, in addition to\ntraining programs for the three EMT levels.&nbsp;</p></div>",
  "contact_information": "<i><b>Robert McDaniels:</b></i>\n<b>EMS Academy Director</b><br>\n<a target=\"_parent\" href=\"tel:5052724695\">(505) 272-4695</a><br>\n<a target=\"_parent\" href=\"mailto:RMcDaniels@salud.unm.edu\">RMcDaniels@salud.unm.edu</a><br><br>\n<i><b>Shelly McLaughlin:</b></i>\n<b>EMS Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052724706\">(505) 272-4706</a><br>\n<a target=\"_parent\" href=\"mailto:SJMcLaughlin@salud.unm.edu\">SJMcLaughlin@salud.unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}