{
  "name": "Engineering, Nuclear Engineering Concentration",
  "degree": "PhD",
  "program_description": "<p>Nuclear engineers are on the forefront of rapidly developing\nareas that include better, safer ways to power our planet. They’re working on\nreactor system designs, nuclear non-proliferation, radiation interaction with\nmaterials, and reducing and controlling radioactive waste.</p>\n\n<p>The <b>Nuclear Engineering undergraduate program at the\nUniversity of New Mexico</b> gives the student broad training in the\nfundamentals of mathematics, physics, chemistry and engineering, followed by\nprofessional specialty course work involving radiation interaction with matter,\nradiation transport, radiation detection and protection, nuclear reactor theory\nand safety, thermalhydraulics and nuclear systems design. Students also select\ntechnical electives that allow them to explore in-depth areas of interest in\nnuclear engineering.</p><p>Among the exciting research areas, UNM nuclear\nengineering professors are studying what happens to the cooling system of a nuclear\nreactor under severe accident conditions. </p><p>Collaborations with national\nlaboratories focus on a variety of areas, including nuclear criticality safety,\nradiation transport, reactor theory, space nuclear power, and probabilistic\nrisk assessment.</p>\n\n<p>The program is accredited by the\nEngineering Accreditation Commission of ABET,&nbsp;<a href=\"http://www.abet.org/\" target=\"_Blank\">http://www.abet.org/</a>.</p>&nbsp;",
  "admission_requirements": "<ul><li>Domestic and International applications should apply to the University online (<a href=\"https://app.applyyourself.com/AYApplicantLogin/fl_ApplicantLogin.asp?id=unmgrad\" target=\"_blank\">https://app.applyyourself.com/AYApplicantLogin/fl_ApplicantLogin.asp?id=unmgrad</a>).<br><br></li><li>The online application process will guide you through which materials are required by the University to finalize your application.<br><br></li><li>The department also requires GRE General Test scores, a Letter of Intent, and three letters of recommendation.<br><br></li><li>The Letter of Intent should briefly describe your experience and objectives in undertaking graduate study in Nuclear Engineering and can be submitted through the online system.<br><br></li><li>GRE scores and TOEFL scores (for international applicants) are required and should be submitted to the University directly by ETS (Institution code = 4845; do department code is&nbsp;<br>needed). During the online process, please report your scores unofficially for review.<br><br></li><li>Recommendation letters should be submitted directly by your recommenders through the online system. Specific directions are included within the application system.</li></ul><p><strong>Deadlines</strong><br><br></p><table><tbody><tr><td><strong>Semester</strong></td><td><strong>Priority Deadline</strong></td><td><strong>Final Deadline</strong></td></tr><tr><td>Fall</td><td>January 15</td><td>July 15 (Domestic)<br>March 1 (International)<br><br></td></tr><tr><td>Spring</td><td>July 15</td><td>November 10 (Domestic)<br>August 1 (International)<br><br></td></tr><tr><td>Summer</td><td>April 29 (Domestic)<br>January 1 (International)</td><td>April 29 (Domestic)<br>January 1 (International)<br><br></td></tr></tbody></table><p>Apply by the priority deadline for best consideration for reserach assistantships or other departmental financial aid.</p>",
  "transfer_agreements": "",
  "career_opportunities": "With a degree in Nuclear Engineering from UNM, students are&nbsp;ready to:<p></p><ul><li>Research new energy systems<br></li><li>Control radioactive waste and industrial radiation releases<br></li><li>Use radioisotopes for the treatment and diagnosis of diseases<br></li><li>Develop long-term, reliable nuclear energy sources for space and terrestrial applications&nbsp;</li></ul><p></p>",
  "contact_information": "<i><b>Jocelyn White:</b></i>\n<b>Program Advisement Coordinator</b><br>\n<a target=\"_parent\" href=\"tel:5052775606\">(505) 277-5606</a><br>\n<a target=\"_parent\" href=\"mailto:jowhite@unm.edu\">jowhite@unm.edu</a><br><br>\n<i><b>Cassiano de Oliveira:</b></i>\n<b>Professor and Graduate Advisor </b><br>\n<a target=\"_parent\" href=\"tel:5052775431\">(505) 277-5431</a><br>\n<a target=\"_parent\" href=\"mailto:cassiano@unm.edu\">cassiano@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}