{
  "name": "Engineering, Mechanical Engineering Concentration",
  "degree": "PhD",
  "program_description": "&nbsp;Our faculty members and graduate students form a group of scholars with an interest in innovation, creativity, and advanced study. Our programs provide excellent prospects for investigation and for close association among people whose common goal is to broaden the boundaries of their profession.",
  "admission_requirements": "&nbsp; &nbsp; &nbsp;&nbsp;Concentration in Mechanical Engineering<p>The Doctor of Philosophy (Ph.D) degree requires 54&nbsp;credit hours beyond the bachelor’s degree, exclusive of the dissertation credit. Details of all special requirements are subject to departmental policy.</p><p><strong>Course Requirements:</strong><br>In addition to the general University doctoral degree requirements listed in the Graduate Programs section of the UNM Catalog, students pursuing a Ph.D. in Engineering with a concentration in Mechanical Engineering must meet the following criteria:</p><ol><li>Four courses&nbsp;comprise the Mechanical Engineering Graduate Core (see above).</li><li>Each Ph.D. student must have one hour of seminar credit on his/her program. The student shall register for ME 591/592 for three semesters while attending the seminars. In the first two semesters, registration in ME 591/592 may be for zero credit hours. In the third semester the student must register for one credit hour.</li></ol><p><strong>Qualifying Examination</strong><br>Ph.D. students must pass the Mechanical Engineering Qualifying Examination before they form a Committee-on-Studies and file the Advancement to Candidacy form. Students must take the Qualifying Examination no later than the second semester in the Mechanical Engineering Graduate program as a Ph.D. student.</p><p><strong>Comprehensive Examination</strong><br>Before a student may complete this requirement, he/she must have passed the Qualifying examination. The Comprehensive examination must be administered and passed in the same semester the Candidacy form is approved by the Graduate Director and the Dean of Graduate Studies.</p><p><strong>Defense of Dissertation</strong><br>All candidates must pass a Final examination (Defense of Dissertation). The Dissertation Committee conducts the defense of the dissertation.</p>",
  "transfer_agreements": "",
  "career_opportunities": "<p>&nbsp;Perform engineering duties in planning and designing tools, engines, machines, and other mechanically functioning equipment. Oversee installation, operation, maintenance, and repair of such equipment as centralized heat, gas, water, and steam systems. &nbsp;A bachelor's degree is the minimum formal education required. However, many employers also require graduate school and some require a Ph.D., M.D.,&nbsp;or&nbsp;J.D. (law degree).&nbsp;</p>",
  "contact_information": "<i><b>Anna Mae Apodaca:</b></i>\n<b>Coordinator, Program Advisement</b><br>\n<a target=\"_parent\" href=\"tel:5052772762\">(505) 277-2762</a><br>\n<a target=\"_parent\" href=\"mailto:aapodaca@unm.edu\">aapodaca@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}