{
  "name": "Engineering, Electrical Engineering Concentration",
  "degree": "PhD",
  "program_description": "<p>Electrical engineers\nwork with the systems that power our world and design the devices that process our\nvast stores of data. They use mathematics, physics and other sciences in\nconjunction with computers, electronic instrumentation and other tools to\ncreate a range of systems including integrated circuits, telecommunication\nnetworks, wireless communication systems, diagnostic medical equipment, “green”\nenergy and&nbsp;more.</p><p>\n\n</p><p>Since the\ntechnology in computer engineering changes very rapidly, the <b>Electrical Engineering\nundergraduate program at the University of New Mexico</b>&nbsp;stresses fundamental concepts as\nwell as current application methods. Students have the opportunity to work on robots,\nnanotechnology, optoelectronics, pulsed power, fusion science and more. Electrical\nengineering students at UNM might work with architecture students to design a\nsolar-powered home, collaborate with fellow students on a swarm of networked\nrobots, or contribute to research as an undergraduate working with\ninternationally renowned faculty on sources of high power such as microwaves<a name=\"_GoBack\"></a>, quantum dots, and reconfigurable antennas.</p><p>The program is accredited by the\nEngineering Accreditation Commission of ABET,&nbsp;<a href=\"http://www.abet.org/\" target=\"_Blank\">http://www.abet.org/</a>.</p>\n\n\t\t\t&nbsp;",
  "admission_requirements": "",
  "transfer_agreements": "",
  "career_opportunities": "&nbsp;\n\t\t\n\t<p>With a\ndegree in Electrical Engineering from UNM, students are&nbsp;ready to:</p><ul><li>Design next generation global\n     positioning systems</li><li>Enhance radar communications</li><li>Develop new broadcast and\n     communication systems</li><li>Work with a global\n     interdisciplinary team to tackle many of the vast challenges facing\n     society today</li></ul>",
  "contact_information": "<i><b>Elmyra Grelle:</b></i>\n<b>Interim Coordinator</b><br>\n<a target=\"_parent\" href=\"tel:5052772600 \">(505) 277-2600 </a><br>\n<a target=\"_parent\" href=\"mailto:egrelle@ece.unm.edu\">egrelle@ece.unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}