{
  "name": "English",
  "degree": "PhD",
  "program_description": "&nbsp;\n\t\t\n\t<h3>Ph.D. (54 hours)</h3><p>The Ph.D. program is designed for students who wish to pursue intensive study in English. The Ph.D. program offers three areas of study: British and American literatures, including criticism and theory; Rhetoric and Writing; and an interdisciplinary Concentration in Medieval Studies. The Ph.D. in English requires 54 hours of coursework; a foreign language requirement; successful completion of comprehensive exams in 3 fields; and a Ph.D. dissertation.</p><p>General requirements for the Ph.D. are set forth in earlier pages of this catalog. Consult the English Department’s Graduate Studies handbook and&nbsp;Web site&nbsp;for details about specific distribution requirements, foreign language regulations, examination procedures, and other policies specific to the English Department. The following are general departmental requirements for the Ph.D. in English.</p><p>The Ph.D. in English requires 54 total hours of course work. This number can include work transferred from previous graduate study. At the discretion of the Associate Chair of Graduate Studies, no more than 24 hours of Master’s course work can count towards the Ph.D. degree requirements, leaving 30 hours to complete from the time of matriculation.</p><p>Ph.D. course work consists of core requirements and electives. Core requirements include: ENGL 500, (which must be taken in the first semester of English graduate course work); a language and theory requirement; a pedagogy requirement; and at least 12 hours of 600-level seminars, excluding any seminars taken in previous graduate study. The remaining required credit hours are fulfilled by electives distributed across courses listed at 500-level or above (excluding ENGL 699, Dissertation). All Ph.D. students must enroll for a minimum of 18 hours of ENGL 699 after Advancement to Candidacy.</p><p>All Ph.D. students must successfully complete the department’s foreign language requirement; take and pass comprehensive examinations in 3 areas; complete and successfully defend the dissertation prospectus; and complete and successfully defend a dissertation, as explained in the general requirements for the Ph.D. set forth earlier in this catalog.</p><h4>Ph.D. Concentration in Medieval Studies</h4><p>The Ph.D. Concentration in Medieval Studies offers advanced students an alternative means of acquiring bodies of knowledge presently isolated in separate disciplines. The course of study differs from the typical Ph.D. in Medieval English Literature in that it involves diverse departments and presents exciting and provocative points of intersection between literatures and cultures of the Middle Ages and later periods. See the department’s Web site and Graduate Studies Handbook for specific policy and procedures.</p>",
  "admission_requirements": "&nbsp;\n\t\t\n\t<h3><strong>Application Deadline</strong></h3><p>Fall semester: January 15</p><p>A Bachelor’s Degree is required for all applicants to the Master’s Programs in English and to the M.F.A. in Creative Writing. A Master’s Degree in English or Comparative Literature is required for all applicants to the Ph.D. program.</p><p>All applicants must provide full transcripts, a letter of intent, a writing sample, transcripts from all previously attended postsecondary institutions, GRE scores for the General Aptitude Test (and the Advanced Subject Test in English Literature for applicants to the M.A. in Language and Literature and to the Ph.D. program), and three letters of recommendation.</p><p>Early application is recommended (all paperwork must be received on or before the listed deadline). Decisions on applications received by January 15 are announced by April 15.</p>",
  "transfer_agreements": "",
  "career_opportunities": "<p>&nbsp;&nbsp;“Besides teaching and literary&nbsp;research, a major in English can lead to professional careers in archival and curatorial librarianship, publishing, journalism, advertising and the arts; as well as human resources, sales and marketing, management, and government work. Even when additional qualifications are needed, as in law, an undergraduate major in English is often a distinct advantage” (from UNM Course Catalog). UNM’s English department offers five different areas of concentration: liberal arts, pre-graduate, professional&nbsp;writing, pre-law, and creative writing. It also offers a major in English-Philosophy. &nbsp;A bachelor's degree is the minimum formal education required. Some areas may require a graduate degree, or may assist employment in highly competitive areas. English is a broad degree that can lead to job opportunities in many diverse fields.&nbsp;.&nbsp;</p>",
  "contact_information": "<i><b>Ezra Meier:</b></i>\n<b>Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052774437 \">(505) 277-4437</a><br>\n<a target=\"_parent\" href=\"mailto:nezra@unm.edu\">nezra@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}