{
  "name": "Entrepreneurial Studies",
  "degree": "BBA",
  "program_description": "<p>Entrepreneurs have crucial functions in the economy: they create employment for themselves and others, they enhance productive abilities, and they bring innovate ideas and products to the marketplace. Entrepreneurship is a creative, collaborative, exciting, and rewarding path that seeks to maximize the value in every opportunity. And entrepreneurs are often more satisfied than employees with their jobs.</p><p>The Entrepreneurial Studies Track offers students hands-on experience and theoretical grounding in new venture creation, entrepreneurial finance, business planning, professional selling, and managing small businesses. These studies build upon and lead students beyond the core management competencies.</p><p>Students work directly with community partners on real-life projects. Through activities of the Small Business Institute (SBI), (link to SBI page) Entrepreneurial Studies students apply research and classroom-based learning to critical challenges facing small businesses in our community, creating an atmosphere of success through a combination of excellent academics and community engagement.</p>\n\n\t\t\t&nbsp;",
  "admission_requirements": "&nbsp;\n\t\t\n\t<p>Minimum requirements for transfer or admission to the Bachelor of Business Administration Program are:</p><ol><li>Completion of or current enrollment in the pre-admission course work.</li><li>A minimum grade of “C” and an overall cumulative grade point average requirement of 2.5 on all required pre-admission course work. (Students should be aware that, due to space limitations, satisfying the minimum grade point average does not guarantee admission.)</li><li>&nbsp;An overall combined grade point average of 2.5 on all University of New Mexico and transfer course work.</li><li>Submission of a formal application for admission to the Anderson School Advisement Center during the semester when the pre-admission course work is to be completed. The application is online at&nbsp;<a href=\"https://online.mgt.unm.edu/\">https://online.mgt.unm.edu</a>.</li><li><p>Application procedures must be completed by:<br>March 1 for Summer admission<br>May 1 for Fall admission<br>October 1 for Spring admission</p></li><li>Students have two options regarding the CS 150 preadmission course work requirement: 1) take the class, or 2) pass the CS 149 waiver test. Applications will be placed on hold and will not be processed until the student satisfies this requirement. Information about the waiver exam is available at&nbsp;<a href=\"http://cs.unm.edu/~joel/cs149/cs149.html\">http://cs.unm.edu/~joel/cs149/cs149.html</a></li></ol><p><em><strong>NOTE</strong>: Students not submitting their application by the deadline date or not completing their admission requirements will be required to reapply for the following semester.</em></p><br><p><strong>Required Pre-Admission Course Work</strong><br>(A) Writing and Speaking: ENGL 101, 102 and 219, Technical and Professional Writing or ENGL 220, Expository Writing.<br>(B) Mathematics: MATH 121 (or 150) and 180 (or 162)<br>(C) Physical and Natural Sciences: 7 credit hours, including one course with corresponding laboratory (designated L), from the Anderson core curriculum list.<br>(D) Social Science and Behavioral Science: ECON 105, 106, 3 credit hours from either General Psychology (PSY 105) or Introduction to Sociology (SOC 101) and 6 additional credit hours selected from American Studies, Anthropology, Economics, Geography, History, Political Science, Psychology or Sociology.<br>(E) Humanities: 3 credit hours chosen from Anderson’s core curriculum course list. Note that the University of New Mexico core curriculum requires 6 credit hours of Humanities. Anderson requires students to complete the additional 3 credit hours as part of their upper-division requirements.<br>(F) Fine Arts: 3 credit hours chosen to fulfill Anderson’s core curriculum requirement.<br>(G) Second Language: 3 credit hours.<br>(H) Management 202 (Principles of Financial Accounting).<br>(I) One of the following statistics courses: STAT 145 or 245 or 345, or MGMT 290<br>(J) Students must complete CS 150L or must pass the CS 150 waiver exam, CS 149, administered by the Department of Computer Science. CS 150 and equivalent courses must have been completed within 5 years of the semester in which the student is seeking admission to the B.B.A. Program. If more than 5 years have elapsed, the student must complete the CS 149 waiver exam or repeat the course (no credit for repeating the course).</p><p>Pre-admission total: 52 credits or 55 credits with CS150L.</p><p><strong>NOTE</strong>: Students who are missing pre-admission course work will not be considered for admission until all pre-admission course work has been completed. Applications for admission will not be reviewed until all pre-admission course work grades have been posted.</p>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Florencio Olguin:</b></i>\n<b>Senior Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:50527738885\">(505) 277-3888</a><br>\n<a target=\"_parent\" href=\"mailto:folguin@unm.edu\">folguin@unm.edu</a><br><br>\n<i><b>Tracy Wilkey:</b></i>\n<b>Senior Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:50527738885\">(505) 277-3888</a><br>\n<a target=\"_parent\" href=\"mailto:twilkey@unm.edu\">twilkey@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}