{
  "name": "Environmental Planning & Design",
  "degree": "BAEPD",
  "program_description": "<p>The Bachelor of Arts in Environmental Planning &amp; Design (B.A.E.P.D.) at the University of New Mexico is an undergraduate course of study related to the graduate degree in Community &amp; Regional Planning (CRP). Environmental planning encompasses systematic and creative methods used to influence and respond to dynamic changes occurring in neighborhoods, cities, and entire regions throughout the world. Planners assist communities in formulating policies and plans to meet their social, economic, environmental, cultural, and physical needs.</p><p>In the American Southwest, human strategies for adapting to arid conditions have been evolving for thousands of years. They represent many different cultural perspectives, complex social histories, and rich practical learning that are vital for current and future survival. The Bachelor of Arts in Environmental Planning &amp; Design offers students the opportunity to engage in socially and environmentally relevant skill building and to address the issues of an evolving social and cultural landscape.</p><p>Opportunities for Environmental Planners exist in a variety of governmental, non-profit, and private for-profit settings. Graduates have been hired in tribal, local, state, regional, and national planning and design offices. At the national level, graduates work for the National Park Service, the U.S. Forest Service, the National Resources Conservation Service, the Peace Corps, Los Alamos National Laboratories, the U.S. Department of Transportation, environmental advocacy organizations, and university facility planning departments. Our B.A.E.P.D. graduates may use this degree to advance to a graduate program or to work for state agencies, community-based organizations, community development foundations, or private planning firms concentrating in environmental analysis, geographic information systems, and community health planning.</p><p>Students in the B.A.E.P.D. Program take a total of 128 credits. The course of study consists of 37 credits from the University of New Mexico core courses as a prerequisite to the program, 36 credits of B.A.E.P.D. core courses, 39 credits of Community &amp; Regional Planning Concentration courses, and 16 credits of electives.</p>&nbsp;",
  "admission_requirements": "&nbsp;Application packets are due in the School undergraduate advisor’s office by April 15 (for Fall admission) or November 15 (for Spring admission) of each year. To apply, a student must have completed a minimum of 26 hours of the UNM Core and/or B.A.E.P.D. Core, including ENGL 102 (with a C or better). The packet consists of an application form, which can be obtained from the School’s undergraduate advisor, Rm. 120 in George Pearl Hall, a two-page statement of intent indicating how this degree will benefit you, and an unofficial transcript. Students must have at least a 2.0 GPA. Students are strongly encouraged to either be taking or have taken either CRP 165, Introduction to Community &amp; Regional Planning, or CRP 181, Introduction to Environmental Problems, at the time of their application.",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Lois Kennedy:</b></i> <b>Senior Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052774847\">(505) 277-4847</a><br>\n<a target=\"_parent\" href=\"mailto:loisk@unm.edu\">loisk@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": "Environment Environmental Plan Planner Planning Design Designer Architecture Architect Architectural Land Landscape Community Garden Sustain Sustainable Social Society Justice Culture Cultural Create Creative Expression Energy Art Construction",
  "moratorium": null
}