{
  "name": "Exercise Science",
  "degree": "BS",
  "program_description": "The mission of UNM's Exercise Science program is to provide our students with the didactic, experiential, and ethical foundation in the study of human physiology and movement necessary to succeed in their choice of career, professional field of study, and advanced academic work. This mission is achieved through engaging lecture and hands-on laboratory instruction, scholarship, and service-learning designed to promote and develop critical thinking, laboratory skills, effective communication skills, and a passion for lifelong learning. The undergraduate and masters programs prepare students for continued education in Physical Therapy, Occupational Therapy, nursing, medicine, or clinical research, as well as to function professionally as exercise physiologists/scientists in health/fitness clubs, corporate health promotion programs, academic, and clinical settings. The PhD program prepares exercise science researchers, professors, and preventative and/or rehabilitative program directors.<br><br>Through active participation in and application of scientific research, the Exercise Science students and renowned faculty, in partnership with our community, collaborate to identify and develop solutions for individual, local, and global challenges related to health, fitness, and optimal human performance. New Mexico's multicultural population presents our program with innumerable opportunities to favorably impact the state's citizens through scientifically accurate and culturally sensitive information pertaining to the benefits of a healthy, physically active lifestyle as recommended by our learned societies and national health initiatives.&nbsp;",
  "admission_requirements": "<table><tbody><tr><td colspan=\"2\"><table><tbody><tr><td>Students must meet with their Exercise Science advisor (Dr. Kravitz) EVERY semester for advisement. Your curriculum file will be updated then and you will present your proposed class schedule for the upcoming semester. Once YOUR schedule is approved for the upcoming semester, Dr. Kravitz will RELEASE your registration hold--this advisement process must be done in person, not over the phone or internet.</td></tr><tr><td></td></tr><tr><td>Registration days for students are posted on your LOBOWEB page and at the Registrars WEB Site. Students are highly encouraged to register as soon as they can each semester as classes fill up very fast at UNM, especially Exercise Science classes.</td></tr><tr><td></td></tr><tr><td>Once a student is accepted into the College of Education, his/her Exercise Science advisor (Dr. Kravitz) will be the faculty responsible for removing the academic hold during registration.</td></tr><tr><td></td></tr><tr><td>Students must have at least a 3.0 GPA to apply to the Exercise Science program. Apply as soon as you have completed 26 hours of university course work (with at least a 3.0 GPA or higher), and have successfully (&gt; 'C') completed Biology 237/247L. Because of the popularity of the Exercise Science program there is a often a CAP on admissions each semester. To determine the number of hours and grades you need to improve your GPA&nbsp;<a href=\"http://www.unm.edu/~lkravitz/Pages/gpaimprovecalc.html\">CLICK HERE</a></td></tr></tbody></table></td></tr></tbody></table>",
  "transfer_agreements": "",
  "career_opportunities": "<p>Fitness workers lead, instruct, and motivate individuals or groups in exercise activities, including cardiovascular exercise,\nstrength training, and stretching. They work in commercial and nonprofit health clubs, country clubs, hospitals,\nuniversities, Yoga and Pilates studios, resorts, and clients’ homes. Increasingly, fitness workers also are found in\nworkplaces, where they organize and direct health and fitness programs for employees of all ages.&nbsp;</p><div><p>Personal trainers must obtain certification in the fitness field to gain employment, while group fitness instructors do not\nnecessarily need certification to begin working. In the fitness field, there are many organizations that offer certification.\nBecoming certified by one of the top certification organizations is increasingly important, especially for personal trainers.\nOne way to ensure that a certifying organization is reputable is to see whether it is accredited or seeking accreditation by\nthe National Commission for Certifying Agencies. Most certifying organizations require candidates to have a high school\ndiploma, be certified in cardiopulmonary resuscitation (CPR), and pass an exam. Certification generally is good for 2\nyears, at which time workers must become recertified by attending continuing education classes or conferences. Pilates\nand yoga instructors must obtain specialized training.&nbsp;</p></div>",
  "contact_information": "<i><b>Lenny Kravitz:</b></i>\n<b>Faculty Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052774136\">(505) 277-4136</a><br>\n<a target=\"_parent\" href=\"mailto:lkravitz@unm.edu\">lkravitz@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}