{
  "name": "Family Studies",
  "degree": "MA",
  "program_description": "The Master’s in Family Studies may be pursued in one of the three following concentrations: Family Life Education, Family Relations, and Human Development in Families. Students completing the Master’s Degree in Family Life Education will be eligible to apply for the Certified Family Life Educator (CFLE) certificate from the National Council on Family Relations. (Instructions and more information may be obtained in Simpson Hall.) The Master’s in Family Studies offers flexibility in developing a program of studies to meet the interests of the student. Applicants are expected to have completed 18 hours of social and/or behavioral science courses (e.g., anthropology, family studies, psychology, sociology) prior to admission. Acceptance into the Master’s program is based upon ratings of several factors, including scholarship, academic background (especially in the social/behavioral sciences), work experience, letters of recommendation, a personal statement and multicultural experience. Prospective students must first apply for admission to the Office of Graduate Studies. The requirements for the Master’s degree in Family Studies consist of 42 semester hours.&nbsp;",
  "admission_requirements": "&nbsp;Students from academic backgrounds other than Family Studies are encouraged to apply. Students are&nbsp;expected to have a GPA of 3.0 in the last 60 hours of undergraduate study. Other admission criteria are&nbsp;relevant coursework, well articulated personal statement, related work experience, multicultural&nbsp;experience/education, and academic references. All full-time faculty independently review and rate each&nbsp;applicant based on the materials submitted. Following discussion of these ratings and resultant score by&nbsp;the faculty, a vote is taken and both the Family Studies Graduate Coordinator and the Office of Graduate&nbsp;Studies communicate the resulting decision to the applicant. &nbsp;&nbsp;",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Ziarat Hossain:</b></i>\n<b>Program Coordinator</b><br>\n<a target=\"_parent\" href=\"tel:5052774162\">(505) 277-4162</a><br>\n<a target=\"_parent\" href=\"mailto:zhossain@unm.edu\">zhossain@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}