{
  "name": "Financial Management",
  "degree": "MBA",
  "program_description": "&nbsp;\n\t\t\n\tThe Finance concentration requires a minimum of 15 hours of courses above the required core courses. To satisfy requirements for this concentration, students must take five (5) finance courses. MGMT 571 and MGMT 577 are required courses. The remaining 3 courses can be selected from the Elective Courses list.",
  "admission_requirements": "&nbsp;\n\t\t\n\tThe minimum requirements for unconditional admission to the M.B.A. and M.Acct. are (1) a G.P.A. of 3.0 for the last 60 hours of college course work including any post baccalaureate work; and (2) a score equal to or greater than 500 on the Graduate Management Admission Test (GMAT) or (2) a Graduate Record Examination (GRE) score that is deemed to be greater than or equivalent to 500 on the GMAT using a conversion tool available from the Anderson School advisement office.",
  "transfer_agreements": "",
  "career_opportunities": "<p>&nbsp;Managers need finance to find funding sources for their firms, to identify and manage risk, and to decide whether to make capital expenditures or produce new products. Individuals use the principles of finance to set long term financial goals and to make personal investment decisions. Areas of study in the field of finance include financial management, banking, planning, investments, insurance, money flow, real estate and financial services.&nbsp;</p>",
  "contact_information": "<i><b>Megan Hearting:</b></i>\n<b>Director, Student Services</b><br>\n<a target=\"_parent\" href=\"tel:5052773290\">(505) 277-3290</a><br>\n<a target=\"_parent\" href=\"mailto:mconner@unm.edu\">mconner@unm.edu</a><br><br>\n<i><b>Nicole Capehart:</b></i>\n<b>Student Success Manager</b><br>\n<a target=\"_parent\" href=\"tel:5052773290\">(505) 277-3290</a><br>\n<a target=\"_parent\" href=\"mailto:ncapehar@unm.edu\">ncapehar@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": "Finance Financial Money Math Mathematics Economics Economy Investment Bank Banking Money Market Stock Corporate Corporation Business Mutual Fund Account Budget Strategy",
  "moratorium": null
}