{
  "name": "French Studies",
  "degree": "PhD",
  "program_description": "<p>The Department of Foreign Languages &amp; Literatures offers a Ph.D. in French Studies. Students are admitted on the basis of their past records and future promise for scholarship. The admissions committee also takes into consideration the expressed field of research with an eye to suitable faculty guidance and direction. Potential applicants are encouraged to contact the Department for more individual advisement. <br></p><br>",
  "admission_requirements": "&nbsp;<p>Applicants to the Ph.D. program are expected to have completed a Master’s Degree in French or its equivalent. The University of New Mexico students who wish to pursue doctoral studies must submit a written plan. All applicants are expected to have taken at least one course in critical theory.</p><p>In addition to the general requirements for all Ph.D.s, the department specifies the following:</p><ol><li>Each student must complete a minimum total of 54 semester hours of course work for the Ph.D. including transfer credit but exclusive of dissertation hours. Normally, a minimum of 24 hours of this total will be taken after the M.A. is completed.</li><li>A student may declare a minor in another discipline after approval from the committee on studies. Students with a declared minor must complete 48 hours of course work in French Studies and 12 hours in the minor.</li><li>Each student must demonstrate a reading knowledge of two other languages besides French and English.</li><li>Each student must assemble a committee on studies composed of three University of New Mexico faculty members before the end of the second semester of the Ph.D. program. The committee will meet regularly with the student to develop a program suited to his or her own needs and interests. The committee holds authority over each student’s program and may require specific courses dictated by a student’s scholarly interest and goals. The committee on studies will guide the candidate in forming an appropriate committee to administer comprehensive examinations as well as to plan and carry out the dissertation.</li><li>All Ph.D. candidates in French Studies are advised to gain teaching experience as well as experience in a French-speaking environment as part of their professional training.</li></ol><br>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Pamela Cheek:</b></i>\n<b>Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052773810\">(505) 277-3810</a><br>\n<a target=\"_parent\" href=\"mailto:pcheek@unm.edu\">pcheek@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}