{
  "name": "Geography",
  "degree": "BS",
  "program_description": "<p>Geography offers an integrative perspective on the relations among social, political, economic, and physical phenomena in space and place. Geography describes and explains the past, present, and future locations and spatial patterns of humans and their settlements, cultural and economic traits, and natural environment and resources. Geographical research addresses important issues relating to the environment and how culture and nature are connected. The department’s programs focus on environmental studies, that is, human/environment interactions, natural resource policy and management, and legal geography and social justice; and Geographic Information Science (GIScience), that is, Geographic Information Systems, cartography and geovisualization, remote sensing, Global Positioning System (GPS), and spatial statistics.</p><p>Geography and Environmental Studies offers a Bachelor of Arts and Bachelor of Science degree, and a Master of Science degree. The B.A. and B.S. degrees prepare majors for one of two career paths, or for entrance into the M.S. Program. The B.A. degree acknowledges general competency in Geography for those seeking careers in either applied geography or environmental studies.</p><p>The GIScience minor is ideally suited for majors from many College of Arts and&nbsp;Sciences departments, as well as from other Schools at UNM. These technologies are finding many practical applications in the social and physical sciences, engineering, health care, architecture and planning, and legal professions.</p><br>&nbsp;",
  "admission_requirements": "",
  "transfer_agreements": "",
  "career_opportunities": "<p>&nbsp;“The public is increasingly aware of geography’s relevance in an age of globalization, international instability, and accelerating environmental change. Additionally, geographic information science (GIScience) has exploded, making fundamental changes in the analytic capability of the discipline. The demand of trained geographers exceeds the supply. The Department of Geography offers a Bachelor of Arts and a Bachelor of Science degree, as well as a Master of Science degree. The BA and BS degrees prepare graduates for career paths in the broad fields of environmental science, or for entrance into the MS program. New faculty, new courses, a revitalized curriculum in our areas of emphasis make this an exciting time to be in Geography at UNM (from UNM Department of Geography brochure).” &nbsp;&nbsp;A bachelor's degree is the minimum formal education required. Master's degree qualifies you for community college teaching and advancement in industry and government. Ph.D. is required for research and teaching positions in colleges and universities and senior positions in government and industry. Some positions might require a JD. &nbsp;</p>",
  "contact_information": "<i><b>Melinda Harm Benson:</b></i>\n<b>Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052775041\">(505) 277-5041</a><br>\n<a target=\"_parent\" href=\"mailto:mhbenson@unm.edu\">mhbenson@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}