{
  "name": "German",
  "degree": "BA",
  "program_description": "<h4>Major Studies Requirements</h4><p>30 hours of course work, to include the following: GRMN 301, 302 and 307 and two of the following: 305, 308, 370, 401 and 405. GRMN 410, or 470 taken at the German Summer School may substitute for either 301 or 302, but not both. The remaining hours may be selected from German courses above 300. Six of these hours may consist of approved German Studies courses in other programs. No more than 18 hours may be earned in courses offered at the German Summer School.</p><h4>Second Language Option</h4><p>Two years, or the equivalent, of college level work in another foreign language. 27 hours of course work, to include the following: GRMN 301, 302, 307, and two of the following: 305, 308, 370, 401 and 405. GRMN 410 or 470 taken at the German Summer School may substitute for either 301 or 302, but not both. The remaining hours may be selected from German courses above 300. Three of these hours may consist of approved German Studies courses in other programs. No more than 15 hours may be earned in courses offered at the German Summer School.</p><h4>Second Major Option</h4><p>Students who present two majors (German and another field) are required to complete 24 hours of course work in German, to include the following: 301, 302, 307, and two of the following: 305, 308, 370, 401 and 405. GRMN 410, or 470 taken at the German Summer School may substitute for either 301 or 302, but not both. The remaining hours may be selected from German courses above 300. Three of these hours may consist of approved German Studies courses in other programs.</p><p>No more than 12 hours may be earned in courses offered at the German Summer School.</p><h4>Minor Study Requirements</h4><p>Fifteen hours of course work above 300, including 301, 302.</p><h4>Lower-Division German</h4><p>All beginning students should enroll in Basic German (101 or 175), which provides a foundation in reading, writing, listening and speaking for all subsequent courses. All students who have never taken a German course at UNM must take a placement exam to determine the adequate course level. Heritage speakers are strongly advised not to enroll in lower-division language courses.</p>\n\n\t\t\t&nbsp;",
  "admission_requirements": "",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Jason Wilby :</b></i>\n<b>Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052774771\">(505) 277-4771</a><br>\n<a target=\"_parent\" href=\"mailto:jwilby@unm.edu\">jwilby@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}