{
  "name": "Health, Medicine, and Human Values",
  "degree": "BA",
  "program_description": "<p>The Health, Medicine and Human Values (HMHV) program, the undergraduate component of UNM’s Combined B.A./M.D. Degree Program, presents a unique opportunity for a select group of qualified freshmen who wish to become physicians in New Mexico. The program is open to 28 students each Fall (application and eligibility criteria are described below). Following an integrated curriculum that covers a broad base of interdisciplinary course work in the humanities, social sciences, mathematics, and physical sciences, program participants&nbsp;complete a Bachelor’s degree at the end of four years, after which they&nbsp;complete their Doctor of Medicine (M.D.) degree in the School of Medicine at UNM where a seat has&nbsp;been reserved for them.</p><p>The HMHV program offers students flexibility in choosing an undergraduate major while providing them with a structured pre-medical core of special seminars focusing upon humanities, fine arts, and social/behavioral sciences studies in the context of health science and medicine; with experiential learning practica; and with a suite of mathematics and physical/natural science courses that will prepare them for medical school.</p><p>In consultation with a B.A./M.D. advisor, program participants choose one of the following options: Option I: an Arts and Sciences major;&nbsp;Option II:&nbsp;the Health, Medicine and Human Values major: Health, Humanities and Society concentration, or&nbsp;Option III:&nbsp;the Health, Medicine and Human Values major: Biomedical Sciences concentration. Option I is designed for students who wish to receive a B.A. (or B.S.) degree in a liberal arts field, such as Anthropology, Biology, English, History, Psychology, or Sociology. Option II is designed for students who prefer a distributed liberal arts and sciences program of study. And Option III is designed for those students who wish to pursue a rigorous program of study in the physical and natural sciences. All three options include a suite of courses in the humanities, social sciences, mathematics, and physical and natural sciences that prepare the student for medical school.</p>&nbsp;",
  "admission_requirements": "&nbsp; &nbsp; &nbsp;Application eligibility for the Combined BA/MD Degree Program requires that a student:<ul><li>Be a&nbsp;New Mexico&nbsp;resident&nbsp;at time of application.</li><li>Be a current&nbsp;New Mexico&nbsp;high school senior&nbsp;(high school seniors outside New Mexico who are enrolled members of the Navajo Tribe and live on the Navajo Nation are also eligible).</li><li>Have minimum ACT or SAT scores as follows:</li><p></p><table><tbody><tr><td>&nbsp;</td><td>ACT</td></tr><tr><td>Math</td><td>22</td></tr><tr><td>English</td><td>19</td></tr><tr><td>Science</td><td>19</td></tr><tr><td>Reading</td><td>18</td></tr><tr><td></td><td></td></tr><tr><td>&nbsp;</td><td>SAT</td></tr><tr><td>Critical Reading</td><td>≥ 450</td></tr><tr><td>Math</td><td>≥ 510</td></tr></tbody></table><p></p><li>Scores must be achieved prior to the November 15th application deadline.&nbsp;&nbsp;<em>(SAT II subject test scores are not accepted.)</em></li><li>Have a personal commitment to pursue a medical career in New Mexico's rural or medically underserved areas.</li></ul><p>The UNM Combined BA/MD Degree Program considers all aspects of an applicant’s background, experience and academic progress including:</p><ul><li>Academic excellence (ex. GPA, ACT/SAT scores, honors courses, advanced placement courses, and international baccalaureate courses)</li><li>Community involvement</li><li>Volunteer experience</li><li>Commitment to practice medicine in&nbsp;New Mexico</li><li>Honors and awards</li><li>Extracurricular activities</li><li>3 Letters of recommendation</li><li>Personal statement</li></ul><p></p>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Greg Martin:</b></i>\n<b>Associate Director</b><br>\n<a target=\"_parent\" href=\"tel:5052772623\">(505) 277-2623</a><br>\n<a target=\"_parent\" href=\"mailto:gmartin@unm.edu\">gmartin@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}