{
  "name": "Health Education",
  "degree": "MS",
  "program_description": "<p>The\nMaster of Science in Health Education is available under both Plan I\n(with thesis) and Plan II (without thesis), in accordance with\nregulations in the preceding part of the College section of this\ncatalog and other sections pertaining to graduate study. The specific\nconcentrations include:</p>\n<ul>\n\t<li><p>\n\t<b>Community Health Education</b>.\n\tThis concentration is designed to prepare professional community\n\thealth educators. Emphasis is on preparing individuals for careers\n\tin health education and in the application of behavioral science and\n\tpublic health principles to health problems and health promotion;\n\tfor administrative and consultant positions in agencies and\n\tinstitutions at local, state, and national levels; and for positions\n\tin program planning and evaluation. The program of study for the\n\tcommunity health concentration includes a core of courses. The\n\tsupport courses are selected to meet the career goals and needs of\n\teach individual student.</p></li></ul>\n<ul>\n\t<li><p>\n\t<b>Health Education Endorsement\n\tfor In-service licensed teachers.</b>\n\tIn-service licensed\n\tteachers seeking an HED endorsement are advised to enroll in the\n\tCommunity Health Education Master’s program, which will allow them\n\tto obtain a health endorsement from NMPED after completing 24 hours\n\tof HED coursework.  Those who do not hold a secondary education\n\tteaching license (elementary licensed only) may take any methods\n\tcourse that has in the title, “Secondary Teaching Methods” to\n\tqualify for a Specialty Area Secondary Teaching License with NMPED.\n\tThis license will allow them to teach in a high school setting.</p></li></ul>",
  "admission_requirements": "Application Deadlines<div><br>Fall Admission: April 1 (priority); Aug. 1 (final)<div>Spring Admission: Nov. 1 (priority); Dec. 15 (final)</div><div>Summer Admission: Apr. 1 (priority); May 1 (final)</div><div><br>NOTE: Final deadline dates refer to the date apositive decision is made and the decision is sentelectronically to UNM Admissions. Therefore,the application packet must be complete and&nbsp;ready for review by the department 1-2 weeks&nbsp;prior to the deadline date.</div></div><div><br></div><div><h3>General Eligibility Criteria</h3><p>Must hold a bachelor's degree from an accredited college or university in the United States or its equivalent in another country</p><ul><li>In general applicants must present a cumulative grade point average of at least 3.0 (B) or its equivalent in their last two undergraduate years and in their major field. GPA criteria may vary by program.</li><li>Must indicate all academic institutions they have previously attended on their applications. Failure to disclose any previous college attendance or any other misrepresentation of the record may result in disciplinary action, including revocation of admission to the University.</li><li>Ordinarily, the minimum undergraduate prerequisite is 12 semester hours of upper division course work (300-level courses or higher) in the major field to which the student is applying, or in cognate areas.</li></ul><h3>Application and Admissions Process</h3><p>Contact or meet with a faculty member from the program in which you are applying, preferably a faculty member who represents your area of interest. Obtain an application packet from the program to which you are applying.</p><p>Submit an application packet to the&nbsp;<a href=\"http://www.unm.edu/admissions/guidelines/graduate.html\">UNM Admissions Office</a>, which shall contain the following items:</p><ul><li>A UNM application for admission.</li><li>Residency Form.</li><li>$50.00 check made out to UNM or a major credit card if applying online.</li><li>An original, official, sealed transcript from each college or university you have attended.</li></ul><p>Required application materials may vary by program; please see program specific information, which you can link to from the&nbsp;<a href=\"http://coe.unm.edu/index.php/departments.html\">departments and programs</a>&nbsp;web page.</p></div>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Monica Lopez:</b></i>\n<b>Administrative Assistant II &amp; Graduate Information</b><div><font color=\"#c10037\"><b><br></b></font></div><div><b></b><font color=\"#c10037\"><b>Johnson Center 1155<br></b></font>\n<a target=\"_parent\" href=\"tel:5052775151\">(505) 277-5151</a><br>\n<a target=\"_parent\" href=\"mailto:mslopez@unm.edu\">mslopez@unm.edu</a><br><br>\n\t\t\n\t</div>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}