{
  "name": "History",
  "degree": "PhD",
  "program_description": "<p>The Ph.D. program in history at the University of New Mexico offers students the best possible preparation for the challenges and opportunities of the historical profession in the twenty-first century. Seminars and graduate-level courses provide depth within a particular field and also allow students to attain a unique intellectual breadth that complements study along traditional chronological and geographic lines. Through courses in historical methods and historiography, as well as the opportunity to take courses in other departments, students in our program will be able to approach their work with theoretical and interdisciplinary sophistication.&nbsp; Finally, our examination structure emphasizes qualities essential for success as a professional historian:&nbsp; excellence in writing and in public presentations and assurance in professional interactions.&nbsp; In sum, UNM students will be well prepared to carry out innovative work, by writing excellent dissertations, teaching with confidence a variety of courses, working as public historians, or pursuing any other opportunities that the historical profession might offer.</p><p>Doctoral students select two concentrations – one regional and one thematic – around which to organize their programs of study.&nbsp; The&nbsp;<a href=\"http://www.unm.edu/~hist/documents/RegionalConcentrationsFacultynames.pdf\">Regional Concentration&nbsp;</a>provides students with substantial background in a particular geographic, historical field, and the regions chosen here represent the UNM history department’s areas of strength:</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; U.S./American West<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Latin America<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Europe &nbsp;</p><p>A chronological or geographic specialization within each concentration also allows students to examine a particular period or topic in greater depth, thus acquiring the preparation essential for writing a strong dissertation.&nbsp; Doctoral students also select one field from a wide variety of&nbsp;<a href=\"http://www.unm.edu/~hist/documents/ThematicConcentrationsFacultynames-Copy.pdf\">Thematic Concentrations</a>:</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Gender and Sexuality<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Race and Ethnicity<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Frontiers and Borderlands<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; War and Society<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Environmental History<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Religion<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Politics and Economy</p><p>Doctoral students must also complete two courses in a discipline or program other than History, and may choose to participate in History 696, an optional Dissertation/Professionalization Workshop designed for advanced graduate students.&nbsp; For the Ph.D. Qualifying Examination in History, students complete a portfolio of graduate materials, an oral examination in both concentrations, and a public presentation on a topic selected by the examining committee.</p><p>The Graduate Director advises Doctoral students about program requirements and helps each student to form a faculty&nbsp;<a href=\"http://www.unm.edu/~hist/documents/CommitteeonStudiesPhD007_001.pdf\">Committee on Studies</a>, which provides intellectual and professional guidance.&nbsp; All PhD students must take History 664: Advanced Historiography, History 665: Advanced Historical Methods, and fulfill the department’s&nbsp;<a href=\"http://www.unm.edu/~hist/documents/LanguagerequirementNov2007.pdf\">foreign language requirement</a>&nbsp;prior to taking their qualifying exams, which are usually administered in the sixth semester of full-time doctoral study. <br></p>&nbsp;",
  "admission_requirements": "&nbsp;<p><strong>Doctoral Program Prerequisites</strong>: Successful completion of an M.A. Program in History, or equivalent degrees if approved by the History Graduate Entrance Committee.</p><p>Each Ph.D. student must demonstrate a reading knowledge of one foreign language by passing a written examination administered by the Department, or by completing 12 hours of coursework during the student's period of study at UNM with grades of B or better. A foreign language exam should be taken within the student's first year in the Ph.D. program. Students with a Regional Concentration in European or Latin American history must also demonstrate competence in a second foreign language appropriate to their course of study.</p><p>For information on admission to the History Doctoral Program, click&nbsp;<a href=\"http://www.unm.edu/~hist/graduate/admissions.html\">here</a>. Prospective applicants may also&nbsp;<a href=\"http://www.unm.edu/~hist/contact.html\">contact</a>&nbsp;the Graduate Director or department staff for further information. Students wishing to enroll for non-degree graduate coursework prior to admission for graduate study in History should consult the department's policy on&nbsp;<a href=\"http://www.unm.edu/~hist/documents/GRADUATENON-DEGREECOURSEWORKATUNMHIST.DEPT..pdf\">Graduate Non-Degree Coursework&nbsp;</a>and contact UNM's&nbsp;<a href=\"http://www.unm.edu/grad/ndc/ndc.html\">Non-Degree Student Services.</a></p>",
  "transfer_agreements": "",
  "career_opportunities": "<p>&nbsp;“History provides students with a greatly enriched view of the world around them as well as numerous real-world skills that will prove useful in many professional occupations. The study of history helps us to understand who we are and where we have been. That knowledge, in turn, helps to shape our future choices and directions. A major in history with its emphases on research, writing and creative and analytical thought prepares students for graduate student in history and in other fields, or for work in professions such as law, teaching, business, management, and publishing” (from the UNM History Department website).&nbsp;A bachelor's degree is the minimum formal education required. However, depending on the field, many employers also require graduate school (for example, many professional historical or academic jobs will require a graduate degree).&nbsp;</p>",
  "contact_information": "<i><b>Melissa Bokovoy:</b></i>\n<b>Graduate Director</b><br>\n<a target=\"_parent\" href=\"tel:5052777854\">(505) 277-7854</a><br>\n<a target=\"_parent\" href=\"mailto:mbokovoy@unm.edu\">mbokovoy@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}