{
  "name": "Historic Preservation and Regionalism",
  "degree": "Grad Certificate",
  "program_description": "&nbsp;<h2>Mission&nbsp;</h2><p>Our six course certificate program program is unique in its combination of proven historic preservation techniques with a spectrum of contemporary planning and design approaches for engaging history, culture and place, including:</p><ul><li>The history, theory and professional practices of preservation, regionalism and related place-based approaches&nbsp;</li><li>Preservation technologies</li><li>Government cultural resource management practices</li><li>Critical Regionalism, New Urbanism, Smart Growth and Sustainability planning approaches built on climatically- and culturally-adapted forms, and on mass transit and mixed-use neighborhoods&nbsp;</li><li>Adaptive re-use of and additions to historical buildings</li><li>Heritage tourism and cultural landscape planning&nbsp;</li><li>The roles of public history, art and annual celebrations in fostering community identity</li></ul><h2>Accreditation</h2><p>While there are no formal accreditation bodies for preservation or regionalism programs, the&nbsp;<a href=\"http://www.uvm.edu/histpres/ncpe/\">National Council of Preservation Educators (NCPE)</a>&nbsp;thoroughly reviews potential institutional members for the range and quality of their program. Founded in 2004, the HPR program was granted NCPE membership in 2005.</p><h2>Program History</h2><p>The need to educate a future generation of professionals capable of conserving New Mexico’s, the nation’s, and the world’s outstanding cultural heritage while creating new regionally-responsive design led to the creation of the School of Architecture and Planning's Graduate Certificate Program in Historic Preservation and Regionalism (HPR). While the school has long offered individual courses in historic preservation, and regional design and planning, demand for a coordinated program of courses increased in the 1990's.</p><p>In 1999, as a result of this demand, and a bequest from the legendary and recently-deceased cultural landscape historian J. B. Jackson, the School hired Chris Wilson to bring more regional history and cultural content into its curriculum. He was also charged with strengthening the School’s connections with New Mexico’s communities. Professor Wilson brought over fifteen years experience as a cultural historian, author, writer, preservation consultant, and adjunct professor to the task. His long-term friendship with J. B. Jackson; his expertise in Southwest historic resources, and graduate education; and extensive ties to communities, non-profit organizations, and government agencies across New Mexico informed the development of the program. Wilson interviewed a wide range of government and non-profit architects, planners, and landscape architects; government, non-profit and tribal officials, and tourism professionals who suggested a program not only in historic preservation, but also in contemporary regionally-appropriate architecture and planning. Many felt that a graduate certificate program was needed, not just in preservation but in contemporary design and planning as well.</p><p>From 2000 to 2004, Wilson raised significant funds from the state legislature, foundations, individual donors and from within the University to develop a new certificate program, establish a program endowment, and develop six new courses. Distinguished professionals developing courses in the areas of expertise included architect José Zelaya, preservationist Elmo Baca, architect Edith Cherry, and planner Arnold Valdez. After extensive review at the University and state level, the Graduate Certificate in Historic Preservation and Regionalism received formal approval in the spring of 2004.</p>",
  "admission_requirements": "&nbsp;<p>The Graduate Certificate in Historic Preservation and Regionalism (HPR) requires the completion of a minimum of 18 credit hours. Students may request that up to nine hours in the certificate also be used to satisfy graduate degree requirements. Most courses are offered in the late afternoon, evening, or weekends.</p><p><strong>To be eligible for admission to the Graduate Certificate in Historic Preservation and Regionalism, it is expected that the applicant will satisfy one of the following:</strong></p><ol><li><p>Hold a graduate degree in architecture, planning, landscape architecture,history, American studies, anthropology, architectural history, communications and journalism, environmental studies or other related field</p></li><li><p>Be admitted to or be currently enrolled in a graduate program at the University of New Mexico in one of these disciplines</p></li><li><p>Hold a bachelor's degree in one of these disciplines, and demonstrate in a resume and the letter of intent, experience or accomplishment such as professional licensing, publications, professional practice, or professional,non-profit or government work with responsibilities in preservation, heritage tourism development, regional design or planning, or related fields that indicate ability to complete this program.</p></li></ol><p>All applicants must demonstrate the capacity to successfully complete the course of study.</p><h2>Applications</h2><p>To apply, submit the following:</p><ol><li><p>A letter of interest explaining your reasons for seeking admission to the program, and your expected time line for completion of the certificate, and noting the criteria above that you satisfy, your social security number,mailing address and email address.</p></li><li><p>Two letters of recommendation from people who know your educational or work accomplishments and abilities.</p></li><li><p>&nbsp;A current resume.</p></li><li><p>Academic transcripts for all higher education course work.</p></li></ol><p>To insure consideration for a fall semester admission, completed applications are due no later than&nbsp;<strong>March 1</strong>for a spring semester admission, no later than&nbsp;<strong>November 1.</strong>&nbsp;Depending on space availability, applications received after those dates may be considered.</p><h3>Application Tracks:</h3><ol><li><p>&nbsp;If you are not currently a UNM graduate student, your application and $50 application fee goes through the&nbsp;<a href=\"http://www.unm.edu/apply/\">UNM Office of Admissions</a>.</p></li><li><p>If you are already a UNM graduate student, you can ask the graduate advisor or administrative assistant for your current program to submit copies of items 2 and 4 from your previous application files directly to the HPR program director. You will also submit items 1, and 3 directly to the HPR Program Director along with a completed&nbsp;<a href=\"http://ogs.unm.edu/resources/ogs-forms/documents/add-transcripted-certtificate-form.pdf\">Add a Transcripted Graduate Certificate Form.</a></p></li></ol><p><strong>Submit applications to:</strong><br>School of Architecture and Planning&nbsp;<br>Attn: Graduate Advisor<br>University of New Mexico<br>MSC04 2530<br>1 University of New Mexico<br>Albuquerque,NM, 87131-0001</p><h2>Contact</h2><p>If you have any questions regarding the admissions process for Historic Preservation and Regionalism, please contact:</p><p><a href=\"mailto:erowe@unm.edu\">Beth Rowe</a>, Graduate Advisor<br>505.277.1303</p>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Elizabeth Rowe:</b></i>\n<b>Senior Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052771303\">(505) 277-1303</a><br>\n<a target=\"_parent\" href=\"mailto:sedmora@unm.edu\">sedmora@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}