{
  "name": "Human Resource Management",
  "degree": "BBA",
  "program_description": "People are the most critical resource of a business. Effective utilization of employee capability is the focus of Human Resource Management. Evaluating the needs of an organization, finding people to fill those needs, and providing an optimum environment conducive to high levels of motivation and performance are all aspects of the HRM business function. Being current with the latest research, policies and thinking are integral to this concentration. Special attention is given to issues of diversity management and effective team development skills. Classes in this concentration are available to HRM majors and to other undergraduate and graduate students for their elective course work.\n\n\t\t\t&nbsp;",
  "admission_requirements": "&nbsp;<p>Minimum requirements for transfer or admission to the Bachelor of Business Administration Program are:</p><ol><li>Completion of or current enrollment in the pre-admission course work.</li><li>A minimum grade of “C” and an overall cumulative grade point average requirement of 2.5 on all required pre-admission course work. (Students should be aware that, due to space limitations, satisfying the minimum grade point average does not guarantee admission.)</li><li>An overall combined grade point average of 2.5 on all University of New Mexico and transfer course work.</li><li>Submission of a formal application for admission to the Anderson School Advisement Center during the semester when the pre-admission course work is to be completed. The application is online at the&nbsp;<a href=\"https://online.mgt.unm.edu/\" target=\"_blank\">ASM Web site</a>.</li><li>Application procedures must be completed by:<ul><li>•&nbsp;&nbsp; March 1 for Summer admission</li><li>•&nbsp;&nbsp; May 1 for Fall admission</li><li>•&nbsp;&nbsp; October 1 for Spring admission</li></ul></li><li>Students have two options regarding the CS 150L preadmission course work requirement: 1) take the class, or 2) pass the CS 149 waiver test. Applications&nbsp;are placed on hold and are&nbsp;not&nbsp;processed until the student satisfies this requirement. Information about the waiver exam is available at the&nbsp;<a href=\"http://cs.unm.edu/~joel/cs149/cs149.html\" target=\"_blank\">Computer Science department Web site</a>.</li></ol><p><em><strong>NOTE</strong>: Students who do not submit their applications by the deadline date or&nbsp;who do complete their admission requirements are&nbsp;required to reapply for the following semester.</em></p><br><p><strong>Required Pre-Admission Course Work</strong></p><ol><li>Writing and Speaking: ENGL 101, 102 and 219, Technical and Professional Writing or ENGL 220, Expository Writing.</li><li>Mathematics: MATH 121 (or 150) and 180 (or 162).</li><li>Physical and Natural Sciences: 7 credit hours, including one course with corresponding laboratory (designated L), from the Anderson core curriculum list.</li><li>Social Science and Behavioral Science: ECON 105, 106, 3 credit hours from either General Psychology (PSY 105) or Introduction to Sociology (SOC 101) and 6 additional credit hours selected from American Studies, Anthropology, Economics, Geography, History, Political Science, Psychology or Sociology.</li><li>Humanities: 3 credit hours chosen from Anderson’s core curriculum course list. Note that the University of New Mexico core curriculum requires 6 credit hours of Humanities. Anderson requires students to complete the additional 3 credit hours as part of their upper-division requirements.</li><li>Fine Arts: 3 credit hours chosen to fulfill Anderson’s core curriculum requirement.</li><li>Second Language: 3 credit hours.</li><li>Management 202 (Principles of Financial Accounting).</li><li>One of the following statistics courses: STAT 145 or 245 or 345, or MGMT 290.</li><li>Students must complete CS 150L or must pass the CS 150L waiver exam, CS 149, administered by the Department of Computer Science. CS 150L and equivalent courses must have been completed within&nbsp;five years of the semester in which the student is seeking admission to the B.B.A. Program. If more than five 5 years have elapsed, the student must complete the CS 149 waiver exam or repeat the course (no credit for repeating the course).</li></ol><p>Pre-admission total: 52 credit hours or 55 credit hours with CS 150L.</p><p><strong>NOTE</strong>: Students who are missing pre-admission course work&nbsp;are not&nbsp;considered for admission until all pre-admission course work has been completed. Applications for admission are&nbsp;not&nbsp;reviewed until all pre-admission course work grades have been posted.</p>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Florencio Olguin:</b></i>\n<b>Senior Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:50527738885\">(505) 277-3888</a><br>\n<a target=\"_parent\" href=\"mailto:folguin@unm.edu\">folguin@unm.edu</a><br><br>\n<i><b>Tracy Wilkey:</b></i>\n<b>Senior Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:50527738885\">(505) 277-3888</a><br>\n<a target=\"_parent\" href=\"mailto:twilkey@unm.edu\">twilkey@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": "Business Human Resource Management Employees Employer Organization Corporate Corporation Hire Hiring Training Development Benefits Insurance Compensation Career Policy Policies Procedure Salary Finance Economics",
  "moratorium": null
}