{
  "name": "Human Development & Family Relations",
  "degree": "BS",
  "program_description": "The Family Studies program focuses on learning, relationships and roles across the developmental stages — from conception to death. Family Studies address critical issues within the contexts of homes, families and communities in both the educational and social services environments. The B.S. Human Development &amp; Family Relations prepares students to affect the optimal well-being of families and individuals, recognizing that characteristics and needs of families change across the lifespan and within the contexts of multiple environments. Families provide children’s first learning environments, which impact children’s education and learning through life. Families are also the primary transmitters of values from one generation to the next and the largest providers of human services. Thus, Family Studies occupies a unique position and critical role in the College of Education.&nbsp;",
  "admission_requirements": "&nbsp;After you have completed at least 26 hours and have an overall GPA of 2.5, the College of&nbsp;Education allows you to apply for admission to College of Education programs. The Family&nbsp;Studies Program requires that you also have either successfully completed (C or better) FS 213&nbsp;and FS 281 or have completed at least 6 FS hours at UNM and are currently enrolled in FS 213&nbsp;and FS 281. &nbsp;In the latter case, your class standing in both FS 213 and FS 281 should reflect&nbsp;satisfactory progress (C or better). &nbsp;If you meet these requirements, you may complete an&nbsp;Admission Packet provided to students by the College of Education Advisement Office located&nbsp;in Hokona Hall. The Packet contains an Application Form and a Data Sheet. In addition to&nbsp;completing these two forms you are required to attach a current transcript, and write a statement&nbsp;(i.e., letter of intent) describing your reasons for selecting Family Studies as a major.",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Ziarat Hossain:</b></i>\n<b>Program Coordinator</b><br>\n<a target=\"_parent\" href=\"tel:5052774162\">(505) 277-4162</a><br>\n<a target=\"_parent\" href=\"mailto:zhossain@unm.edu\">zhossain@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}