{
  "name": "Information Assurance",
  "degree": "MBA",
  "program_description": "<p>Information assurance (IA) is an interdisciplinary concentration combining specialized aspects of information systems and accounting. Information Assurance includes many areas of management beyond computer security including auditing, forensic accounting, organizational design, and policy and planning. As such, an MBA program is a natural \"home\" for an IA concentration. For more information about the IA concentration, visit&nbsp;<a href=\"http://www.mgt.unm.edu/ia/\" target=\"_blank\">http://www.mgt.unm.edu/ia/</a>.</p><p>Anderson faculty members have developed a program that is unique in the country, if not the world, with the following characteristics and benefits to students:</p><ul><li>An AACSB accredited program with an emphasis in the management of information security, fraud and forensic accounting and an interdisciplinary focus on behavioral problems in protecting information.</li><li>A designation from the National Security Agency (NSA) and the Department of Homeland Security (DHS) as a center of academic excellence in IA (<a href=\"http://www.nsa.gov/ia/academic_outreach/nat_cae/index.shtml\" target=\"_blank\">CAEIA</a>) that ensures to our students, peers and community that the program meets \"the criteria which are designed to measure and recognize the depth and maturity of Information Assurance (IA) academic programs, and to stimulate the development of broad-ranging IA programs in order to meet the varying needs of the student population, including work force professionals, as well as the employment needs of government and industry\".</li><li>A partnership with the FBI and its Regional Computer Forensics Lab (<a href=\"http://www.rcfl.gov/\" target=\"_blank\">RCFL</a>), housed at&nbsp;<a href=\"http://www.nmrcfl.org/index.cfm\" target=\"_blank\">UNM</a>, through training, and student internships and co-ops.</li><li>A partnership with the Department of Energy's first satellite office for the&nbsp;<a href=\"http://www.sandia.gov/ccd/\" target=\"_blank\">Center for Cyber Defenders</a>&nbsp;through Sandia National Laboratories.</li><li>The Metro Law Enforcement Internship program designed for students to work with local white collar crime units.</li></ul>&nbsp;",
  "admission_requirements": "&nbsp;There are no formal concentration prerequisites though some concentration classes have individual prerequisites. Students taking advanced accounting classes need at least one accounting course (typically MGMT 540) beyond the required MBA core. Students taking MGMT 637 need at least an introductory exposure to computer programming which can be demonstrated by completing CS 152L, MGMT 330, or an equivalent course. Students need to complete MGMT 636 before taking MGMT 639 (Advanced IS Security). Applicable work experience may suffice in lieu of course prerequisites. Speak with the program advisor if you have specific questions about prerequisites.",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Megan Hearting:</b></i>\n<b>Director, Student Services</b><br>\n<a target=\"_parent\" href=\"tel:5052773290\">(505) 277-3290</a><br>\n<a target=\"_parent\" href=\"mailto:mconner@unm.edu\">mconner@unm.edu</a><br><br>\n<i><b>Nicole Capehart:</b></i>\n<b>Student Success Manager</b><br>\n<a target=\"_parent\" href=\"tel:5052773290\">(505) 277-3290</a><br>\n<a target=\"_parent\" href=\"mailto:ncapehar@unm.edu\">ncapehar@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}