{
  "name": "International Studies",
  "degree": "BA",
  "program_description": "<p>International Studies is an interdisciplinary undergraduate program drawing on the courses, faculty, and resources of a large number of UNM departments and colleges, with a central orientation toward contemporary global themes and different world areas. Because of its interdisciplinary nature, the program is housed in the College of Arts and Sciences and the College’s International Studies Institute but also draws on faculty and courses in the Colleges of Fine Arts, Architecture and Planning, and Education.</p><p>The core elements of the International Studies major and minor allow students to combine studies in languages, humanities, and social sciences with studies in such fields as fine arts, architecture and planning, and education in order to create an integrated, interdisciplinary undergraduate concentration.</p><p>The International Studies major and minor is administered by the International Studies Institute (ISI) in the College of Arts and Sciences. The ISI not only provides the administrative support and advising for the International Studies major and minor but also organizes lectures, lecture series, and special events and provides student scholarships to undergraduates.</p>&nbsp;",
  "admission_requirements": "&nbsp;<p>A minimum of 26 credit hours; 23 credit hours must be in courses acceptable toward graduation.</p><p>A cumulative grade point average of at least 2.00 on all work.</p><ul><li>Transfer students must have a 2.0 transfer GPA.</li><li>Continuing UNM students must have a 2.00 institutional GPA.</li></ul><p>Demonstrated academic achievement by satisfying the following:</p><ul><li>Completion of the University Speaking and Writing Core.</li><li>Completion of the University Mathematics Core.</li><li>Completion of the University Foreign Language Core.</li></ul><p>Completion of International Studies major&nbsp;admission coursework with grade of \"C\" or better:</p><ul><li>One course at any level (excluding 101 and 111) from FREN, SPAN, GRMN, GREK, LATN, ITAL, PORT, RUSS, CHIN, JAPN, ARAB. <br></li></ul>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Christine Sauer:</b></i>\n<b>Director, International Studies Institute</b><br>\n<a target=\"_parent\" href=\"tel:5052771963\">(505) 277-1963</a><br>\n<a target=\"_parent\" href=\"mailto:Sauer@unm.edu\">Sauer@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}