{
  "name": "International Management and International Management in Latin America",
  "degree": "BBA",
  "program_description": "<h3><strong>International Management–15 hours</strong></h3><p><a href=\"http://bba.mgt.unm.edu/concentrations/international.asp\">http://bba.mgt.unm.edu/concentrations/international.asp</a><br><br>The International Management concentration is designed for students who seek to prepare themselves for a career in international business. To enhance preparedness for an international career, students in the program develop competency in a foreign language and obtain first-hand international experience in addition to regular coursework.</p><p><strong>Course Requirements</strong>:</p><ol><li>Students must complete MGMT 421 (International Entrepreneurship) and MGMT 474 (International Finance).</li><li>Three elective concentration courses must be taken from among the following courses, or other appropriate courses with the approval of a faculty advisor: MGMT 420 (Management in Latin America), MGMT 422 (Seminar on Mexican Economy &amp; Markets), MGMT 483 (International Marketing), MGMT 492 (Negotiation Strategies) and special topics courses offered in the department.</li><li>Students are required to complete a portion of their coursework internationally by participating in either a UNM-approved exchange with a foreign university or a UNM program. Specifically, at least two (but no more than four) of the courses applied to the concentration must be completed outside the country. Students facing economic hardship may obtain a waiver of this requirement from the faculty advisor under limited circumstances.</li><li><strong>Students must complete a minimum of two upper-division (i.e., 300-level and above) foreign language courses.</strong></li></ol><hr><h3><strong>International Management in Latin America–15 hours</strong></h3><p><a href=\"http://bba.mgt.unm.edu/concentrations/international.asp\">http://bba.mgt.unm.edu/concentrations/international.asp</a><br><br>Students who are interested in careers in International Management in Latin America should meet with a faculty advisor early in their program to discuss career options and to have their course selections approved. Students who are serious about an international management career should also consider acquiring some first-hand international experience by living and working or studying abroad.</p><p><strong>Course Requirements</strong>:</p><ol><li>Students must complete MGMT 420 (Management in Latin America), MGMT 421 (International Entrepreneurship), MGMT 422 (Mexican Economy &amp; Markets), and MGMT 474 (International Finance).</li><li>One elective concentration course must be taken from among the following courses, or other appropriate courses with the approval of a faculty advisor: MGMT 483 (International Marketing), MGMT 492 (Negotiation Strategies) and special topics courses offered in the department.</li><li>Students are required to complete a portion of their coursework internationally by participating in either a UNM-approved exchange with a foreign university or a UNM program. Specifically, at least two (but no more than four) of the courses applied to the concentration must be completed in Latin America. Students facing economic hardship may obtain a waiver of this requirement from the faculty advisor under limited circumstances.</li><li><strong>Students must complete a minimum of two upper division (i.e., 300-level and above) foreign language courses in Spanish or Portuguese.</strong></li></ol>\n\n\t\t\t&nbsp;",
  "admission_requirements": "&nbsp;\n\t\t\n\t<p>Minimum requirements for transfer or admission to the Bachelor of Business Administration Program are:</p><ol><li>Completion of or current enrollment in the pre-admission course work.</li><li>A minimum grade of “C” and an overall cumulative grade point average requirement of 2.5 on all required pre-admission course work. (Students should be aware that, due to space limitations, satisfying the minimum grade point average does not guarantee admission.)</li><li>&nbsp;An overall combined grade point average of 2.5 on all University of New Mexico and transfer course work.</li><li>Submission of a formal application for admission to the Anderson School Advisement Center during the semester when the pre-admission course work is to be completed. The application is online at&nbsp;<a href=\"https://online.mgt.unm.edu/\">https://online.mgt.unm.edu</a>.</li><li><p>Application procedures must be completed by:<br>March 1 for Summer admission<br>May 1 for Fall admission<br>October 1 for Spring admission</p></li><li>Students have two options regarding the CS 150 preadmission course work requirement: 1) take the class, or 2) pass the CS 149 waiver test. Applications will be placed on hold and will not be processed until the student satisfies this requirement. Information about the waiver exam is available at&nbsp;<a href=\"http://cs.unm.edu/~joel/cs149/cs149.html\">http://cs.unm.edu/~joel/cs149/cs149.html</a></li></ol><p><em><strong>NOTE</strong>: Students not submitting their application by the deadline date or not completing their admission requirements will be required to reapply for the following semester.</em></p><br><p><strong>Required Pre-Admission Course Work</strong><br>(A) Writing and Speaking: ENGL 101, 102 and 219, Technical and Professional Writing or ENGL 220, Expository Writing.<br>(B) Mathematics: MATH 121 (or 150) and 180 (or 162)<br>(C) Physical and Natural Sciences: 7 credit hours, including one course with corresponding laboratory (designated L), from the Anderson core curriculum list.<br>(D) Social Science and Behavioral Science: ECON 105, 106, 3 credit hours from either General Psychology (PSY 105) or Introduction to Sociology (SOC 101) and 6 additional credit hours selected from American Studies, Anthropology, Economics, Geography, History, Political Science, Psychology or Sociology.<br>(E) Humanities: 3 credit hours chosen from Anderson’s core curriculum course list. Note that the University of New Mexico core curriculum requires 6 credit hours of Humanities. Anderson requires students to complete the additional 3 credit hours as part of their upper-division requirements.<br>(F) Fine Arts: 3 credit hours chosen to fulfill Anderson’s core curriculum requirement.<br>(G) Second Language: 3 credit hours.<br>(H) Management 202 (Principles of Financial Accounting).<br>(I) One of the following statistics courses: STAT 145 or 245 or 345, or MGMT 290<br>(J) Students must complete CS 150L or must pass the CS 150 waiver exam, CS 149, administered by the Department of Computer Science. CS 150 and equivalent courses must have been completed within 5 years of the semester in which the student is seeking admission to the B.B.A. Program. If more than 5 years have elapsed, the student must complete the CS 149 waiver exam or repeat the course (no credit for repeating the course).</p><p>Pre-admission total: 52 credits or 55 credits with CS150L.</p><p><strong>NOTE</strong>: Students who are missing pre-admission course work will not be considered for admission until all pre-admission course work has been completed. Applications for admission will not be reviewed until all pre-admission course work grades have been posted.</p>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Florencio Olguin:</b></i>\n<b>Senior Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:50527738885\">(505) 277-3888</a><br>\n<a target=\"_parent\" href=\"mailto:folguin@unm.edu\">folguin@unm.edu</a><br><br>\n<i><b>Tracy Wilkey:</b></i>\n<b>Senior Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:50527738885\">(505) 277-3888</a><br>\n<a target=\"_parent\" href=\"mailto:twilkey@unm.edu\">twilkey@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": "International World Global Culture Language Business Corporation Corporate Partnership Partner Collaboration Management Latin America Finance Financial Technology Entrepreneur Entrepreneurial Money Market Countries Foreign Economic",
  "moratorium": null
}