{
  "name": "Interdisciplinary Liberal Arts",
  "degree": "BA",
  "program_description": "<p>Honors\nCollege Bachelor of Arts Degree:</p><p>Interdisciplinary\nLiberal Arts</p><p><b>Introduction</b></p><p>The faculty of the\nUniversity of New Mexico offers one Bachelor of Arts degree to high\nachieving students in the Honors College, Interdisciplinary Liberal\nArts.  This baccalaureate degree program provides the opportunity for\nstudents in the Honors College to develop a broad-based and flexible\ninterdisciplinary liberal arts education similar to what many small\nliberal arts colleges offer.  The Interdisciplinary Liberal Arts\ndegree will provide students with a foundation in social and\nbehavioral studies, physical and natural sciences, humanities,\ncommunications, mathematics, and fine arts and allow students to\nfocus on a specific area of interdisciplinary study.</p><p>Students majoring in\nInterdisciplinary Liberal Arts will have the opportunity to discover\nconnections among disciplines and analyze and evaluate primary and\ncomplex texts across diverse genres and styles and from different\nhistorical periods.  They will do research and produce original work\nthat integrates ideas and methods from different disciplines and\nlearn to adapt to new environments and developing technologies. \nStudents will be expected to have intercultural knowledge and\ncompetence and develop personal and social responsibility, including\ncivic knowledge and engagement—local and global.</p><p><b>Requirements</b></p><p>All candidates for the\nInterdisciplinary Liberal Arts degree must be admitted to the Honors\nCollege and maintain a 3.5 cumulative GPA.  The students will develop\na program of study approved by the Honors College Degree Committee. \nThe following are required:</p><ol>\n\t<li><p>A minimum of 120  hours is\n\trequired in all curricula.  Of these, at least 36 hours must be\n\tcompleted in courses with a UHON designation.</p>\n\t</li><li><p>The ability to communicate in a\n\tlanguage other than English is becoming imperative to participate\n\tand lead in today’s global marketplace. Interdisciplinary Liberal\n\tArts majors must complete 12 CH of a single non-English language or\n\tprovide an equivalent proficiency document. Information about\n\tnon-English language programs can be found at <u><a href=\"http://www.unm.edu/~fll\">www.unm.edu/~fll</a></u>\n\tor <u><a href=\"http://www.unm.edu/~spanport\">www.unm.edu/~spanport</a></u>\n\t\t</p>\n\t</li><li><p>Completion of UNM core\n\trequirements, some of which can be completed through Honors.</p>\n\t</li><li><p>A student must choose a minor or a\n\tsecond major from a field of study that complements or enhances a\n\tstudent’s area of research interest.  This must be approved by the\n\tHonors College Degree Committee.</p>\n\t</li><li><p>Students must complete the\n\tfollowing in the Honors College: \n\t</p>\n</li></ol><ul>\n\t<li><p>3 credit hours of UHON 121 or 122;</p>\n\t</li><li><p>A minimum of 3 credit hours of 200\n\tlevel UHON courses;</p>\n\t</li><li><p>A minimum of 6 credit hours of 300\n\tlevel UHON courses; and</p>\n\t</li><li><p>A minimum of 3 credit hours of 400\n\tlevel UHON courses in addition to UHON 498, UHON 490 or UHON 491\n\tneeded to satisfy the honors thesis/project requirement.</p>\n\t</li><li><p>A minimum of 6 credit hours of\n\texperiential seminars as approved by the Honors College Degree\n\tCommittee.  International experiential programs and courses are\n\tpreferred but not required.</p>\n\t</li><li><p>6-9 credit hours of an\n\tinterdisciplinary honors thesis/project (UHON 498, 490 &amp; 491).</p>\n\t</li><li><p>9-12 credit hour integrative\n\thonors block to be taken concurrently in one semester. The honors\n\tblock must be approved by the Honors College Degree Committee and\n\tmay be structured as one of the following:</p>\n</li></ul><ul>\n\t\n\t\t<li><p>Designated Honors College\n\t\tInternational Programs \n\t\t</p>\n\t\t</li><li><p>Theme-based courses or modules</p>\n\t\t</li><li><p>Research and experiential tracks \n\t\t</p>\n\t</li>\n</ul><p>\nThe integrative honors block must include an integrative synthesis\nseminar.</p><ol>\n\t<li><p>18 credit hours of upper division\n\tcourses (300-400 levels), approved by the Associate Dean of Honors,\n\tin courses that will enrich a student’s knowledge in the\n\tfollowing:</p>\n</li></ol><ul>\n\t<li><p>New environments and developing\n\ttechnologies; \n\t</p>\n\t</li><li><p>Intercultural knowledge and\n\tcompetence; \n\t</p>\n\t</li><li><p>Personal and social\n\tresponsibility, including civic knowledge and engagement;</p>\n\t</li><li><p>Research fundamentals and\n\tmethodology.</p></li></ul><p></p>",
  "admission_requirements": "<p>All students are required to submit an application for admission to the Honors College. Application deadlines are:<br></p><p>Start in Fall Semester: February 12 for early decision and May 1 final deadline.</p><p>Start in Spring Semester: Deadline is November 1.</p>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<p><i><b>Sophia Alvarez:</b></i></p>\n<b>College Coordinator</b><br>\n\n<a target=\"_parent\" href=\"tel:5052774213\">(505)277-4213</a><br>\n<a target=\"_parent\" href=\"mailto:sra@unm.edu\">sra@unm.edu</a><a target=\"_parent\" href=\"mailto:sra@unm.edu\"></a><strong></strong>",
  "online": "partial",
  "keywords": "genius honor honors interdisciplinary liberal art arts smart",
  "moratorium": null
}