{
  "name": "Interdisciplinary Film & Digital Media",
  "degree": "BBA",
  "program_description": "The IFDM program is a model of interdisciplinary education for the 21st&nbsp;century that will give students necessary critical, creative, and technical&nbsp;skills to apply digital technologies in innovative and productive ways. This&nbsp;program builds on ARTS Lab (Arts Research Technology and Science&nbsp;Laboratory) with existing strengths at UNM in Fine Arts, Engineering, Arts&nbsp;and Sciences, and the Anderson School of Management, along with other&nbsp;schools and colleges. The Film and Digital Media Program has four&nbsp;objectives: (1) integrating filmmaking and digital media, (2) building a&nbsp;Native New Mexican Hollywood, (3) training the citizens of New Mexico and&nbsp;(4) fostering research.&nbsp;",
  "admission_requirements": "Students must apply in early spring (typically as incoming freshman) to be accepted&nbsp;as a pre-major student in the IFDM program. If accepted, they will become part of a&nbsp;cohort that will begin in the fall immediately following admission. Students then work&nbsp;through the preadmission requirements and apply to Anderson. Students must&nbsp;complete all pre-admission course work with a “C” or better, a GPA of 2.5 on all pre-admission course work and an overall GPA of 2.5 on UNM and transfer work (if applicable), and submission of an application to the program by published deadlines.&nbsp;Applications may be online at www.bba.mgt.unm.edu.&nbsp;<br>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Nick Flor:</b></i>\n<b>Concentration Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052778438\">(505) 277-8438</a><br>\n<a target=\"_parent\" href=\"mailto:flor@mgt.unm.edu\">flor@mgt.unm.edu</a><br><br>\n<i><b>Andres Armijo:</b></i>\n<b>IFDM Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052770581\">(505) 277-0581</a><br>\n<a target=\"_parent\" href=\"mailto:ajarmijo@unm.edu\">ajarmijo@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": "Interdisciplinary Film Digital Media Marketing Information Decision Art Cinema Production Movie Computer Computing Internet Design Creative Create Technology Innovate Innovation Science Technical Filmmaking Hollywood Gaming Video Animation Illustration Photography Communication Journalism  Multimedia Expression",
  "moratorium": null
}