{
  "name": "Integrative Studies",
  "degree": "BIS",
  "program_description": "<p>The\nfaculty of The University of New Mexico offers the degree of Bachelor\nof Integrative Studies (B.I.S.). This program, approved in 2013, is\nadministered through University College.</p><p>The\nfocused\nnature of the B.I.S.\ndegree specifically engages students who would benefit from closer\ncollaboration with a faculty mentor(s) through experiential research\nand/or participation with faculty-led problem solving teams. Students\nare encouraged to design an individualized program that will prepare\nthem for unique or advanced learning experiences – including\ninternational, cooperative or professional schools. It\nmay be used as part of a dual degree or as a second degree, and an\nexisting departmental minor is required.</p><p>Strict\ncompliance with B.I.S. requirements is mandatory for admission to and\ncontinuation in the program. Changes to approved Plans of Study may\nbe made only in consultation with an advisor. Students in the\nIntegrative Studies program must meet the general academic\nregulations of the University for admission, academic standing, and\ngraduation found under the University Catalog headings of <a href=\"http://catalog.unm.edu/catalogs/2012-2013/admissions.html\">Admissions</a>\n&amp; <a href=\"http://catalog.unm.edu/catalogs/2012-2013/undergrad-program.html\">Undergraduate\nPrograms</a>.\nStudents who have not been continuously enrolled for 3 consecutive\nsemesters must follow the requirements of the current University of\nNew Mexico Catalog upon readmission.</p><p>\n\n\n\n\n\n</p><p>Questions\nregarding any aspect of the program should be addressed to an advisor\nin the LAIS office. Please also visit the website at\n<a href=\"http://lais.unm.edu/bis\">http://lais.unm.edu/bis</a>\nfor FAQs, Forms and Downloads, and Helpful Hints, etc.</p><p></p>",
  "admission_requirements": "<p>Admission\nto the Integrative Studies program for the current term must take\nplace before the end of the third week of classes. After that\ndeadline, admission will be for the following term (Fall, Spring or\nSummer). Please see an advisor for more information on LAIS admission\nrequirements.</p>\n<p>Minimum\nrequirements to transfer into the Integrative Studies program are as\nfollows:</p>\n<ol>\n\t<li><p>Completion\n\tof the University Writing &amp; Speaking Core.</p>\n\t</li><li><p>Completion\n\tof the University Mathematics Core.</p>\n\t</li><li><p>Completion\n\tof the University Foreign Language Core.</p>\n\t</li><li><p>A\n\tminimum cumulative grade point average of 2.00 or higher.</p>\n\t</li><li><p>Twenty-six\n\tor more hours of earned credit applicable to this program.</p></li></ol>\n<p><b>Application\nProcess</b></p>\n<p>Application\nto the Integrative Studies program includes a preliminary advisement\nsession with an LAIS Academic Advisor. The meeting is the student’s\nopportunity to discuss their ideas and goals for their degree, and\nask any questions they may have before admission to the program.</p>\n<p>Students\nmust then submit the following to an LAIS Advisor:</p>\n<ol>\n\t<li><p>A\n\tcomprehensive <i>Plan\n\tof Study</i>.\n\tThis Plan of Study must list all course work taken, including\n\ttransfer work, and all remaining courses that the student intends to\n\ttake to complete their B.I.S. degree. In preparing a Plan, the\n\tstudent must consult The University of New Mexico Catalog to find\n\tcourses appropriate for their interdisciplinary plan.</p>\n\t</li><li><p>A\n\t<i>Project\n\tProposal</i>.\n\tYour proposal should include:</p>\n</li></ol>\n<ul>\n\t<li><p>Establish\n\ta faculty mentor and include their name, department, and contact\n\tinformation;</p>\n\t</li><li><p>Explain\n\tyour motivation for this project (rationale, goals, time frame);</p>\n\t</li><li><p>Discuss\n\tthe intellectual merit, including how the project will address a\n\t“problem” through distinctiveness and/or creativity;</p>\n\t</li><li><p>Demonstrate\n\tthe feasibility of the project (how are you qualified, resources\n\tneeded, etc.).</p>\n</li></ul>\n<p> \n</p>\n<p>Note:\nApplication will not be accepted unless all pieces are submitted\ntogether – plan, project proposal, and is signed by both the\nstudent and faulty mentor.</p>\n<p><b>Graduation\nRequirements</b></p>\n<p>Students\nmust see an Advisor in the LAIS office to apply for graduation one\nyear prior to that in which they plan to graduate. An “apply to\ngraduate” hold will appear on the student’s account once the\nstudent has earned 100 credit hours to remind them of this\nrequirement. At this time, the student and the Advisor will view a\nLobotrax Degree Audit specifying the work remaining to be completed\nfor graduation. <b>It\nshould be noted that students are solely responsible for knowing and\ncompleting all requirements for graduation from the Integrative\nStudies program. </b>Students\nmust know how to run and read their LoboTrax Degree Audits in order\nto check on their graduation progress. We recommend students run and\nsave (or print) an audit each time a change is made to their schedule\nas audits are not saved in Loboweb.</p>\n<p>In\naddition to adherence to approved plans of study, specific graduation\nrequirements are as follows:</p>\n<ol>\n\t<li><p>Completion\n\tof the University’s core curriculum.</p>\n\t</li><li><p><a name=\"_GoBack\"></a>A\n\tminimum of 120 semester hours of earned credit acceptable to the\n\tprogram as defined above.</p>\n\t</li><li><p>A\n\tminimum cumulative UNM grade point average of 2.00.</p>\n\t</li><li><p>A\n\tminimum of 51 semester hours earned in courses at the upper-division\n\tlevel (courses numbered 300–499). <i>It\n\tshould also be noted that transfer courses in which credit was\n\tearned at a lower-division designation cannot be transferred as\n\tupper-division to count towards a B.I.S. degree.</i></p>\n\t</li><li><p>A\n\tminimum grade-point average of 2.00 on all upper-division course\n\twork completed at The University of New Mexico.</p>\n\t</li><li><p>A\n\tminimum of 36 semester hours of academic work earned while enrolled\n\tin the Integrative\n\tStudies program.\n\tThis is known as the department residency requirement. (Not to\n\tinclude: credit by exam, transfer credit and/or concurrent\n\tenrollment, nonprofessional-physical education and/or music\n\tensemble, or independent study/problems courses unless specifically\n\tapproved by an LAIS Advisor.) These must include the final 36 hours\n\tof enrollment prior to graduation from the program.</p>\n\t</li><li><p>A\n\tminimum of 15 credit hours of Integrative Studies [LAIS] core\n\tcourses [150, 310, 311, 399 (x3) &amp; 499]; and an additional 21\n\tcredit hours of approved elective courses acceptable to the\n\tIntegrative Studies degree must be included in the Plan of Study.</p>\n\t</li><li><p>Completion\n\tof a Capstone Project [LAIS 499] approved by the faculty mentor.</p>\n\t</li><li><p>Fulfillment\n\tof the <i>University’s\n\tresidence credit requirement</i>\n\t(30 credit hours, including the <i>15\n\tafter 92 rule</i>).</p></li></ol>\n<p><b>Departmental\nHonors</b></p>\n<p>A\nseparate departmental honors designation is not available for a\nB.I.S. degree.  However, students meeting all requirements may\nreceive baccalaureate honors as specified in the <a href=\"http://catalog.unm.edu/catalogs/2012-2013/\">UNM\nCatalog</a>.</p>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Mariah Harrison:</b></i>\n<b>Senior Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052770112\">(505) 277-0112</a><br>\n<a target=\"_parent\" href=\"mailto:\tmariah09@unm.edu\">mariah09@unm.edu</a><br><br>\n<i><b>Stephanie Heikkinen:</b></i>\n<b>Senior Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052778276\">(505) 277-8276</a><br>\n<a target=\"_parent\" href=\"mailto:\tsheikkin@unm.edu\">sheikkin@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}