{
  "name": "Journalism and Mass Communication - Strategic Communication Concentration",
  "degree": "BA",
  "program_description": "The Department of Communication and Journalism at the University of New Mexico offers a Bachelor of Arts degree with a major in Journalism &amp; Mass Communication through the College of Arts and Sciences with concentrations in either Multimedia Journalism or Strategic Communication. Our Multimedia Journalism concentration combines print, broadcasting and online journalism and helps to prepare students for a variety of careers and positions with media companies. Our Strategic Communication concentration helps to prepare students for a variety of careers in advertising and public relations fields. In conjunction with specializing in one of these areas, each major is required to take at least one course in writing for the media, along with courses that explore ethics and multimedia and visual communication. Students must complete at least one of the following sequences below.",
  "admission_requirements": "<p>A minimum of 26 credit hours; 23 credit hours must be in courses acceptable toward graduation.</p><p>A cumulative grade point average of at least 2.00 on all work.</p><ul><li>Transfer students must have a 2.0 transfer GPA.</li><li>Continuing UNM students must have a 2.00 institutional GPA.</li></ul><p>Demonstrated academic achievement by satisfying the following:</p><ul><li>Completion of the University Speaking and Writing Core.</li><li>Completion of the University Mathematics Core.</li><li>Completion of the University Foreign Language Core.</li></ul><p>Completion of Department of Communication and Journalism major admission coursework with grades of \"C\" or better:</p><ul><li><strong>Communication:</strong>&nbsp;CJ 101 and&nbsp;one 3 credit&nbsp;hour CJ course at any level.</li><li><strong>Journalism and Mass Communication:</strong>&nbsp;CJ 171L and&nbsp;STAT 145.</li></ul>",
  "transfer_agreements": "",
  "career_opportunities": "Students who major in journalism&nbsp;may be inclined to pursue careers in print, broadcast, or online journalism. &nbsp;Others may prefer to find work outside of journalism, either directly after graduation or after obtaining a professional degree. &nbsp;Undergraduate study in journalism is well suited for students planning on attending professional programs in law, public administration, social work, or business;&nbsp;or for students planning to enter&nbsp;any&nbsp;field of work that makes use&nbsp;of people skills, the ability to digest new information, and the ability to read and write analytically. &nbsp;",
  "contact_information": "<i><b>Gregoria A. Cavazos :</b></i>&nbsp;<b>Academic Advisor</b><br><a target=\"_parent\" href=\"tel: 5052771903\">(505) 277-1903</a><br><a target=\"_parent\" href=\"mailto:cjadvise@unm.edu\">cjadvise@unm.edu&nbsp;</a><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}