{
  "name": "Landscape Architecture",
  "degree": "MLA",
  "program_description": "<p>The Master of Landscape Architecture program is a fully accredited graduate professional degree that prepares graduates to enter the profession and discipline of landscape architecture. The MLA degree program accepts applications from students with previous degrees in non-design and design disciplines. The SA•P does not offer an undergraduate degree in Landscape Architecture.</p><p>Students entering the program with non-design majors are required to complete a minimum of 87 credit hours. This will normally require three-years of study.</p><p>Students entering the program with pre-professional or professional degrees in Landscape Architecture, Architecture or related environmental design disciplines are required to complete 48 - 54 credit hours with the total number of credit hours to be determined by the Program Director on a case-by-case basis.</p><p>The Post Professional Degree program is offered for applicants who hold a Bachelor degree in Landscape Architecture, who are licensed or who qualify for licensure and who have significant experience in the profession; or a degree in Architecture with a minimum of five years of professional experience. This program track and will require 30 - 32 credit hours of study. Please contact the program director for further information.</p><p>The Graduate program in Landscape Architecture at the University of New Mexico complements the Architecture and Community and Regional Planning programs within the School of Architecture and Planning. The strong interdisciplinary relationship among the three programs in addition to the School’s close ties with professional, state, civic, neighborhood and cultural communities of the region ensures that students are given the opportunity to engage in a rich and diverse educational experience.</p><p>Several classes are offered in the evenings but students will not be able to complete the two or three year programs of study in evening hours. Many of the students work part-time, however, applicants should not expect to be able to hold a full-time job while in their program of study.</p><p>The program has strengths in the following areas:</p><ul><li>Design</li><li>The urban environment</li><li>Sustainable design</li><li>Cultural landscape studies, in particular, the cultural and historic landscapes of the Southwest</li><li>Environmental / land art</li></ul>&nbsp;",
  "admission_requirements": "&nbsp;<p><strong>Please submit the following items on-line to University of New Mexico Admissions Office:</strong></p><ul><li><p>The University of New Mexico&nbsp;<a href=\"http://www.unm.edu/apply/\">on-line application</a>.</p></li><li><p>A $50 application fee payable on-line or by phone at 505-277-5363. Please make sure to keep your reference number for fee payment.</p></li></ul><p><strong>In addition to the UNM Office of Admissions application requirements, each student must also submit to the Landscape Architecture Program</strong>:</p><ul><li>&nbsp;A letter of intent outlining the applicant’s interest in the discipline of landscape architecture and the reasons for seeking admission to the program</li></ul><ul><li>Letters of reference from three individuals under whom the applicant has worked and/or studied. Two of the letters shall normally be from teachers or academic advisors who can comment on the applicant’s prior undergraduate and/or graduate performance;</li></ul><ul><li>&nbsp;A resume (curriculum vitae)</li></ul><ul><li>A portfolio of creative work. The portfolio should provide high quality examples of creative thinking and creative approaches in no larger than an 11x17 format. Applicants are encouraged to think about the design and presentation of the portfolio. Please do not include original works in the portfolio submission, rather submit copies, prints or images of original works at an effective quality to communicate appropriate detail. Please note:<br>Both Analog and Digital portfolio submissions are accepted. All applicants to the two-year post-professional MLA program must submit a portfolio.</li></ul><ul><li>A copy of transcripts for each institution you have attended.</li></ul><p><strong>International Students</strong>&nbsp;also need to submit the following:</p><ul><li><p>An attested copy of your diploma</p></li><li><p>Official TOEFL scores that must meet the University of New Mexico minimum of 79 on the IBT TOEFL.</p></li></ul><p><strong>Please submit application materials and questions to:</strong></p>Landscape Architecture Program<br>School of Architecture &amp; Planning<br>Attn: Beth Rowe, Graduate Advisor<br>MSC 04 2530<br>Albuquerque, New Mexico 87131<br>505 277 1303<br><a href=\"mailto:erowe@unm.edu\">erowe@unm.edu</a><br>",
  "transfer_agreements": "",
  "career_opportunities": "<p>Plan and design land areas for such projects as parks and other recreational facilities, airports, highways, hospitals, schools,\nland subdivisions, and commercial, industrial, and residential sites. &nbsp;Landscape architects design these areas so that they are not only functional, but also beautiful, and compatible with the\nnatural environment. They plan the location of buildings, roads, and walkways, and the arrangement of flowers, shrubs, and\ntrees. Throughout all phases of the planning and design, landscape architects consult with other professionals, such as civil\nengineers, hydrologists, or architects, involved in the project. UNM offers a Master of Landscape Architecture degree which\n“prepares students for the thoughtful design and planning of outdoor space for human use and enjoyment” (from UNM\nCatalog 2007-2008).&nbsp;</p>",
  "contact_information": "<i><b>Elizabeth Rowe:</b></i>\n<b>Senior Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052771303\">(505) 277-1303</a><br>\n<a target=\"_parent\" href=\"mailto:sedmora@unm.edu\">sedmora@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}