{
  "name": "Languages",
  "degree": "BA",
  "program_description": "<p>For students who love to study languages but and have a hard time picking only one, FLL offers the popular interdisciplinary major in Languages. Majors choose 2 languages in which to specialize from all those offered at UNM (Latin, ancient Greek, Spanish, Portuguese, French, German, Italian, Russian, Chinese, Japanese, Arabic, Navajo, Old English, Sign Language, and others), as well as courses in linguistics and the history of languages.</p><p>The Languages Major allows students to get a general introduction to the study of languages with a specialization in two languages of the student’s choice.</p><p>The Languages Minor allows students to specialize in two languages of the student’s choice.</p><h3>The Languages Major</h3><h4>Option A</h4><p>Requirements:&nbsp;42 hours of course work, to be distributed as follows:</p><ol><li>Latin or Greek 101 (3 hours)</li><li>Linguistics 101 or 301 (3 hours)</li><li>Nine (9) hours of course work above 300 in each of two of the following languages (18 hours):<ul><li>French, German, Italian, Portuguese, Russian&nbsp;(200 or above)</li><li>Greek, Latin, Japanese, Spanish and Chinese&nbsp;(pending instructional availability)</li></ul></li><li>Six (6) hours of lower division course work in a language other than the two counted under category 3 above&nbsp;(including Navajo, Signed Language or Swahili)&nbsp;(6 hours)</li><li>Twelve (12) additional hours of course work either in Linguistics, the languages chosen under categories 1 or 3&nbsp;(upper division only), or 4&nbsp;(lower division possible),&nbsp;<br>or&nbsp;<br>English courses such as History of the English Language, Old English, or Comparative Literature 223 or 380&nbsp;(but not both)&nbsp;(12 hours)</li></ol><h4>Option B</h4><p>Note:&nbsp;A minor or a second major is necessary for Option B.</p><p>Requirements:&nbsp;24 hours of course work, to be distributed as follows:&gt;</p><ol><li>Latin or Greek 101 (3 hours)</li><li>Linguistics 101 or 301 (3 hours)</li><li>Nine (9) hours of course work above 300&nbsp;in each&nbsp;of two of the following languages (18 hours):<ul><li>French, German, Greek, Italian, Latin, Portuguese, Russian&nbsp;(200 or above)</li><li>Japanese, Chinese, and Spanish</li><li>Option:&nbsp;Comparative Literature 223 or 380 may also be counted toward category 3</li></ul></li></ol>\n\n\t\t\t&nbsp;",
  "admission_requirements": "",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Carmen Nocentelli :</b></i>\n<b>Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052778944\">(505)  277-8944</a><br>\n<a target=\"_parent\" href=\"mailto:nocent@unm.edu\">nocent@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}