{
  "name": "Latin American Studies",
  "degree": "BA",
  "program_description": "<p>The undergraduate major/minor in Latin American Studies (LAS) provides a solid foundation in language skills and area competence for careers in business, education, public service, or for further graduate/professional training.</p><p>Students work closely with the Associate Director for Program Development in planning their program of study. All coursework taken in fulfillment of the major or minor must be approved by the Associate Director. The LAS program produces a list of&nbsp;<a href=\"http://laii.unm.edu/academics/courses.php\" title=\"courses.php\" target=\"_blank\">LAS-related courses</a>&nbsp;each semester. Students should consult this list to determine which courses are appropriate for the major or minor. If a student is interested in a course that is not listed in this document, he/she may petition to include the course in his/her program of study for the major or minor. If the course is deemed to have relevant and sufficient LAS content, it may be approved.</p>",
  "admission_requirements": "&nbsp;<p>A minimum of 26 credit hours; 23 credit hours must be in courses acceptable toward graduation.</p><p>A cumulative grade point average of at least 2.00 on all work.</p><ul><li>Transfer students must have a 2.0 transfer GPA.</li><li>Continuing UNM students must have a 2.00 institutional GPA.</li></ul><p>Demonstrated academic achievement by satisfying the following:</p><ul><li>Completion of the University Speaking and Writing Core.</li><li>Completion of the University Mathematics Core.</li><li>Completion of the University Foreign Language Core.</li></ul><p>Completion of&nbsp;Latin American Studies&nbsp;Program&nbsp;admission coursework with grade of \"C\" or better:</p><ul><li>HIST 181 or 182.</li></ul>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>M. Robyn Cotê:</b></i>\n<b>Program Manager</b><br>\n<a target=\"_parent\" href=\"tel:5052776843\">(505) 277-6843</a><br>\n<a target=\"_parent\" href=\"mailto:rcote@unm.edu\">rcote@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}