{
  "name": "Law",
  "degree": "JD",
  "program_description": "&nbsp;<p>The State Bar of New Mexico having previously adopted a resolution to that end and the Legislature having financial provision, the Regents of The University of New Mexico, on March 31, 1947, as expressly authorized by Laws 1889, Ch. 138, Sec. 15, approved the establishment of a School of Law.</p><h3><b>Accreditation</b></h3><p>The school is fully accredited; it was approved by the American Bar Association on February 24, 1948, and membership in the Association of American Law Schools was granted in December 1948.<br></p><p>Detailed information about graduation requirements for the School of Law is contained in the School of Law Bulletin and Handbook of Policies. To be graduated from the University of New Mexico with a J.D. degree, a student must meet all of the following requirements:</p><ol><li><strong>Residence:</strong>&nbsp;The student must spend the equivalent of at least two full academic years in residence at accredited law schools.</li><li><strong>Credit hours:</strong>&nbsp;The student must earn at least 86 hours of law credit.</li><li><strong>Grade point average:</strong>&nbsp;The student must attain at least a 2.00 overall grade point average.</li><li><strong>Required Courses:</strong><ul><li><strong>First-year:</strong>&nbsp;The student must take the full first-year curriculum offered upon entrance.</li><li><strong>Professional responsibility:</strong>&nbsp;The student must take and pass a professional responsibility course:&nbsp;<em>Ethics</em>&nbsp;(LAW 750).</li><li><strong>Clinic:</strong>&nbsp;The student must participate satisfactorily in at least 6 hours of clinical law school credit, as prescribed by the faculty. No extern field experience courses or skills courses apply toward this requirement. There are prerequisites and/or corequisites for all clinical courses.</li><li><strong>Writing requirement:</strong>&nbsp;Students are required to complete the Writing Requirement by completing two classes: a writing seminar and a drafting class.</li></ul></li></ol><p></p>",
  "admission_requirements": "&nbsp;<p>Information about the procedure for applying to the School of Law is contained in the School of Law Catalog. All applicants for admission to the School of Law are required to take the Law School Admission Test (LSAT), to register for the Law School Data Assembly Service and to have a baccalaureate degree from an accredited college or university before time of registration. Application material is available after September 1; the application deadline is February 1.</p><p>Beginning law students will be admitted at the opening of the fall semester only. No part-time students are admitted.</p>",
  "transfer_agreements": "&nbsp;The School of Law accepts a limited number of transfer students who have completed one full-time year at other ABA-approved law schools. Transfer applicants are considered for admission only if they 1) have outstanding records at the law school previously attended; or 2) are in good standing at the law school previously attended, are residents of New Mexico and have a compelling reason to continue their legal education at the University of New Mexico. Credits earned at other law schools that do not meet their minimum graduation requirements are not acceptable for transfer credit to the University of New Mexico School of Law. Information about the procedure for applying to the School of Law is contained in the School of Law Catalog. The deadline for submitting transfer applications is June 15. The deadline for completing a transfer application file is July 15. If admitted with advanced standing to the University of New Mexico Juris Doctor degree program, the student’s right to continue in that program depends entirely on work done at the University of New Mexico. Transfer students are ineligible for certain prizes and awards given by the Law School.",
  "career_opportunities": "",
  "contact_information": "<i><b>Ellen Grigsby:</b></i>\n<b>Pre-Law Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052775233\">(505) 277-5233</a><br>\n<a target=\"_parent\" href=\"mailto:egrigsby@unm.edu\">egrigsby@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}