{
  "name": "Linguistics",
  "degree": "PhD",
  "program_description": "&nbsp;<br>The Ph.D. program requires a minimum of 48 graduate credit course work. This may include up to 30 credit hours of appropriate courses from the M.A. but at least 18 hours must be work beyond the M.A. At least 24 hours must be completed at UNM and at least 18 credit hours must be at the 500- or 600-level. Students must fulfill the following requirements: 1) a graduate phonology course (502 or 503); 2) an advanced course in phonetics or phonology (505, 506, or a seminar in phonetics or phonology); 3) a course in each of the following areas: discourse/syntax (523, 529, or a seminar on a relevant topic); cognitive linguistics (519, 525, or a seminar on a relevant topic), and typology (513, 517, 548, or a seminar on a relevant topic); 4) at least one methods courses; and 5) three advanced seminars in the areas of preparation for the comprehensive examination. These required courses include some that were required for the M.A. and courses taken for that degree may be included as fulfilling the requirements for the Ph.D. as well.<p>Research skills required for the Ph.D. are 1) reading, writing, and conversational ability in a language other than the student’s native language (this requirement may be fulfilled by&nbsp;four semesters of college language courses with a grade of \"B\" or better); 2) knowledge of the structure of a non-Indo-European language; and 3) coursework in statistics up to and including analysis of variance or the equivalent.</p><p>At the end of their coursework Ph.D. candidates are required to take a comprehensive examination over three areas of specialization.</p><p>Contact the department for more detailed information on admissions and requirements for the M.A. and Ph.D. programs or consult the Web site,&nbsp;<a href=\"http://www.unm.edu/~linguist\">http://www.unm.edu/~linguist</a>.</p>",
  "admission_requirements": "&nbsp;Admission to the Ph.D. program is highly selective. The following \ncriteria must be met: 1) completion of course work equivalent to the \nUniversity of New Mexico M.A. in Linguistics with an average of \"B+\" or \nbetter; 2) Pass with Distinction on the University of New Mexico M.A. \nComprehensive Exam or equivalent, and the submission of a research paper\n of publishable quality; and 3) willingness of a University of New \nMexico Linguistics faculty member to serve as the student’s mentor.",
  "transfer_agreements": "",
  "career_opportunities": "<p>&nbsp;Linguistics is the study of how languages work, change, are learned, and are used. Linguists, therefore, see language as an intricate system of interacting semantic, grammatical,&nbsp;phonological, and pragmatic rules and principles to study, describe, and ultimately to understand. The concerns in linguistics overlap with those of other language sciences, making linguistics a truly interdisciplinary field. &nbsp;&nbsp;A bachelor's degree is the minimum formal education required, and qualifies one for entry-level positions in business, nonprofit organizations, and government. Depending upon the student’s career interests, and due to the major’s emphasis on analysis, argumentation and reasoning, and communication, a linguistics major is may pursue a professional degree in law, business, government or education.&nbsp;</p>",
  "contact_information": "<i><b>Yvonne Martinez-Ingram:</b></i>\n<b>Department Administrator</b><br>\n<a target=\"_parent\" href=\"tel:5052776353\">(505) 277-6353</a><br>\n<a target=\"_parent\" href=\"mailto:ymartin@unm.edu\">ymartin@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}