{
  "name": "Management Information Systems Management",
  "degree": "MBA",
  "program_description": "<p>The field of management information systems (MIS) encompasses the analysis, design, implementation, and management of information systems. Information systems help to control operations through transaction processing, and also support planning and decision-making activities in all functional areas of an organization. Successful information system professionals need excellent communication skills (verbal and written), technical expertise in computer hardware and software systems, knowledge of the application domain, and the ability to work well with people.</p><p>The MIS concentration focuses on IS resource management and advanced topics in system development and management tools and techniques. Job opportunities for graduates include positions such as systems analyst, information resource manager, system or network administrator, and database administrator, among others. A wide range of public and private-sector employers hire Anderson MIS MBA graduates.</p>",
  "admission_requirements": "The concentration requirements are 15 credit hours of graduate MIS courses.Required Courses:MGMT 634 (Information Systems Analysis &amp; Design)*&nbsp;- Prerequisite: MGMT 330 or CS 152L and Instructor Permission RequiredMGMT 637 (Database Management Systems)*&nbsp;- Prerequisite: MGMT 330 or CS 152L and Instructor Permission Required*May be waived based on equivalent undergraduate coursework and substituted with MIS electives (see&nbsp;over) with prior written consent of the concentration advisor.",
  "transfer_agreements": "",
  "career_opportunities": "<p>The need for organizations to incorporate existing and future technologies in order to remain competitive has become a more pressing issue over the last several years. As electronic commerce becomes more common, how and when companies use technology are critical issues. Computer and information systems managers play a vital role in the technological direction of their organizations. They do everything from constructing the business plan to overseeing network security to directing Internet operations.</p><p>Computer and information systems managers plan, coordinate, and direct research and design the computer-related activities of firms. They help determine both technical and business goals in consultation with top management, and make detailed plans for the accomplishment of these goals. For example, working with their staff, they may develop the overall concepts of a new product or service, or may identify how an organization’s computing capabilities can effectively aid project management.</p>",
  "contact_information": "<i><b>Megan Hearting:</b></i>\n<b>Director, Student Services</b><br>\n<a target=\"_parent\" href=\"tel:5052773290\">(505) 277-3290</a><br>\n<a target=\"_parent\" href=\"mailto:mconner@unm.edu\">mconner@unm.edu</a><br><br>\n<i><b>Nicole Capehart:</b></i>\n<b>Student Success Manager</b><br>\n<a target=\"_parent\" href=\"tel:5052773290\">(505) 277-3290</a><br>\n<a target=\"_parent\" href=\"mailto:ncapehar@unm.edu\">ncapehar@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}