{
  "name": "Management Information Systems",
  "degree": "BBA",
  "program_description": "&nbsp;The need for organizations to incorporate existing and future technologies in&nbsp;order to remain competitive has become a more pressing issue over the last&nbsp;several years. As electronic commerce becomes more common, how and when&nbsp;companies use technology are critical issues. Computer and information&nbsp;systems managers play a vital role in the technological direction of their&nbsp;organizations. They do everything from constructing the business plan to&nbsp;overseeing network security to directing Internet operations. Computer and&nbsp;information systems managers plan, coordinate and direct research, and&nbsp;design the computer-related activities of firms. They help determine both&nbsp;technical and business goals in consultation with top management, and make&nbsp;detailed plans for the accomplishment of these goals. For example, working&nbsp;with their staff, they may develop the overall concepts of a new product or&nbsp;service, or may identify how an organization’s computing capabilities can&nbsp;effectively aid project management.",
  "admission_requirements": "&nbsp;Admission to this program requires completion of all pre-admission course work&nbsp;with a “C” or better, a GPA of 2.5 on all pre-admission course work and overall&nbsp;GPA of 2.5 on UNM or transfer work, and submission of application to the&nbsp;program by published deadlines. Admission applications are entered and&nbsp;submitted online at www.mgt.unm.edu.",
  "transfer_agreements": "",
  "career_opportunities": "<p>The need for organizations to incorporate existing and future technologies in order to remain competitive has become\na more pressing issue over the last several years. As electronic commerce becomes more common, how and when\ncompanies use technology are critical issues. Computer and information systems managers play a vital role in the\ntechnological direction of their organizations. They do everything from constructing the business plan to overseeing\nnetwork security to directing Internet operations.\n\t\t\t</p><p>Computer and information systems managers plan, coordinate, and direct research and design the computer-related\nactivities of firms. They help determine both technical and business goals in consultation with top management, and\nmake detailed plans for the accomplishment of these goals. For example, working with their staff, they may develop\nthe overall concepts of a new product or service, or may identify how an organization’s computing capabilities can\neffectively aid project management.&nbsp;</p>",
  "contact_information": "<i><b>Florencio Olguin:</b></i>\n<b>Senior Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:50527738885\">(505) 277-3888</a><br>\n<a target=\"_parent\" href=\"mailto:folguin@unm.edu\">folguin@unm.edu</a><br><br>\n<i><b>Tracy Wilkey:</b></i>\n<b>Senior Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:50527738885\">(505) 277-3888</a><br>\n<a target=\"_parent\" href=\"mailto:twilkey@unm.edu\">twilkey@unm.edu</a><br><br>",
  "online": "degree completion",
  "keywords": null,
  "moratorium": null
}