{
  "name": "Marketing Management",
  "degree": "BBA",
  "program_description": "&nbsp; &nbsp; &nbsp;&nbsp;The Anderson School of Management fosters an exciting academic environment with expert academic and career advising, world renowned faculty, innovative learning practices, and a dedication to career development through a variety of programs including internships, resume reviews, mock interviews, and social media management. Choosing the right education is a crucial step for your career and your life. The Anderson School of Management equips you for success with 11 degree options to match business with your passion and offers you a highly accredited business degree and a unique opportunity to connect with employer partners before you begin the program.<p>The Anderson Undergraduate (BBA) program admits students who meet pre-admission requirements. Students must apply and be admitted to UNM, as well as Anderson, upon completion of the pre-admission requirements.</p>",
  "admission_requirements": "&nbsp;<ol><li>Completion of pre-admission coursework. A checklist of required pre-admission coursework is part of your application.</li><li>A minimum grade of \"C\" and an overall cumulative GPA of 2.5 on all required pre-admission coursework.</li><li>An overall combined GPA of 2.5 on all University of New Mexico and transfer coursework.</li><li>Submission of Application to the Anderson School Advisement Center during the semester that pre-admission coursework is to be completed.</li><li>You must be admitted to UNM before you can be admitted to Anderson. Visit the UNM website (<a href=\"http://www.unm.edu/\" target=\"_blank\">www.unm.edu</a>) for more information.</li><li>Send official transcripts from all institutions attended. Please notify your advisor if you have academic coursework in progress from another institution, i.e. CNM.</li></ol><p><em>Requirements are subject to change. Please note that there is no guarantee of admission.</em></p>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Florencio Olguin:</b></i>\n<b>Senior Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:50527738885\">(505) 277-3888</a><br>\n<a target=\"_parent\" href=\"mailto:folguin@unm.edu\">folguin@unm.edu</a><br><br>\n<i><b>Tracy Wilkey:</b></i>\n<b>Senior Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:50527738885\">(505) 277-3888</a><br>\n<a target=\"_parent\" href=\"mailto:twilkey@unm.edu\">twilkey@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": "Market Marketing Information Decision Sciences Manage Management Managing Retail Communicate Advertise Public Relation Communication Business Money Corporate Corporation Entrepreneur Entrepreneurial Product Design Development Pricing Promotion Distribution Customer Economy Economic Logistics Media Lead Leader Finance",
  "moratorium": null
}