{
  "name": "Mathematics (Applied Concentration)",
  "degree": "BS",
  "program_description": "<br>To prepare for a career in applied mathematics outside of academia, build your program around the skills that employers need: breath and depth in mathematics, communication and computational skills, knowledge of a relevant area outside of mathematics, and problem-solving ability. Choose areas that interest you and that are relevant to your probable future employment.<br>&nbsp;<br>",
  "admission_requirements": "&nbsp;<p>A minimum of 26 credit hours; 23 credit hours must be in courses acceptable toward graduation.</p><p>A cumulative grade point average of at least 2.00 on all work.</p><ul><li>Transfer students must have a 2.0 transfer GPA.</li><li>Continuing UNM students must have a 2.00 institutional GPA.</li></ul><p>Demonstrated academic achievement by satisfying the following:</p><ul><li>Completion of the University Speaking and Writing Core.</li><li>Completion of the University Mathematics Core.</li><li>Completion of the University Foreign Language Core.</li></ul><p>Completion of Department of&nbsp;Mathematics and Statistics&nbsp;admission coursework with grades of \"C\" or better:</p><ul><li>MATH 123.</li><li>MATH 150.</li></ul>",
  "transfer_agreements": "",
  "career_opportunities": "<p>&nbsp;Conduct research in fundamental mathematics or in application of mathematical techniques to science, management, and other fields. Solve or direct solutions to problems in various fields by mathematical methods. &nbsp;A bachelor's degree is the minimum formal education required. However, many employers also require graduate school. For example, they may require a master's degree, and some require a Ph.D., M.D., or J.D. (law degree).&nbsp;</p>",
  "contact_information": "<i><b>Ana Parra Lombard:</b></i>\n<b>Coordinator, Program Advisement</b><br>\n<a target=\"_parent\" href=\"tel:5052775250\">(505) 277-5250</a><br>\n<a target=\"_parent\" href=\"mailto:alombard@unm.edu\">alombard@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}