{
  "name": "Mathematics",
  "degree": "PhD",
  "program_description": "<p><strong>Concentrations: Pure Mathematics, Applied Mathematics.</strong></p><p>The Doctor of Philosophy in Mathematics degree is offered by the department with concentrations in the areas of pure mathematics and applied mathematics. Knowledge of one foreign language chosen from French, German or Russian is expected. Students must pass the Ph.D. qualifying examinations no later than one year after admission. The Ph.D. requires a minimum of 18 credit hours of work beyond the Master’s degree and those credit hours must be in residence at UNM. No more than 6 of these credit hours may be in reading or special topics courses. An additional 18 credit hours of dissertation are required for the Ph.D. The concentration&nbsp;program of study in Pure Mathematics must complete at least two one-year sequences of advanced courses, for example: MATH 563 and 581;MATH 530 and 531; MATH 532 and 533; MATH 536 and 537; MATH 572 and 565; and/or MATH 519 and 539. Credit for attendance in four departmental seminars or colloquia is required for the&nbsp;concentration in Pure Mathematics, The program of study for the concentration of Applied Mathematics must complete: MATH 505, MATH 510, MATH 583, MATH 584, and student must have credit for attendance in at least four department seminars or colloquia.</p><p><strong>NOTE:</strong>&nbsp;MATH 501 and 502 cannot be counted toward credit&nbsp;hours needed for graduate degrees in Mathematics or Statistics.</p>&nbsp;",
  "admission_requirements": "",
  "transfer_agreements": "",
  "career_opportunities": "<p>Conduct research in fundamental mathematics or in application of mathematical techniques to science, management,\nand other fields. Solve or direct solutions to problems in various fields by mathematical methods. &nbsp;A bachelor's degree is the minimum formal education required. However, many employers also require graduate\nschool. For example, they may require a master's degree, and some require a Ph.D., M.D., or J.D. (law degree).&nbsp;</p>",
  "contact_information": "<i><b>Ana Parra Lombard:</b></i>\n<b>Coordinator, Program Advisement</b><br>\n<a target=\"_parent\" href=\"tel:5052775250\">(505) 277-5250</a><br>\n<a target=\"_parent\" href=\"mailto:alombard@unm.edu\">alombard@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}