{
  "name": "Mechanical Engineering",
  "degree": "MS",
  "program_description": "&nbsp;The graduate programs offered in the department are planned to prepare graduates for professional engineering work in private industry or governmental laboratories or for teaching/research positions. The focus is on the fundamental concepts in the selected research area, with elective and supporting work to complete the study program.",
  "admission_requirements": "&nbsp; &nbsp; &nbsp;&nbsp;We welcome applications from students who have earned distinguished academic records. Results of the Graduate Record Examination (GRE) General Test must be submitted to the Department prior to admission.<p>The following deadlines apply:</p><table><tbody><tr><td>&nbsp;</td><td>Domestic Applicants Not Requesting Financial Aid (TA/PA)</td><td>International and Domestic Applicants Requesting Financial Aid (TA/PA)</td></tr><tr><td>Fall</td><td>July 30</td><td>March 1</td></tr><tr><td>Spring</td><td>November 30</td><td>August 1</td></tr><tr><td>Summer</td><td>April 30</td><td>N/A</td></tr></tbody></table><br><p>The Director of Graduate Programs makes admission decisions. Applicants must hold (or will have completed by the time they arrive) an accredited Bachelor of Science in Mechanical Engineering (B.S.M.E.) degree and at least a B average in their final two years (or their final, earned 60 credit hours) of their last degree.</p><p>Applications from individuals with a B.S. degree in other Engineering disciplines, Math, Computer Science, and Physical Sciences (such as Physics and Chemistry) are also considered. To qualify for a graduate degree, applicants are expected to have at least an undergraduate-level exposure to most of the core ME disciplines. Those who are deemed deficient may be asked to take additional (leveling) courses.</p>",
  "transfer_agreements": "",
  "career_opportunities": "<p>Perform engineering duties in planning and designing tools, engines, machines, and other mechanically functioning\nequipment. Oversee installation, operation, maintenance, and repair of such equipment as centralized heat, gas,\nwater, and steam systems. &nbsp;A bachelor's degree is the minimum formal education required. However, many employers also require graduate\nschool and some require a Ph.D., M.D., or J.D. (law degree).&nbsp;</p>",
  "contact_information": "<i><b>Anna Mae Apodaca:</b></i>\n<b>Coordinator, Program Advisement</b><br>\n<a target=\"_parent\" href=\"tel:5052772762\">(505) 277-2762</a><br>\n<a target=\"_parent\" href=\"mailto:aapodaca@unm.edu\">aapodaca@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}