{
  "name": "Music",
  "degree": "MMu",
  "program_description": "The University of New Mexico is a member of the National Association of Schools of Music (NASM).&nbsp;Requirements for entrance and graduation as set forth in this Catalog are in accordance with published regulations of NASM.&nbsp;<p>Concentrations are offered in the following areas:</p><ul><li><strong>Collaborative Piano.</strong>&nbsp;For the student interested in a career as a piano chamber musician and accompanist. Preparation emphasis in on individual instruction for the development of skills and repertoire needed in the art of solo and ensemble performance, and on practicing these skills and repertoire in rehearsal and recital situations.</li><li><strong>Conducting.</strong>&nbsp;For the student who has some undergraduate experience in conducting and who wishes to pursue a career in conducting, or to continue studies at the doctoral level, or simply to improve his or her conducting skills.&nbsp;The focus in this degree can be in wind, orchestral or choral conducting.</li><li><strong>Music Education.</strong>&nbsp;Designed to help current and aspiring music teachers improve the quality of their instruction, increase their musical skills and knowledge, and to gain a better understanding of the broader issues in the field of music education. This concentration may be pursued with either a Thesis or Project option. The thesis option is recommended for students who anticipate doctoral study in Music Education; the project option is recommended for those who do not anticipate doctoral study.</li><li><strong>Musicology.</strong>&nbsp;&nbsp;For students interested in research in music history and literature and/or preparation for doctoral-level student in musicology. Preparation emphasis includes the development of research and writing skills and the pursuit of knowledge in music history and literature from the Middle Ages through the twentieth century.</li><li><strong>Performance.</strong>&nbsp;&nbsp;For students interested in pursuing a career in performance. Preparation emphasis is on the development of technique, musicianship and repertoire for the principal instrument or voice through individual instruction and in participation in large ensembles (band, orchestra, chorus) and/or chamber groups as appropriate.</li><li><strong>Theory and Composition.</strong>&nbsp;&nbsp;For students who wish to prepare for doctoral work in composition or music theory at the Research I university level. Preparation emphasis features individual instruction in compositional topics as well as required and elective courses in music theory. Theory courses prepare students to write, hear, analyze, theorize and receive critiques on their work about music from the sixteenth century to the present.</li><li><strong>Woodwinds.</strong>&nbsp; For students who&nbsp;wish to become proficient in multiple woodwind instruments to enhance their marketability in the performance world.&nbsp; This concentration specifies study in a principal instrument with a graduate recital required, as well as acceptable proficiency on three secondary instruments.</li></ul><h4>General Requirements</h4><p>Before admission, a prospective student should send materials pertinent to his or her particular program (see “special prerequisites” below). A candidate for the Master of Music degree must have an undergraduate degree in music from an accredited college or equivalent proficiency. An applicant without a music degree will be required to take a proctored test before being admitted; he or she may have to do undergraduate work before becoming a graduate student.</p><p><strong>Placement Exams.</strong>&nbsp;All entering graduate students in music must take placement tests in music history and music theory before their first classes begin. If the placement tests reveal deficiencies, appropriate course work will be required. Consult the&nbsp;<em>Department of Music Graduate Student Handbook</em>&nbsp;for specific requirements. Before completion of the first semester of coursework, students pursuing the Master of Music Concentration in Music Education must also take a written guidance examination in relevant contemporary topics and issues in music education. Consult the&nbsp;<em>Department of Music Graduate Student Handbook</em>&nbsp;for a description of this exam.&nbsp;</p><p><strong>Piano Proficiencies.</strong>&nbsp;A piano proficiency exam is required of graduate students pursuing the following concentrations: Conducting (Choral or Orchestral focus), Performance (Voice), Music History and Literature, and Theory and Composition (Theory focus). This exam must be passed by the end of the semester PRECEDING the semester of graduation. Consult the&nbsp;Department of Music Graduate Student Handbook&nbsp;for specific requirements.</p><p><strong>Language Requirements.</strong>&nbsp;There are language and/or diction requirements for the concentrations in Music History and Literature, Collaborative Piano, Performance (Voice) and Conducting (Choral focus). &nbsp;Please consult degree plans for specific requirements. Language and diction requirements must be completed at the time the Program of Studies form is submitted.</p><p><strong>Final Comprehensive Examinations.</strong>&nbsp;All students will be required to pass a final written and/or oral comprehensive examination.</p><p><strong>Ensemble Participation.</strong>&nbsp;Graduate students may be required to participate in a major ensemble. Consult the&nbsp;<em>Department of Music Graduate Student Handbook</em>&nbsp;and the degree requirements for each concentration described below.</p><p><strong>Workshops.</strong>&nbsp;Unless otherwise stipulated, the maximum workshop credit allowed under Plan I is 5 hours; under Plan II, 8 hours.</p><p><strong>Problem Courses.</strong>&nbsp;The maximum credit allowed for Graduate Problems is 6 hours. Enrollment in Graduate Problems requires the approval of both the Department Chair and the Department Graduate Committee. Consult the&nbsp;<em>Department of Music Graduate Student Handbook</em>&nbsp;regarding procedures for requesting approval for Graduate Problems enrollment.</p><p><strong>Instructors.</strong>&nbsp;No more than half of the degree program’s minimum required course work hours, exclusive of Thesis or Project, may be taken with a single faculty member.</p><p><strong>Fees.</strong>&nbsp;Graduate students must pay all course fees as described on the&nbsp;<a href=\"http://catalog.unm.edu/catalogs/2013-2014/colleges/fine-arts/music/index.html\">Music Main Page</a>. In addition, a fee will be charged each semester to support the Graduate and Professional Student Association (GPSA). International students will be charged a one-time fee to cover the services offered by the Global Education Office (GEO). Students pursuing a Master of Music concentration that requires a recital (or recitals) will be required to pay a fee for the performance(s) to be recorded. &nbsp;</p>",
  "admission_requirements": "<p>Information on the application process can be found on the&nbsp;<a href=\"http://music.unm.edu/\" target=\"_blank\">Music department&nbsp;Web site</a>&nbsp;under \"Prospective Students.\" Please contact the Graduate Coordinator for additional details.</p><p>Applications are reviewed as they are received, but a prospective student should submit all materials by:</p><table><tbody><tr><td>Fall semester:</td><td>July 1</td></tr><tr><td>Spring semester:</td><td>November 1</td></tr><tr><td>Summer session:</td><td>April 24</td></tr></tbody></table><p><br>For international students, deadlines for submission of all materials are as follows:</p><table><tbody><tr><td>Fall semester:</td><td>May&nbsp;1</td></tr><tr><td>Spring semester:</td><td>October 1</td></tr><tr><td>Summer session:</td><td>March 1</td></tr></tbody></table><p><strong><br>NOTE</strong>: Early application is recommended. Students who wish to apply to the Concentration in Theory and Composition should submit all materials by March 1 for best consideration.</p><p></p>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Colleen Sheinberg:</b></i>\n<b>Graduate Coordinator</b><br>\n<a target=\"_parent\" href=\"tel:5052778401\">(505) 277-8401</a><br>\n<a target=\"_parent\" href=\"mailto:colleens@unm.edu\">colleens@unm.edu</a>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}