{
  "name": "Native American Studies",
  "degree": "BA",
  "program_description": "A Bachelor of Arts degree in Native American Studies from University Studies is designed&nbsp;to give students a relatively broad background while allowing&nbsp;concentrated study in one of the four areas of concentration.&nbsp; Students formally&nbsp;declare&nbsp;<strong><em>both a major and minor</em></strong>&nbsp;when they enter University Studies.&nbsp; They&nbsp;<strong><em>must file</em></strong>&nbsp;a degree application with the Department Advisor upon completion of 80 hours.&nbsp; A list of courses&nbsp;required for graduation is then sent to the student.&nbsp;&nbsp;<em>The student&nbsp;is solely responsible for being familiar with and completing&nbsp;all graduation requirements.<br><br></em><p>A Bachelor of Arts degree in Native American Studies from University \nCollege is awarded&nbsp;upon completion or accomplishment of the following:&nbsp;</p><ul><li>NATV Major Required Core Courses: &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 18 credit hrs or 6 courses</li><li>Required from NATV concentration: &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 12 credit hrs or 4 courses</li><li>Remaining upper division courses:&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 6&nbsp; credit hrs or 2 courses</li><li><a href=\"http://www.unm.edu/%7Eucac/forms.htm\">Completion of UNM CORE</a></li><li>A total of 128 acceptable hours to graduate</li><li>A\n grade point average of at least 2.00 as defined in the&nbsp;General Academic\n Regulations section of the catalog and a Major specific Grade Point \nAverage (GPA) of 2.5</li><li>Fifty hours of upper-division course work \n(courses&nbsp;numbered 300 or 400) with a minimum grade point&nbsp;average of 2.00\n on all upper-division hours accepted</li></ul><p><strong>NATV Major Required Core Courses</strong></p><p><strong>NATV 150. Introduction to Native American Studies. (3)</strong><br>This\n course surveys the significance of Native American Studies through an \ninter-disciplinary approach to four major areas of academic \nconcentrations; Arts and Literature, Education and Language, Cultural \nStudies and Environment, and Leadership and Self-determination.</p><p><strong>NATV 250. Sociopolitical Concepts in Native America. (3)</strong><br>Regional,\n national, and international laws and policies impacting sovereign \nNative American nations and communities are analyzed. Concepts such as \ncolonization, nationalism, and globalization’s impact on Native American\n peoples are considered from an inter-disciplinary perspective. \nPrerequisite: 150.</p><p><strong>NATV 251. Research Issues in Native America. (3)</strong><br>Critically\n examines research theories, methodologies, and practices used by \nacademic disciplines to study Native Americans. Research databases and \ncollections and their impact and value for Native communities are \nconsidered from an inter-disciplinary perspective. Prerequisites: 150 or\n 250.</p><p><strong>NATV 300. Research Methods in Native American Contexts. (3)</strong><br>Examination\n of the research processes and techniques involving various \nmethodological designs. Emphasizes attention to culturally appropriate \nresearch and protocols for conducting research in Native communities. \nIncludes practical experience conducting a research project involving \nNative American issues.&nbsp; Prerequisite: NATV 251.</p><p><strong>NATV 351. Individual Study (1-6)&nbsp;</strong><br>Directed topics related to Native American Studies.</p><p>NATV 351 Individual Study Guidelines<br><em>This course is restricted to NATV majors and minors and the permission of the instructor is required before registering.</em>&nbsp;This\n course is a directed study of Native American Studies topics not \ncovered in regular courses. The student must approach the instructor the\n semester before they plan to take the Individual Study. The student \nwill develop a plan of study with the instructor. A formal presentation \nor paper will be required.</p><p><strong>NATV 352. Internship (1-6)&nbsp;</strong><br>Internships\n in off-campus learning experiences related to the study of Native \nAmerican cultures. Students, in collaboration with NAS Senior Academic \nAdvisor, may select a sponsoring institution or program to oversee \ninternship.</p><p><strong>NATV 474. Traditions of Native American Philosophy. (3)</strong>&nbsp;<br>An examination of philosophical thought by Native peoples in<br>both\n historic and modern context in science, government, law, education, \npsychology, and cosmology. Native social systems and Native \nphilosophical contributions to the world’s societies are examined.</p><br>",
  "admission_requirements": "Earned 26 credit hours <br>Earned a 2.0 GPA <br>Satisfied the English Competence Requirement in one of these ways: <br>~ Completion of English 102 with a grade of C (2.00) or higher <br>~ A score of 29 or better on the English portion of the Enhanced ACT <br>~ A score of 650 or better on the verbal portion of the SAT <br>~ Credits for English 102 through CEEB Advanced Placement program <br>~ Acceptance of the writing proficiency portfolio <br>~ Complete NATV 150, 250, 251 with a grade of C (2.00) or higher <br>~ Complete NATV application <br>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Margaret Lumpmouth:</b></i>\n<b>Senior Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052772631\">(505) 277-2631</a><br>\n<a target=\"_parent\" href=\"mailto:\tmaggie78@unm.edu\">maggie78@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}