{
  "name": "Nuclear Medicine Imaging",
  "degree": "Certificate",
  "program_description": "&nbsp; &nbsp; &nbsp;&nbsp;Nuclear Medicine Technologists require a wider base of skills with which to compete in today’s job market. The goal of the Nuclear Medicine Program is to provide the technologist with skills necessary to perform the complex diagnostic procedures involved with this field.<p>This North Central Association of Colleges and School (NCA) accredited program in Nuclear Medicine imaging provides the student with the knowledge and skills necessary to perform complex diagnostic procedures involving the in vitro and in vivo use of radiopharmaceuticals and state-of-the-art nuclear instrumentation. Enrollment is limited to two - eight students each year. The course of study begins in the summer and ends after four consecutive semesters of clinical and didactic experience at The University of New Mexico Hospital, Presbyterian Hospital and Veterans Administration Medical Center.</p><p>Upon successful completion of the program, the student receives a certificate in Nuclear Medicine imaging and is eligible to sit for national certifying examinations given by the American Registry of Radiologic Technologists and the Nuclear Medicine Technology Certification Board.</p>",
  "admission_requirements": "&nbsp;<ol><li>Applicant must meet The University of New Mexico admission requirements (refer to UNM Catalog).</li><li>While competitive grade point averages are usually higher, each applicant must have a minimum cumulative grade point average of 2.5 in post-secondary coursework.</li><li>A completed application, three letters of recommendation, three reference forms, and official transcripts must be received by January 31st of each year for acceptance into the program the following summer (Nuclear Medicine Certificate), fall (PET/CT).</li><li>Students participating in the PET/CT Certificate Program must be certified by the American Registry of Radiologic Technologists (ARRT), or the Nuclear Medicine Technologist Certification Board (NMTCB).</li><li>The program selection committee will conduct a personal interview with each qualified student candidate.</li><li>Applicant must have a baccalaureate degree with course work in physics, chemistry, anatomy and physiology and/or ethics; or hold certification as a Radiologic Technologist, Registered Nurse or Medical Technologist; or undergraduate applicant must complete the prerequisites described under Pre-professional Curriculum prior to entry into the program.</li><li>Employment reference checks may be required for application process. A background check will be performed through the State of New Mexico upon acceptance into the program.</li><li>If completing the Bachelor of Science in Radiologic Sciences, Concentration Nuclear Medicine, coursework will be determined based upon prior courses completed.</li><li>The University of New Mexico and the Radiologic Sciences Program does not discriminate against any applicant based on sex, age, race, religion, creed, or national origin.</li></ol>",
  "transfer_agreements": "",
  "career_opportunities": "<p>“The Nuclear Medicine Imaging Technology Program at the University of New Mexico is a full-time 12-month curriculum of\nclassroom and clinical training which leads to a Certificate in Nuclear Medicine Technology. Students are admitted once a\nyear, with classes beginning in the Fall semester (late August). This training provides the student with the knowledge and\nskills necessary to perform complex diagnostic procedures involving the in-vitro and in-vivo use of radiopharmaceuticals\nusing state-of-the-art nuclear instrumentation. The program will continue its accreditation through the North Central\nAssociation of Colleges and Schools, Commission on Institutions of Higher Education. Upon successful&nbsp;completion, students are eligible to take the national certifying examination administered by the Nuclear Medicine\nTechnology Certification Board (NMTCB) and the American Registry of Radiologic Technologists (ARRT).” (from the\nDepartment of Radiology website).&nbsp;</p>",
  "contact_information": "<i><b>Pamala Garcia-Ramirez:</b></i>\n<b>Program Coordinator</b><br>\n<a target=\"_parent\" href=\"tel:5052725254\">(505) 272-5254</a><br>\n<a target=\"_parent\" href=\"mailto:PKGarcia@salud.unm.edu\">PKGarcia@salud.unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}