{
  "name": "Nursing",
  "degree": "PhD",
  "program_description": "<p>The UNM College of Nursing PhD Program prepares nurses to become researchers and scholars in academia, health policy, and health care settings.&nbsp; The PhD Program provides students the opportunity to explore the health care needs of underserved and vulnerable populations (especially women, youth, and families) through substantive area and elective coursework.&nbsp; Students may select a focus area for their dissertation within the College priorities of rural health, disease prevention, and health promotion, or an area based on student’s nursing background, interests, and goals.</p>PhD students may pursue an individualized plan of study or concentration in Health Policy (if accepted to the concentration).&nbsp; The student’s advisor and Committee of Studies will guide the student in selecting coursework that will help meet personal, professional, and scholarship needs.&nbsp;",
  "admission_requirements": "&nbsp; &nbsp; &nbsp;&nbsp;Doctoral applicants must meet the UNM criteria for admission to graduate studies (i.e., bachelor’s degree and 3.0 minimum GPA). The College of Nursing also requires doctoral applicants to have a master’s degree in nursing or a related field (must be BSN if master’s degree is not in nursing), and submit a writing sample as part of the application packet. Applicants are evaluated for their potential to meet program goals.<p>Applicants to the doctoral program are considered for summer admission only. All required application materials must be received by the application deadline. These include (but are not limited to) the application, registration form, transcripts, three letters of reference, letter of intent, and writing sample.</p><p>Applicants must have at least a 3.0 GPA at the master’s level (with a 3.5+ GPA preferred) in order to be considered for admission to the doctoral program. A screening committee, comprised of at least two members of the PhD Subcommittee, reviews the application materials and interviews each applicant. Specific screening criteria are used in their evaluation. The screening committee forwards their admission recommendations to the PhD Subcommittee for consideration. The Subcommittee’s recommendation is then forwarded to the Graduate Committee for consideration, with final College approval given by the Associate Dean for Academic Affairs.</p>",
  "transfer_agreements": "",
  "career_opportunities": "<p>Nursing combines science and technology with the desire to help people. Nurses assess patient health problems and needs, develop and implement nursing care plans, and maintain medical records. Administer nursing care to ill, injured, convalescent, or disabled patients. Nurses may advise patients on health maintenance and disease prevention or provide case management. Licensing or registration required. Includes advance practice nurses such as: nurse practitioners, clinical nurse specialists, certified nurse midwives, and certified registered nurse anesthetists. Advanced practice nursing is practiced by RNs who have specialized formal, post-basic education and who function in highly autonomous and varied roles.&nbsp;</p><p>In all states, the District of Columbia, and U.S territories, students must graduate from an approved nursing program and pass a national licensing examination, known as the NCLEX-RN, in order to obtain a nursing license. Nurses may be licensed in more than one State, either by examination or by the endorsement of a licensed issued by another State. Nursing programs range from associate degrees to graduate level programs; higher degrees typically involve a broader and more complex scope of patient care. UNM offers a variety of degree options at the bachelor’s, master’s, and doctoral levels.&nbsp;</p>",
  "contact_information": "<i><b>Jeri Belsher:</b></i>\n<b>Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052724223\">(505) 272-4223</a><br>\n<a target=\"_parent\" href=\"mailto:jbelsher@salud.unm.edu\">jbelsher@salud.unm.edu</a><br><br>",
  "online": "fully online",
  "keywords": null,
  "moratorium": null
}