{
  "name": "Nursing Practice",
  "degree": "DNP",
  "program_description": "<p>The College of Nursing offers the Doctor of Nursing Practice. Graduates of D.N.P. programs are experts in designing, implementing, managing, and evaluating clinical care and health care delivery systems and are prepared to lead at the highest clinical executive ranks. This program’s focus is on the care of vulnerable, rural, and underserved populations.</p><p>Graduates of the D.N.P. program will be able to:</p><ol><li>Critically examine research and scholarship to support evidence-based clinical practice.</li><li>Design and implement processes to evaluate outcomes and systems for health care delivery.</li><li>Influence health policy at institutional, local, state, and national levels.</li><li>Provide leadership and management of transdisciplinary team performance and outcomes in clinical patient care units and health systems.</li><li>Develop interdisciplinary standards.</li><li>Formulate strategies to maximize health in patient populations and to resolve health care dilemmas.</li><li>Reduce health care delivery disparities.</li></ol><p>\n<b>The Doctor of\nNursing Practice (DNP)</b>\ndoctoral degree is designed for individuals in senior leadership\nroles who seek to lead complex clinical systems. The Nurse Executive\nOrganizational Leadership (NEOL) concentration provides a curriculum\nthat leads to a DNP for students who enter the program with a BSN and\na Master’s Degree in a related field (MBA, MPH, PHA, MSA) or an\nMSN. Graduates of the NEOL concentration will be experts in\ndesigning, implementing, managing, and evaluating clinical care and\nhealth care delivery systems and will be&nbsp;prepared to lead at the\nhighest clinical executive ranks.</p>\n<p>\nThe NEOL\nconcentration has the following requirements:</p>\n<table>\n\t\n\t\n\t\n\t<tbody><tr>\n\t\t<td>\n\t\t\t<p>NURS 620</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p>Advanced\n\t\t\tHealth Care Statistics I</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p>3</p>\n\t\t</td>\n\t</tr>\n\t<tr>\n\t\t<td>\n\t\t\t<p>NURS 702</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p>Applied\n\t\t\tEpidemiology in Advanced Nursing Practice</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p>3</p>\n\t\t</td>\n\t</tr>\n\t<tr>\n\t\t<td>\n\t\t\t<p>NURS 703</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p>Applied\n\t\t\tClinical Research in Advanced Nursing Practice</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p>3</p>\n\t\t</td>\n\t</tr>\n\t<tr>\n\t\t<td>\n\t\t\t<p>NURS 705</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p>The\n\t\t\tBusiness and Policy of Practice &amp; Their Influence on the U.S.\n\t\t\tHealth Care System</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p>3</p>\n\t\t</td>\n\t</tr>\n\t<tr>\n\t\t<td>\n\t\t\t<p>NURS 706</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p>Organizational\n\t\t\tSystems and Quality Management for Advanced Nursing Practice</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p>3</p>\n\t\t</td>\n\t</tr>\n\t<tr>\n\t\t<td>\n\t\t\t<p>NURS 725</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p>Principles of\n\t\t\tAdvanced Nursing Management</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p>3</p>\n\t\t</td>\n\t</tr>\n\t<tr>\n\t\t<td>\n\t\t\t<p>NURS 726</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p>Leading\n\t\t\tOrganizational Change</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p>3</p>\n\t\t</td>\n\t</tr>\n\t<tr>\n\t\t<td>\n\t\t\t<p>NURS 727</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p>Health Care\n\t\t\tInnovations and Informatics</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p>3</p>\n\t\t</td>\n\t</tr>\n\t<tr>\n\t\t<td>\n\t\t\t<p>NURS 795</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p>Advanced\n\t\t\tNursing Practice Residency</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p>3</p>\n\t\t</td>\n\t</tr>\n\t<tr>\n\t\t<td>\n\t\t\t<p>NURS 796</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p>D.N.P.\n\t\t\tCapstone Seminar</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p>1</p>\n\t\t</td>\n\t</tr>\n\t<tr>\n\t\t<td>\n\t\t\t<p>NURS 797</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p>D.N.P.\n\t\t\tCapstone Project</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p>5-6</p>\n\t\t</td>\n\t</tr>\n\t<tr>\n\t\t<td>\n\t\t\t<p><br>\n\t\t\t</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p>Elective</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p>3</p>\n\t\t</td>\n\t</tr>\n\t<tr>\n\t\t<td>\n\t\t\t<p><br>\n\t\t\t</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p><b>Total\n\t\t\tCredits for NEOL Concentration</b></p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p><b>36-37</b></p>\n\t\t</td>\n\t</tr>\n\t<tr>\n\t\t<td>\n\t\t\t<p><br>\n\t\t\t</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p><b>550-700\n\t\t\tClinical/Practice Hours*</b></p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p><br></p></td></tr></tbody></table><p>*&nbsp;This\nreflects clinical hours earned in D.N.P. program; student’s total\nclinical hours dependent on prior Master's clinical/practice hours.</p><p></p>",
  "admission_requirements": "<ol><li>Master’s degree (M.S.N.) or equivalent (as defined by specific concentrations) from an accredited nursing program (National League for Nursing Accrediting Commission or the Commission on Collegiate Nursing Education [CCNE] through the American Association of Colleges of Nursing are acceptable).</li><li>Completed UNM application.</li><li>Grade point average: It is desirable to have a master’s grade point average of 3.5 or higher on a 4.0 scale. However, all grade point averages higher than 3.0 will be given consideration.</li><li>Unencumbered RN license to practice in New Mexico.</li><li>A signed statement attesting to basic competency in such computer-based skills as word processing, e-mail, and web-based searching, as well as maintenance of access to the Internet, must accompany the application. The form&nbsp;can be found on the&nbsp;College of Nursing Web site.</li><li>Submission of evidence of clinical outcome measurements, scholarly ability, and the potential for clinical and scholarly growth. Examples include, but are not limited to: thesis, published or unpublished scholarly paper, process and quality improvement projects, or creative work.</li><li>A one-page statement from the individual reflecting experience in the discipline of nursing and outlining particular experiences with underserved or vulnerable populations.</li><li>A letter of intent that addresses individual professional and personal goals.</li><li>Brief two- to three-page resume that summarizes the applicant’s background.</li><li>Three letters of recommendation directly from persons who know the applicant professionally.</li><li>After initial screening, a select group of priority candidates will be interviewed by two faculty members, with the option for a phone interview for those unable to come to campus.</li><li>Exceptions to any program admission criterion will be considered on an individual basis and are at the discretion of the D.N.P. program committee with recommendation to the Executive Dean.</li></ol><p></p><p></p>",
  "transfer_agreements": "",
  "career_opportunities": "<p>Nursing combines science and technology with the desire to help people. Nurses assess patient health problems and needs, develop and implement nursing care plans, and maintain medical records. Administer nursing care to ill, injured, convalescent, or disabled patients. Nurses may advise patients on health maintenance and disease prevention or provide case management. Licensing or registration required. Includes advance practice nurses such as: nurse practitioners, clinical nurse specialists, certified nurse midwives, and certified registered nurse anesthetists. Advanced practice nursing is practiced by RNs who have specialized formal, post-basic education and who function in highly autonomous and varied roles.&nbsp;</p><p>In all states, the District of Columbia, and U.S territories, students must graduate from an approved nursing program and pass a national licensing examination, known as the NCLEX-RN, in order to obtain a nursing license. Nurses may be licensed in more than one State, either by examination or by the endorsement of a licensed issued by another State. Nursing programs range from associate degrees to graduate level programs; higher degrees typically involve a broader and more complex scope of patient care. UNM offers a variety of degree options at the bachelor’s, master’s, and doctoral levels.&nbsp;</p>",
  "contact_information": "<i><b>Jeri Belsher:</b></i>\n<b>Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052724223\">(505) 272-4223</a><br>\n<a target=\"_parent\" href=\"mailto:jbelsher@salud.unm.edu\">jbelsher@salud.unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}