{
  "name": "Nutrition",
  "degree": "MS",
  "program_description": "The Master of Science in Nutrition is designed to prepare students for careers in the field of Nutrition and Dietetics, including opportunities in management, clinical dietetics, community nutrition, and research. Students will gain advanced training in nutrition science and clinical decision making, as well as enhanced skills in designing and interpreting research studies. &nbsp;It is desirable that the student has an undergraduate major in nutrition/dietetics or a closely related field. Students without prior preparation in nutrition should contact a Nutrition Graduate Advisor for more information. Our phone number is (505)-277-4535.&nbsp;",
  "admission_requirements": "&nbsp;Admission to the Master of Science in Nutrition Program is competitive. We consider a variety of&nbsp;criteria in making admissions decisions, including your academic record, standardized test scores,&nbsp;recommendation letters, dedication to the pursuit of additional training and skills in nutrition and&nbsp;potential for productive graduate study and research.&nbsp;You must have, at minimum:• A bachelor’s degree from an accredited college or university in the United States or its&nbsp;equivalent in another country. As stated above, an undergraduate major in nutrition/dietetics&nbsp;or a closely related field is desirable.• A cumulative grade point average of at least 3.0 (B) or its equivalent from your last two&nbsp;undergraduate years (upper division courses) and in your major field.In addition, we recommend that you meet the following GRE score criteria in preparation for&nbsp;graduate study:New scoring system (tests taken on or after August 1, 2011)• Verbal Reasoning: 145 (~25thpercentile)• Quantitative Reasoning: 145 (~25thpercentile)• Analytical Writing: 3.5 (~30thpercentile)Old scoring system (tests taken before August 1, 2011)• Verbal Reasoning: 380 (~25thpercentile)• Quantitative Reasoning: 530 (~25thpercentile)• Analytical Writing: 3.5 (~30thpercentile)",
  "transfer_agreements": "",
  "career_opportunities": "<p>Plan and conduct food service or nutritional programs to assist in the promotion of health and control of disease. Dietetics\nmay supervise the activities of a department providing quantity food services, counseling individuals, or conducting\nnutritional research. They help to prevent and treat illnesses by promoting healthy eating habits and recommending dietary\nmodifications. Major areas of practice include clinical, community, management, and consultant dietetics. &nbsp;Dietitians and nutritionists need at least a bachelor’s degree. Students interested in research, advanced clinical positions,\nor public health may need an advanced degree.&nbsp;</p>",
  "contact_information": "<i><b>Carole Conn:</b></i>\n<b>Program Coordinator</b><br>\n<a target=\"_parent\" href=\"tel:5052778185\">(505) 277-8185</a><br>\n<a target=\"_parent\" href=\"mailto:cconn@unm.edu\">cconn@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}