{
  "name": "Nutrition and Dietetics",
  "degree": "BS",
  "program_description": "The bachelor of science in nutrition and dietetics (Didactic Program in Dietetics) at the University of New Mexico is accredited by the Accreditation Council for Education in Nutrition and Dietetics (ACEND) of the Academy of Nutrition and Dietetics (AND), 120 South Riverside Plaza, Chicago, IL 60606-6995, 312-899-0040 Ext 5400. The curriculum leading to a bachelor of science in nutrition and dietetics is designed to provide students with the academic course work necessary to meet undergraduate requirements established by the ACEND/AND.&nbsp;",
  "admission_requirements": "&nbsp;Following graduation, students will need additional training via a dietetic internship to become eligible for status as a registered dietitian. Contact the program office for information on the UNM Dietetic Internship. In order to be competitive for a dietetic internship, it is recommended that undergraduate students maintain a minimum GPA of 3.4 and have work experience in an area related to nutrition and dietetics.",
  "transfer_agreements": "",
  "career_opportunities": "<p>&nbsp;Plan and conduct food service or nutritional programs to assist in the promotion of health and control of disease. Dietetics may supervise the activities of a department providing quantity food services, counseling individuals, or conducting nutritional research. They help to prevent and treat illnesses by promoting healthy eating habits and recommending dietary modifications. Major areas of practice include clinical, community, management, and consultant dietetics. &nbsp;Dietitians and nutritionists need at least a bachelor’s degree. Students interested in research, advanced&nbsp;clinical&nbsp;positions, or public health may need an advanced degree.&nbsp;</p>",
  "contact_information": "<i><b>Carole Conn:</b></i>\n<b>Program Coordinator</b><br>\n<a target=\"_parent\" href=\"tel:5052778185\">(505) 277-8185</a><br>\n<a target=\"_parent\" href=\"mailto:cconn@unm.edu\">cconn@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}