{
  "name": "Peace and Justice Studies",
  "degree": "Certificate",
  "program_description": "<p>The Peace Studies and Justice Certificate Program offers all UNM undergraduate and non-degree students the opportunity to both study and promote peace and justice issues through interpersonal, institutional, societal and/or global terms.&nbsp; The certificate is a component of the UNM Peace Studies Program, administered through the College of Arts &amp; Sciences, which also offers an interdisciplinary undergraduate minor degree in Peace Studies for students enrolled in the College of Arts &amp; Sciences. While the 24 credit hour minor is available to Arts and Sciences majors, the 15 credit hour certificate program has a broader reach. The Peace and Justice Studies Certificate Program welcomes students from all undergraduate academic departments at UNM, including those administered within University College, the College of Education, and the College of Engineering.</p><p>Certificate recipients must earn 15 credit hours, encompassing&nbsp;3 internship credit hours and 12 elective credit hours. The internship component entails a service learning experience with a community peace and justice organization, such the Albuquerque Center for Peace and Justice, Catholic Charities, Health Care for the Homeless, Cuidando los Niños, the Women’s Community Association and Enlace Comunitario to name just a few of the possibilities. To fulfill the classroom component, students select four 3 credit hour&nbsp;courses from the current required/elective courses offered under the auspices of the Peace Studies minor, and under the guidance of the Peace Studies Advisor.</p><p>The comprehensive list of Peace Studies electives currently being offered by various departments in the College of Arts&nbsp;and Sciences are listed in the catalog under the entry for the Peace Studies Minor requirements. Electives are divided into four substantive categories, comprising the theoretical, methodological, regional/national and international facets of peace and justice studies, respectively. Certificate candidates may select their electives freely, in consultation with the Peace Studies Advisor. Some students may wish to concentrate their electives in one or more category, and others elect to take one from each of the four.&nbsp; Please note that not all classes are offered every semester, course numbers/content can change, there are numerous acceptable classes.</p><p>The essence of the Peace and Justice Studies Certificate program is two fold. First, it involves a critical thinking exploration of the causes and consequences of various forms of violence, as well as peaceful alternatives to violence. Second, it encourages students to understand peace as a multi-faceted vision for transformed human relations, which requires implementation on numerous levels and over the long-term. Peace Studies Certificate candidates are encouraged to explore the many dimensions of conflict transformation,&nbsp;including disarmament, sociopluralism, respect for human rights, international peacekeeping, environmental protection and sustainable resource development, and the promotion of \"Positive Peace\" models of life culture that are designed to deal with the physical and structural violence so prevalent today in&nbsp;homes and on the&nbsp;plane.</p>",
  "admission_requirements": "",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Desi Brown:</b></i>\n<b>Student Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052560668\">(505) 256-0668</a><br>\n<a target=\"_parent\" href=\"mailto:\tunmpeacestudies@gmail.com\">unmpeacestudies@gmail.com</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}