{
  "name": "Pharmacy",
  "degree": "PharmD",
  "program_description": "The Doctor of Pharmacy (Pharm.D.) program consists of a 3-4 professional plan. The first three years of pre-pharmacy courses may be completed at the University of New Mexico or at any two- or four-year college. Equivalent courses taken at these schools will transfer as part of the pre-pharmacy program. Verify equivalencies with the UNM College of Pharmacy advisement office. <br>",
  "admission_requirements": "&nbsp;<p>The College of Pharmacy selects students based on pre-pharmacy academic performance, Pharmacy College Admission Test (PCAT) scores, personal interviews, written applications, and letters of recommendation.&nbsp; Deadline for applications for fall 2014 admissions cycle is January 6, 2014.</p><p><b>1.&nbsp; Successful completion of all required professional coursework (<a href=\"http://hsc.unm.edu/pharmacy/prereqs.shtml\">Prerequisites</a>)</b></p><p><b>2.&nbsp; Grade Point Average (GPA)</b></p><p>Students must have a GPA of 2.5 or higher on a 4.0 scale for all required courses.&nbsp; Our average incoming prerequisite CPA for Fall 2012 was a 3.43.</p><p><b>3.&nbsp; Pharmacy College Admission Test (PCAT)</b></p><p>Applicants are required to submit official scores from the PCAT.&nbsp; A national standardized examination, the PCAT is designed to measure verbal ability, quantitative ability, reading comprehension, and knowledge of biology and chemistry.&nbsp; Our average PCAT composite for fall 2012 was a 54th percentile.&nbsp; A minimum PCAT score of a 30th percentile composite is recommended.</p><p>The half-day test is offered in July, September, and January at locations throughout the United States and Canada.</p><p>You may register online at&nbsp;<a target=\"_blank\" href=\"http://www.pcatweb.info/\">www.pcatweb.info</a>&nbsp;or call 1.800.622.3231 for a brochure.&nbsp; You may also forward a written request to:</p><p>Pharmacy College Admission Test<br>The Psychological Corporation<br>555 Academic Court<br>San Antonio, Texas&nbsp; 78204</p><p><b>4.&nbsp; PharmCAS</b></p><p>Applications must be submitted using the PharmCAS online application service.&nbsp; More information on this process can be found under the \"<a href=\"http://hsc.unm.edu/pharmacy/howtoapply.shtml\">How to Apply</a>\" page of our website.</p><p><b>5.&nbsp;&nbsp;Time Limit for&nbsp;Biology and Chemistry&nbsp;Lecture Courses (7-year rule)</b></p><p>All Biology and Chemistry lecture courses must be completed within 7 years from matriculation into the program.&nbsp; For fall 2013, Biology and Chemistry lecture courses must be completed in fall 2006 or later.</p>&nbsp;<p><b>6.&nbsp; Prerequisite Completion</b></p><p>All Biology, Chemistry and Physics lecture courses must be completed by the end of the spring semester for fall matriculation (For fall 2014, all Biology, Chemistry and Physics lecture courses must be completed by spring 2014).&nbsp; All other prerequisites must be completed by the end of summer for fall matriculation (For fall 2014 admissions, all other prerequisites must be completed by summer 2014). <br></p>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Dianne Perea :</b></i>\n<b>Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:%5052722960\"> (505) 272-2960</a><br>\n<a target=\"_parent\" href=\"mailto:dperea@salud.unm.edu\">dperea@salud.unm.edu </a><br><br><br><i><b>Nicole Bingham :</b></i>\n<b>Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel: 5052724992\"> (505) 272-4992</a><br>\n<a target=\"_parent\" href=\"mailto:nicluna@salud.unm.edu \">nicluna@salud.unm.edu </a><br><br>",
  "online": "partial",
  "keywords": "Health Healthcare",
  "moratorium": null
}