{
  "name": "Physical Therapy",
  "degree": "PhD",
  "program_description": "<p>\n\tOur Physical \n\tTherapy Program is located within the School of Medicine at the University \n\tof New Mexico (UNM) Health Sciences Center, which is the largest academic \n\thealth complex in the state of New Mexico. As a long-standing component of \n\tthe UNM Health Sciences Center, the Physical Therapy Program is committed to \n\toffering an educational experience that provides the academic and clinical \n\topportunities for individuals to develop the knowledge, skills and attitudes \n\tnecessary for the ethical and professionally competent practice of physical \n\ttherapy.&nbsp; Our program prepares students to function as autonomous \n\tprofessional practitioners and integral members of a health care team who \n\tare responsive to the health care needs of the individual and society \n\tat-large.&nbsp; The aim of the program is to foster an attitude of responsibility \n\tand conduct that is consistent with the ethical and legal standards within \n\tthe profession.&nbsp; Inherent in this mission is the goal of educating leaders \n\tin physical therapy who are proficient in the areas of education, research, \n\tsupervision, management, consultation, promotion of health, prevention of \n\tdysfunction and provision of care, in order to meet the needs of the \n\tcitizens of New Mexico and the world.&nbsp;&nbsp;&nbsp; </p>\n\t\n\t\n\t<p>\n\tThe UNM \n\tPhysical Therapy Program is accredited by the Commission on Accreditation in \n\tPhysical Therapy Education (CAPTE), and our program has continually \n\tgraduated excellent physical therapists since the first Physical Therapy \n\tClass of 1976.&nbsp;&nbsp; Currently our program consists of a three year curriculum \n\tof professional course work and clinical training which leads to a clinical \n\tDoctor of Physical Therapy (DPT) degree.&nbsp;&nbsp;</p>\n\t<p>\n\tOur entry \n\tlevel DPT curriculum is 36 months in length, with classes beginning in \n\tAugust each year.&nbsp; Didactic content is presented in a uniquely integrated \n\tformat.&nbsp; The first year coursework emphasizes anatomy, orthopedics and \n\tevidence-based practice, and includes an 8-week orthopedic physical therapy \n\tclinical education component.&nbsp; The second year focuses on various specialty \n\tareas such as neurological and cardiopulmonary disorders, pediatrics, \n\tgerontology, health promotion, and advanced manual skills.&nbsp; In addition to \n\tdidactic coursework in other specialty areas, the third year culminates in \n\tthree final full-time clinical education rotations over a 28-week period.&nbsp; \n\tHospital and health care facilities throughout New Mexico, including rural \n\thealth sites, and a limited number of facilities outside the state are \n\tutilized in the edifying clinical education experiences.&nbsp; Prior to \n\tgraduation, students also successfully complete and present an \n\tevidence-based capstone project under the supervision of a faculty member.&nbsp; \n\tPersonal attention is optimal for students in our program, since the class \n\tsize of 30 is substantially smaller compared to a number of other programs.\n\t</p>\n\t<p>\n\tAll of the \n\tfaculty members in the UNM Physical Therapy Program are committed to helping \n\tstudents achieve their goals of becoming excellent physical therapists.&nbsp; \n\tThere are 10 full-time core faculty members who have a wide variety of \n\texpertise in all areas of physical therapy. Many of the faculty have been \n\tphysical therapists for more than 20 years and have extensive clinical as \n\twell as academic experience.&nbsp; Core faculty are engaged in diverse areas of \n\tresearch and clinical practice, and there are also numerous adjunct faculty \n\tengaged in the educational mission. </p>",
  "admission_requirements": "<p><b>\n\tThe application deadlines are in \n\tDecember of each year, on December 1st for the PTCAS, and on December 15th \n\tfor the UNM Physical Therapy Program Application. \n\t<br>\n\t&nbsp;</b></p>\n\t<p>\n\tStudents are \n\tadmitted once a year, with classes beginning in August. As part of the \n\tadmissions process, the UNM Physical Therapy Program utilizes the Physical \n\tTherapist Centralized Application Service (PTCAS). Prospective students must \n\tcomplete an online application to the PTCAS AND submit an application to the \n\tUNM PT Program. To begin the PTCAS application process, visit the PTCAS \n\twebsite at\n\t<a href=\"http://www.ptcas.org\">\n\twww.ptcas.org</a>. The UNM Application can \n\tbe downloaded by clicking here: Program\n\t<a href=\"http://hsc.unm.edu/som/physther/docs/DPT%20Program%20Application.doc\">\n\tApplication and GPA Calculation Form </a>. \n\tThere are two required parts to the application process.<br>\n\t&nbsp;</p>\n\t<p>\n\tPart I. For \n\tthe PTCAS: Applicants must complete the PTCAS application by December 1st, \n\tand submit required documentation by the PTCAS deadlines, including:<br>\n\t1) Complete Online Application\n\t<a href=\"http://www.ptcas.org/NewMexico.html\">\n\thttp://www.ptcas.org/NewMexico.html</a>&nbsp; <br>\n\t2) Official Transcripts from all Colleges and Universities Attended<br>\n\t3) Three Reference Letters (2 Must be From a Licensed Physical Therapist)<br>\n\t4) Application Fee (Financial Assistance is available for eligible \n\tapplicants through the PTCAS)<br>\n\t&nbsp;</p>\n\t\n\tPart II. For \n\tthe UNM Physical Therapy (PT) Program: Applicants must have the following \n\tmaterials received by the UNM Physical Therapy Program by December 15th.<br>\n\t1) Application for the UNM Physical Therapy Program AND Prerequisite Course \n\tGrid&nbsp;&nbsp;with GPA Calculation Form<br>\n\t2) Official Transcripts from all Colleges and Universities Attended<br>\n\t3) Evidence of Registration for Remaining Prerequisite Course Work (If \n\tApplicable)<br>\n\t4) GRE Exam Scores (official record) <br>\n\t5) Application Fee of $50.00 (Money Order or Personal Check)<br><br>\"Submit your official GRE scores to code #<b>7670 </b>for the Physical \n\tTherapy Program at University of New Mexico.<br>\n\tGRE scores for code #<b>7670</b> will automatically be sent to PTCAS. <b>Do \n\tNOT</b> send your GRE scores to the main university<br>\n\tor graduate admissions code.<br><br><p><b><u>\n\tPlease send \n\tUNM PT Program application packet to the following address:</u></b><br>\n\t<br>\n\tHealth \n\tSciences Center<br>\n\tPhysical Therapy Program <br>\n\tMSC 09 5230 <br>\n\t1 University of New Mexico <br>\n\tAlbuquerque, NM 87131-0001<br></p><p><b><u>\n\tStudents may \n\tsubmit an application packet to the UNM PT Program only if they have:</u></b>\n\t</p>\n\t<ul><li>\n\t\t\n\t\tA degree at the bachelor’s level, or will have completed \n\t\tthe bachelor’s degree by the end of the spring semester after \n\t\tapplication.</li><li>\n\t\t\n\t\tFulfilled the prerequisite course work or will have \n\t\tcompleted the prerequisite course work by the end of the spring semester \n\t\tafter application. </li><li>\n\t\t\n\t\tTaken the General Graduate Record Examination (GRE) that \n\t\tincludes the GRE Written Assessment.</li><li>\n\t\t\n\t\tMet the minimum grade requirements of 3.0 GPA.</li></ul><p><b><u>\n\tOther notes \n\tabout admission:</u></b></p>\n\t<p>\n\tApplicants \n\tcan be certified by the Western Interstate Commission for Higher Education. \n\tResidents of Hawaii, Nevada, Oregon and Wyoming are eligible to apply to our \n\tprogram under WICHE. For more information on WICHE, please call \n\t1-800-279-9777 or visit their\n\t<a href=\"http://www.wiche.edu/\">\n\twebsite</a> at\n\t<a href=\"http://www.wiche.edu\">\n\twww.wiche.edu</a>. &nbsp; Although the majority \n\tof our students are residents of New Mexico, residents of other states are \n\tinvited to apply.</p>\n\t<p>\n\tApplicants \n\twho appear to be best qualified will be invited for an interview. &nbsp;Final \n\tselection will be made from the group of candidates interviewed, and will be \n\tbased on science GPA, GRE scores, written materials including letters of \n\treference, and interview. It is recommended that applicants have adequate \n\texposure to the profession of physical therapy through volunteer or work \n\texperience.</p>\n\t<p>\n\tReapplicants \n\tto our program must submit a <b>new</b> UNM PT Application form <b>each time\n\t</b>they apply to our program, and they must also provide updated \n\ttranscripts and official GRE forms as appropriate.</p>\n\t<p>\n\tThe program's \n\tselection process does not discriminate against any student on the basis of \n\tgender, marital or parental status, race, color, religion, age, national \n\torigin or physical handicap.</p><p></p><br><p><b><u>\n\tStudents with \n\tdisabilities:</u></b></p>\n\t<p>\n\tIf you have a \n\tphysical or learning disability, you are asked to self-report your \n\teducational needs prior to matriculation. Technical Standards for physical \n\ttherapy students are defined by the program and are available upon request. \n\tEvaluation of the disability by a physician or other appropriate \n\tprofessional must be presented at the time of the report in order for \n\taccommodations to be arranged. </p>\n\t<p>\n\tInformation \n\tabout general student services at UNM, including admissions and NM residency \n\tcriteria, can be obtained by calling 1-800 CALL UNM (225-5866), or calling \n\tFinancial Aid at (505) 272-0008, or accessing the\n\t<a href=\"http://www.unm.edu/studentinfo.html\">\n\tUNM Current Student Page</a>.<br></p><p><b><u>\n\tPreparation \n\tfor admission:</u></b></p>\n\t<p><b>\n\t# 1 Volunteer \n\tExperience: </b>\n\tAlthough the \n\tprogram does not require a specific number of hours, most applicants have a \n\tminimum of 200 volunteer hours when they apply to the program. The program \n\trecommends that you get as much exposure to the PT profession (whether from \n\tvolunteer or work opportunities) as you can via a variety of experiences in \n\tdifferent areas of PT, so that you can positively answer the question “Is PT \n\tthe profession for me?”&nbsp; &nbsp;</p>\n\t<p><b>\n\t# 2 \n\tPrerequisites:</b> \n\tAdmission to our program requires completion of prerequisite courses with 35 \n\thours of specific sciences and a minimum GPA of 3.0 in the prerequisites.&nbsp; \n\tStudents must include proof of enrollment for any Spring courses with the \n\tapplication, and all prerequisite courses must be completed by May with a \n\tgrade of C or better.&nbsp; Final transcripts must be sent to the UNM Physical \n\tTherapy Program.&nbsp; Prerequisite courses may be taken at any accredited \n\tcollege or university.&nbsp; The following is a list of the general \n\tprerequisites, as well as specific course numbers appropriate for fulfilling \n\tthese prerequisites at UNM and at<b> </b>Central New Mexico Community \n\tCollege (CNM).</p>\n\t<p>\n\t\n\t&nbsp;</p>\n\t<table>\n\t\t<tbody><tr>\n\t\t\t<td>\n\t\t\t<p><b><u>\n\t\t\t\n\t\t\tGeneral Prerequisite</u></b></p></td>\n\t\t\t<td>\n\t\t\t<p><b><u>\n\t\t\t\n\t\t\tUNM course</u></b></p></td>\n\t\t\t<td>\n\t\t\t<p><b><u>\n\t\t\t\n\t\t\tCNM course</u></b></p></td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>\n\t\t\t<p><b>\n\t\t\t\n\t\t\tExercise Physiology </b></p>\n\t\t\t<p><b>\n\t\t\t\n\t\t\t300-level or above (3 hrs)</b></p></td>\n\t\t\t<td>\n\t\t\t<p>\n\t\t\t\n\t\t\tExercise Physiology PEP 326L</p></td>\n\t\t\t<td>\n\t\t\t<p>\n\t\t\t\n\t\t\t&nbsp;</p></td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>\n\t\t\t<p><b>\n\t\t\t\n\t\t\tAnatomy &amp; Physiology </b></p>\n\t\t\t<p><b>\n\t\t\t\n\t\t\t(8 hrs) with lab</b></p></td>\n\t\t\t<td>\n\t\t\t<p>\n\t\t\t\n\t\t\tBiology 237 </p>\n\t\t\t<p>\n\t\t\t\n\t\t\tBiology 238 </p>\n\t\t\t<p>\n\t\t\t\n\t\t\tBiology 247L </p>\n\t\t\t<p>\n\t\t\t\n\t\t\tBiology 248L</p></td>\n\t\t\t<td>\n\t\t\t<p>\n\t\t\t\n\t\t\tBiology 2210 </p>\n\t\t\t<p>\n\t\t\t\n\t\t\tBiology 2310 </p>\n\t\t\t<p>\n\t\t\t\n\t\t\tBiology 2292 </p>\n\t\t\t<p>\n\t\t\t\n\t\t\tBiology 2392</p></td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>\n\t\t\t<p><b>\n\t\t\t\n\t\t\tChemistry (4 hrs)</b></p></td>\n\t\t\t<td>\n\t\t\t<p>\n\t\t\t\n\t\t\tChemistry 111</p></td>\n\t\t\t<td>\n\t\t\t<p>\n\t\t\t\n\t\t\tChemistry 1410/1492</p></td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>\n\t\t\t<p><b>\n\t\t\t\n\t\t\tStatistics (3 hrs)</b></p></td>\n\t\t\t<td>\n\t\t\t<p>\n\t\t\t\n\t\t\tMathematics 145</p></td>\n\t\t\t<td>\n\t\t\t<p>\n\t\t\t\n\t\t\tMathematics 1330</p></td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>\n\t\t\t<p><b>\n\t\t\t\n\t\t\tNutrition (3 hrs)</b></p></td>\n\t\t\t<td>\n\t\t\t<p>\n\t\t\t\n\t\t\tNutrition 244</p></td>\n\t\t\t<td>\n\t\t\t<p>\n\t\t\t\n\t\t\tNutrition 2110</p></td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>\n\t\t\t<p><b>\n\t\t\t\n\t\t\tPhysics </b></p>\n\t\t\t<p><b>\n\t\t\t\n\t\t\t(8 hrs) with lab</b></p>\n\t\t\t<p>\n\t\t\t\n\t\t\t&nbsp;</p></td>\n\t\t\t<td>\n\t\t\t<p>\n\t\t\t\n\t\t\tPhysics 151</p>\n\t\t\t<p>\n\t\t\t\n\t\t\tPhysics 152 </p>\n\t\t\t<p>\n\t\t\t\n\t\t\tPhysics 151L </p>\n\t\t\t<p>\n\t\t\t\n\t\t\tPhysics 152L</p></td>\n\t\t\t<td>\n\t\t\t<p>\n\t\t\t\n\t\t\tPhysics 1510 </p>\n\t\t\t<p>\n\t\t\t\n\t\t\tPhysics 1610 </p>\n\t\t\t<p>\n\t\t\t\n\t\t\tPhysics 1592 </p>\n\t\t\t<p>\n\t\t\t\n\t\t\tPhysics 1692</p></td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>\n\t\t\t<p><b>\n\t\t\t\n\t\t\tPsychology (6 hrs) Developmental and/or Abnormal \n\t\t\tPsychology recommended</b></p></td>\n\t\t\t<td>\n\t\t\t<p>\n\t\t\t\n\t\t\tPsychology 105 Psychology 220</p></td>\n\t\t\t<td>\n\t\t\t<p>\n\t\t\t\n\t\t\tPsychology 1105 Psychology 2220</p></td>\n\t\t</tr>\n\t</tbody></table>\n\t<p></p><p>\n\tBecause the science \n\tprerequisites GPA is ranked on a sliding scale (with 4.0 receiving the most \n\tpoints, and 3.0 the fewest), it is to your advantage to have the highest \n\tpossible science GPA. To raise your GPA several options are available:</p>\n\t<p>\n\t1. <b>After having completed</b> \n\tthe prerequisite course with a grade of C or better, you may substitute a \n\tgrade from a higher numbered course with the same classification in your GPA \n\tcalculation.&nbsp; However, because of the direct relevance to physical therapy \n\tpractice, no substitutions are allowed for Anatomy and Physiology.</p>\n\t<p>\n\t2. In all areas except Anatomy \n\tand Physiology, any courses at or above the minimum requirements are \n\tacceptable (E.g., for Statistics, the minimum requirement is Math \n\t145-Statistics, but any higher level statistics class will count). \n\t&nbsp;Recommended Psychology classes include Developmental and/or Abnormal \n\tPsychology.</p>\n\t<p><b>\n\tRemember</b>: \n\tThese are grade substitutions, <b>not</b> course substitutions; you must \n\tcomplete the prerequisite courses <b>first </b>with a grade <b>of C or \n\tbetter</b>.</p>\n\t<p><b>\n\tUNM Physical \n\tTherapy Program Policy on Web-Based Prerequisite Courses</b></p>\n\t<p>\n\t1. In order \n\tfor the University of New Mexico to accept credits earned from a web-based \n\tcourse, that course must appear on a transcript from an accredited college \n\tor university. Applicants are strongly urged to contact the UNM Admissions \n\toffice at (505)277-2447 prior to registering for an on-line course. If UNM \n\taccepts the course as “transfer credit”, the Physical Therapy Program will \n\taccept it also.</p>\n\t<p>\n\t2. Only \n\tcourses in nutrition, exercise physiology, psychology and statistics will \n\tcount as a prerequisite if taken on-line. Courses that feature a lab \n\tcomponent (chemistry, A&amp;P and physics) will not be accepted as a \n\tprerequisite if taken on-line.</p>\n\t<p><b>\n\tNew! Online \n\tCourse - Clinical Exercise Physiology offered by the UNM PT Program</b></p>\n\t<p>\n\tPT 351 \n\tClinical Exercise in Physical Therapy/ CRN # 17851 / 3 credit hours</p>\n\t<p>\n\tThis course \n\taddresses the principles of the physiology of the human body during exercise \n\twith emphasis on the cardiopulmonary and neuromuscular systems. In addition, \n\tthis course addresses an overview of selected pathological conditions of \n\tthese systems relevant to the practice of physical therapy. </p>\n\t<p><b>\n\tPrerequisite</b>: \n\tBy permission of the instructor, Dr. Burke Gurney. Phone (505) 272-6850 or \n\temail\n\t<a href=\"mailto:bgurney@salud.unm.edu\">\n\tbgurney@salud.unm.edu</a></p>\n\t<p>\n\t<br>\n\t<b>#3 Bachelor’s Degree:&nbsp;&nbsp; A</b>dmission to our program requires completion \n\tof a bachelor’s degree (or higher). A degree in any field is acceptable, as \n\tlong as the prerequisite courses are also completed.&nbsp; To apply you must have \n\ta minimum Overall GPA as well as a minimum Science GPA of at least 3.0.</p>\n\t<p><b>\n\t#4 Graduate \n\tRecord Exam (GRE):&nbsp; </b>\n\tAdmission to \n\tour program requires<b> </b>GRE scores on the General test AND the Writing \n\tAssessment.&nbsp; The GRE must be taken within 5 years of application.&nbsp; Relevant \n\twebsites are for the GRE at\n\t<a href=\"http://www.gre.com/\">\n\twww.gre.com</a>, and for Prometric Testing \n\tServices at\n\t<a href=\"http://www.prometric.com/GRE/default.htm\">\n\thttp://www.prometric.com/GRE/default.htm</a></p>\n\t<p><b>\n\tAdmissions \n\tProcedures</b></p>\n\t<p>\n\tIn addition \n\tto the requirements of completing a bachelor’s degree in any field, having \n\tat least a 3.0 GPA overall and in the science prerequisites, and taking the \n\tGREs within 5 years, applicants also write an essay and obtain 3 letters of \n\treference (2 must come from physical therapists).&nbsp; Based on these initial \n\tcriteria, the top qualified applicants will be invited for an interview, \n\tusually held in early March.&nbsp; Following the interview process, up to 30 \n\tstudents are selected for the next UNM DPT class.&nbsp;&nbsp; </p>\n\t<p><b>\n\t\n\tNondiscrimination Policy</b></p>\n\t<p>\n\tThe admission \n\tprocedure in the Physical Therapy Program at the University of New Mexico \n\tdoes not discriminate against any student on the basis of gender, marital or \n\tparental status, race, color, religion, age, national origin or physical \n\thandicap.</p><p></p>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Amy Dunlap:</b></i>\n<b>Program Manager</b><br>\n<a target=\"_parent\" href=\"tel:5052725756\">(505) 272-5756</a><br>\n<a target=\"_parent\" href=\"mailto:ADunlap@salud.unm.edu\">ADunlap@salud.unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}