{
  "name": "Physics",
  "degree": "MS",
  "program_description": "<p>Students in the Department of Physics and Astronomy at the University of New Mexico find themselves immersed in a stimulating atmosphere arising from their exposure to the teaching and research activities of 29 regular faculty members in the Physics and Astronomy as well as in the Optical Science and Engineering Graduate Programs, another several dozen research, adjunct and part-time faculty members, a dozen postdoctoral research associates, and from their interactions with well over 100 undergraduate majors and over 100 graduate students. The atmosphere is enriched by activities of the Center for Quantum Information and Control, the Consortium of the Americas for Interdisciplinary Science, the New Mexico Center for Particle Physics, and the Institute for Astrophysics, which are housed in the department; by the Center for High Technology Materials, in which physicists and engineers are at work on understanding and developing optoelectronic materials and devices with novel properties; and by the collaborative projects the faculty and students in the department carry out with neighboring laboratories such as Sandia National Laboratories, the Los Alamos National Laboratory, the Air Force Research Laboratory, and the National Radio Astronomy Observatory; with local industries, and with institutes, universities and other centers of learning in the USA and elsewhere. Outstanding scientists from all over the world visit the department for periods of a few weeks to as long as a year, while seminars and colloquia feature international experts in their fields each week.</p><p>The research atmosphere is equally active, with work being pursued in astrophysics and astronomy, optics and photonics, condensed matter physics, quantum information, atomic and subatomic physics, biomedical physics, general relativity and statistical physics. The research is funded at a high level by various external agencies such as the National Science Foundation, the Department of Energy, the Department of Defense, the National Institutes of Health, and NASA.</p>",
  "admission_requirements": "&nbsp;<h2>1) Thesis and Non-Thesis Options</h2><h3>Plan I - Thesis Option:</h3><ul><li>The Preliminary Examination is not required for the thesis option.</li><li>At least 24 semester hours of graduate coursework in physics and mathematics are required, together with at least 6 hours of Master's Thesis (Physics 599).</li><li>Defense of a written thesis serves as a final examination.</li></ul><h3>Plan II - Non-Thesis Option:</h3><ul><li>Applicants who achieve a score of 800 or higher on the Physics GRE Subject Test are excused from Preliminary Exams.</li><li>A non-thesis Master's student must pass 2 sections of the&nbsp;<a href=\"http://panda.unm.edu/pandaweb/graduate/prelims/index.phtml\">Preliminary Examination</a>&nbsp;by the fourth sitting after entry into the program and must pass 3 sections by the fifth sitting. The Master's level of passing on each section is a grade of 50%.</li><li>32 semester hours of graduate coursework in physics and mathematics must be taken. At least 4 of the 32 hours must be in graded problems or research courses (Physics 552 or 650). These requirements also apply to those graduate students in the PhD program who are seeking a \"MS 'on the way' to PhD\".</li></ul><h2>2) Core Course Requirements</h2><ul><li>466 Methods of Theoretical Physics I</li><li>503 Classical Mechanics I</li><li>505 Statistical Mechanics and Thermodynamics</li><li>511 Electrodynamics I</li><li>521 Quantum Mechanics I</li></ul><p>A grade of B- or above is required in each core course. A Program of Studies can be submitted to OGS after the student has completed a minimum of 12 hours of graduate courses in graduate status. It must, however, be submitted to OGS by the following deadlines: March 1 for Summer graduation, July 1 for Fall graduation, October 1 for Spring graduation.</p><p>An MS student must maintain progress through the five core courses (466, 503, 505, 511, and 521) at the following minimal rate:</p><table><tbody><tr><td>End of Semester 1</td><td>No requirement</td></tr><tr><td>End of Semester 2</td><td>No requirement</td></tr><tr><td>End of Semester 3</td><td>2 core courses completed</td></tr><tr><td>End of Semester 4</td><td>3 core courses completed</td></tr><tr><td>End of Semester 5</td><td>4 core courses completed</td></tr><tr><td>End of Semester 6</td><td>all 5 core courses completed<br><br></td></tr></tbody></table>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Sally C. Seidel:</b></i>\n<b>Chair, Graduate Committee </b><br>\n<a target=\"_parent\" href=\"tel:5052772087\">(505) 277-2087</a><br>\n<a target=\"_parent\" href=\"mailto:seidel@phys.unm.edu\">seidel@phys.unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}