{
  "name": "Physics and Astrophysics",
  "degree": "BA",
  "program_description": "<p>First year students planning to major or minor in physics or astrophysics, if they have the necessary mathematics, usually take PHYC 160, 160L and MATH 162 in their first semester, and PHYC 161, 161L and MATH 163 in their second semester. There is some flexibility in these prerequisites.</p><p>For admission to any degree program in the department, within the College of Arts and Sciences, in any given semester, it is required that the student have passed&nbsp;PHYC 160, or a more advanced physics course, with a grade of C (not C-) or higher.</p><p>Academic advisement&nbsp;is required&nbsp;<strong>each semester</strong>&nbsp;for students majoring in physics or astrophysics. Students in University College with an area of interest or a definite major in mind in this department should meet with a departmental advisor as soon as possible, to ensure that they obtain current curriculum and admissions policies as well as specific advice on how to meet the requirements for admission.</p><p>Students are not allowed to receive credit for both PHYC 151 and 160, nor for both PHYC 152 and 161.</p><p>The<strong>&nbsp;B.S. degree</strong>&nbsp;is designed as a beginning and foundation for students planning to continue their studies in graduate school and are, therefore, preparatory to professional training in physics or astrophysics.</p><p>The<strong>&nbsp;B.A. degree</strong>&nbsp;is designed for people interested in physics, astrophysics and science in general who are not seeking a career in scientific research. Rather, these students should use the flexibility within the program to choose minors or an additional major in other areas, such as management, education, communications, journalism, economics, history, political science, etc</p><p><strong>B.A. in Physics and Astrophysics:</strong>&nbsp;ASTR 271; PHYC 290; PHYC 330; two courses chosen from PHYC 303, 307L or 405; three additional 3-hour, upper-level courses in Physics or Astronomy, one of which must be in Astronomy, except for any one of the following problems courses: ASTR 455, PHYC 451, 452.<strong><br>Required supportive courses:</strong>&nbsp;MATH 311, 316.</p>&nbsp;",
  "admission_requirements": "&nbsp;<p>A minimum of 26 credit hours; 23 credit hours must be in courses acceptable toward graduation.</p><p>A cumulative grade point average of at least 2.00 on all work.</p><ul><li>Transfer students must have a 2.0 transfer GPA.</li><li>Continuing UNM students must have a 2.00 institutional GPA.</li></ul><p>Demonstrated academic achievement by satisfying the following:</p><ul><li>Completion of the University Speaking and Writing Core.</li><li>Completion of the University Mathematics Core.</li><li>Completion of the University Foreign Language Core.</li></ul><p>Completion of Department of&nbsp;Physics and Astronomy&nbsp;admission coursework with grade of \"C\" or better:</p><ul><li>PHYC 160.</li></ul><h4>Additional Information</h4><p>The basic courses PHYC 160, 160L, 161, 161L, 262, 262L and MATH 162, 163 and 264 are prerequisite to all 300-level and higher physics and astronomy courses, and are required prerequisites for major and minor study in Physics and in Astrophysics for either the B.S. or the B.A. degree. For the B.S. in Astrophysics, ASTR 270, 270L, 271 and 271L are also required.</p><br>",
  "transfer_agreements": "",
  "career_opportunities": "<p>Physicists and astronomers conduct research to understand the nature of the universe and everything in it. These\nresearchers observe, measure, interpret, and develop theories to explain celestial and physical phenomena using\nmathematics. From the vastness of space to the infinitesimal scale of subatomic particles, they study the fundamental\nproperties of the natural world and apply the knowledge gained to design new technologies.&nbsp;</p>",
  "contact_information": "<i><b>Richard Rand:</b></i>\n<b>Professor</b><br>\n<a target=\"_parent\" href=\"tel:5052772073\">(505) 277-2073</a><br>\n<a target=\"_parent\" href=\"mailto:rjr@phys.unm.edu\">rjr@phys.unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}