{
  "name": "Political Science",
  "degree": "PhD",
  "program_description": "<p>Concentrations: American politics, comparative politics, international relations, methodology, and public policy.</p><p>All applicants for admission to the graduate program must take the Graduate Record Examination aptitude test. The Graduate Committee of the department, following policies established by the faculty, makes all decisions on equivalence to the master’s degree.</p><p>The M.A. is offered under both Plan I and Plan II under the regulations described earlier in this catalog. General requirements for completion of the Ph.D. are given on earlier pages of this catalog.</p><p>Work for the M.A. and the Ph.D. is offered in six areas: American politics, comparative politics, international relations, methodology, political theory and public policy. Students will concentrate in one field of specialization at the M.A. level and two fields of specialization at the Ph.D. level. (Early in the second semester of residence, the graduate student chooses a committee on studies that meets with the student to work out a program of study based on his or her background and interests). Each Ph.D. student must demonstrate proficiency in applied research methods. Advancement to candidacy for the Ph.D. follows upon successful completion of comprehensive examinations and a field research paper.</p><p>In addition to the application materials required by the University of New Mexico Office of Graduate Studies, the following items are required for admission to the Department of Political Science: 1) an official report of the student’s Verbal, Quantitative and Analytical Graduate Record Examination scores; 2) a short writing sample illustrating analytical ability and stylistic mastery; and 3) a letter of intent; 4) three letters of recommendation. The GRE scores must be mailed directly to the Political Science Department by Educational Testing Services.</p><p></p>",
  "admission_requirements": "&nbsp;<h4>Doctoral (Ph.D.) Degree Requirements</h4><p>Entrance Requirements: In addition to UNM entrance requirements, the general GRE examination, a writing sample, a letter of intent and three letters of recommendation are required.</p><p>Exit Requirements: In addition to UNM exit requirements, Doctoral students must choose two fields of concentration and complete a minimum of 18-24 post-Master’s hours of course work including POLS 580, 581, 582, 681; three pro-seminars (including one in each of the chosen fields of concentration); one research seminar in the primary field of concentration and one additional course in the secondary field of concentration; and two written comprehensive examinations (one in each of the chosen fields of concentration). All required course work must be completed with a grade of “B” or better, with the exception of 681, and 582 which is offered for Credit/No Credit only.</p><p>Also required are a written and oral presentation of a field research paper; a minimum of 18 hours of dissertation; a dissertation-proposal presentation; a written and oral defense of the final dissertation; and completion of the degree within five years following field paper requirements and advancement to candidacy.</p>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Wendy Hansen:</b></i>\n<b>Professor and Graduate Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052772825\">(505) 277-2825</a><br>\n<a target=\"_parent\" href=\"mailto:wlhansen@unm.edu\">wlhansen@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}