{
  "name": "Policy & Planning",
  "degree": "MBA",
  "program_description": "<p>The Policy &amp; Planning (P&amp;P) concentration is oriented toward cross-functional problem solving and analysis. Careers and employment resulting from the P&amp;P concentration include strategic planning, public sector and nonprofit management, public affairs, policy analysis, environmental affairs, and other cross-functional positions.</p>&nbsp;",
  "admission_requirements": "&nbsp;<ul><li><b>Application Fee</b>: A non-refundable application fee of $50.00 is required and can be paid at the UNM Cashier or by credit or debit card online.&nbsp;<a href=\"https://secure.touchnet.com/C21597_ustores/web/product_detail.jsp?PRODUCTID=2\">Click here to pay the application fee online.</a></li><li><b>Application and Registration</b>: The online application combines the application and registration pages.</li><li><b>Permanent Resident Card</b>: If applicable.</li><li><b>Transcripts - Domestic</b>: You will need to provide one (1) transcript from every institution you attended, whether you graduated or not. It may take your university a few weeks to process transcripts, so be sure to request these early enough to meet the application deadline. Transcripts must arrive enclosed in the original registrar's sealed envelope. Request they be sent to you to be included with your application package. For those colleges or universities that will not send transcripts to students, please use this mailing address:&nbsp;<br><br>Annie Glisson<br>MSC 05 3090<br>1 University of New Mexico<br>Albuquerque, NM 87131-0001&nbsp;<br><br><b>NOTE for UNM transcripts</b>: if you attended UNM provide&nbsp;<b>only</b>&nbsp;an&nbsp;<b>unofficial</b>&nbsp;advisement, or Loboweb transcript. Do not pay for an official UNM transcript.</li><li><b>Transcripts - Foreign, Permanent Resident</b>: Permanent residents with foreign transcripts must provide a transcript evaluation. UNM recommends: Education Credential Evaluators (<a href=\"https://www.ece.org/\">https://www.ece.org</a>), National Association of Credential Evaluation Services (<a href=\"http://www.naces.org/\" target=\"_blank\">http://www.naces.org/</a>), or World Education Services (<a href=\"http://www.wes.org/\" target=\"_blank\">http://www.wes.org/</a>).</li><li><b>Transcripts - Foreign, VISA holder</b>: Applicants on ANY TYPE of visa must complete the UNM International Admission application process. Please continue to the UNM office of International Admissions here:<a href=\"http://www.unm.edu/admissions/guidelines/international.html\" target=\"_blank\">http://www.unm.edu/admissions/guidelines/international.html</a>.</li><li><b>Entrance Exam</b>: We will accept either the GMAT or the GRE. The admissions committee requires a 500 or better on the GMAT or a GRE score that is deemed to be greater than or equivalent to 500 on the GMAT using a conversion tool available at:&nbsp;<a href=\"http://www.ets.org/gre/institutions/about/mba/comparison_tool/\" target=\"_blank\">http://www.ets.org/gre/institutions/about/mba/comparison_tool/</a>. The school designation code is 4845 for either exam. Test scores are valid for five years.</li><li><b>Exam Waivers</b>:<ul><li><b>MBA Waiver</b>: To qualify for the GMAT/GRE waiver you must have a BBA from an AACSB program and a minimum 3.5 GPA in all upper division coursework. In order to be granted the waiver you must attend our writing workshop and must have received a grade of B or better in a calculus course within the last 5 years or complete MGMT 500 in the admission semester. Subsequent semester registration will not be allowed until these two requirements are satisfied.&nbsp;<b>Spring 2015 semester is the last semester this waiver is available.</b>&nbsp;<br><br>Please read the whole MBA Waiver Policy:&nbsp;<a href=\"http://www.mgt.unm.edu/prospectivestudents/2012AACSBwaiver.pdf\" target=\"_blank\">Download MBA Waiver Policy</a>&nbsp;<br><br>GPA Calculator:&nbsp;<a href=\"http://mba.mgt.unm.edu/admissions/gpa-calculator.asp\" target=\"_blank\">http://mba.mgt.unm.edu/admissions/gpa-calculator.asp</a>.</li><li><b>MACCT/Advanced Waiver</b>: To qualify you must have an undergraduate major in accounting from an AACSB accredited school with a minimum of 3.25 GPA in both upper division classes and accounting classes. Calculate your GPA here:&nbsp;<a href=\"http://mba.mgt.unm.edu/admissions/gpa-calculator.asp\" target=\"_blank\">http://mba.mgt.unm.edu/admissions/gpa-calculator.asp</a>.</li><li><b>Earned Degree Waiver</b>: To qualify, you must have a graduate degree with significant quantitative coursework. Graduate degrees that are typically eligible for this waiver are from the field of Engineering. The decision to waive or not waive the GMAT/GRE admission requirement rests entirely with the Entrance &amp; Credits Committee.</li></ul></li><li><b>GPA</b>: A GPA of 3.0 or better is required based on the last 60 hours of coursework. The committee will begin with the most recent course you have taken and go backward 60 hours.</li></ul>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Megan Hearting:</b></i>\n<b>Director, Student Services</b><br>\n<a target=\"_parent\" href=\"tel:5052773290\">(505) 277-3290</a><br>\n<a target=\"_parent\" href=\"mailto:mconner@unm.edu\">mconner@unm.edu</a><br><br>\n<i><b>Nicole Capehart:</b></i>\n<b>Student Success Manager</b><br>\n<a target=\"_parent\" href=\"tel:5052773290\">(505) 277-3290</a><br>\n<a target=\"_parent\" href=\"mailto:ncapehar@unm.edu\">ncapehar@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}