{
  "name": "Portuguese",
  "degree": "MA",
  "program_description": "15 hours in Portuguese at 400-level or above.<br><br>12 hours of Hispanic, Southwest, or Portuguese Literature - and/or –<br>Hispanic, Southwest, or Portuguese Linguistics.<br><br>6 hours of electives or thesis.<br><br>All Portuguese coursework counted toward M.A. credit requirements must be in courses approved by the Department at the PORT 400-level or above.&nbsp; All Spanish coursework counted toward M.A. credit requirements must be in courses approved by the Department at the 500 level or above with the exception of SPAN 423 - Cervantes’ Quijote and SPAN 438 - Mexican Literature. <br>&nbsp;",
  "admission_requirements": "&nbsp;<h1>M.A. in Spanish and Portuguese - University of New Mexico</h1><p>The University of New Mexico offers the M.A. degree in Spanish with three areas of concentration: Hispanic Literature, Hispanic Linguistics, and Hispanic Southwest Studies.&nbsp; UNM offers an M.A. degree in Portuguese as well.&nbsp; Departmental financial assistance in the form of teaching assistantships are available for the most highly qualified candidates.&nbsp; Teaching Assistants in the M.A. program are normally guaranteed four semesters of support, as long as they remain in good academic standing.&nbsp; A small number of summer teaching assistantships are available on a competitive basis.</p><h2>Prerequisites / Application Process</h2><ul><li>All applicants need to complete an application either on-line or on paper.&nbsp; An official transcript, the application fee, along with the application should be sent to the Office of Admissions at The University of New Mexico.&nbsp;</li><li>International students should contact the&nbsp;<a href=\"http://geo.unm.edu/admission.html\">Office of International Admissions</a>&nbsp;for a list of required material and deadlines.&nbsp;</li><li>Copies of materials sent to the Office of Admissions and all material required by the department should be sent to the Department of Spanish and Portuguese.</li><li>The deadline for application for regular admission is: July 30 for Fall; November 30 for Spring; May 30 for Summer.</li><li>Financial assistance is awarded for Fall only with an application deadline of January 15 for first consideration.&nbsp;</li><li>All application materials can be found on the web at&nbsp;<a href=\"http://admissions.unm.edu/\">http://admissions.unm.edu/</a></li></ul><h2>Acceptance into the M.A. program is based on an evaluation of the following items:</h2><ol><li>A narrative statement of intent following the departmental guidelines.</li><li>An official transcript of all academic work to be sent directly to the Office of Admissions.</li><li>Students seeking admission to the program who do not have a B.A. major in Spanish or Portuguese must<br>present an equivalent, i.e. 24 hours of advanced courses such as Spanish Phonetics, Advanced Grammar,<br>and surveys of Latin American and Peninsular literature, or the equivalent in Portuguese.</li><li>Candidate must fill out a Departmental Application which is available on the department web site.&nbsp;</li><li>Spanish candidates must submit the versant language Proficiency exam at&nbsp;<a href=\"http://www.pearsonhighered.com/versant/\">http://www.pearsonhighered.com/versant/</a><br>Portuguese candidates seeking a Teaching Assistantship must submit a 5-10 minute Compact Disc<br>(playable on a standard CD player).&nbsp; The CD will be in Portuguese.&nbsp; Native Speakers of languages other<br>than English must also provide a recorded statement in English of equal length.</li><li>Native speakers of languages other than English who graduate from non-U.S. universities must<br>successfully pass the TOEFL test (See International Admission’s website for passing scores).</li><li>Applicants must provide three letters of reference, preferably from professors or others who are familiar<br>with their academic qualifications.&nbsp; Recommendations must be provided on University of New Mexico&nbsp;&nbsp;<br>recommendation forms included with the application packet or available at<br><a href=\"http://ogs.unm.edu/resources/ogs-forms/documents/Recommend.pdf\">http://ogs.unm.edu/resources/ogs-forms/documents/Recommend.pdf</a>&nbsp;with additional informational<br>support on the departmental stationery of the person recommending the applicant.&nbsp; Letters should be<br>placed in a sealed envelope and signed across the seal by the recommender.&nbsp; They may be sent directly<br>to the Spanish and Portuguese department or included with other application materials.</li></ol><h2>The Statement of Intent by Applicants to M.A.</h2><p>All applicants to the M.A. program in Spanish or Portuguese and Ph.D. programs in Spanish and Portuguese must submit a narrative statement of intent.&nbsp; This document is one of the most important components of the application and should be prepared thoughtfully.&nbsp; It may be written in English, Spanish or Portuguese.</p><h2>M.A. Applicants</h2><p>For applicants to the M.A. program, the statement should include a description of their undergraduate studies in Spanish and/or Portuguese and related areas, any additional experiences which bear on their qualifications or interest in graduate studies, and a clear indication of the reasons for pursuing a graduate degree.&nbsp; Applicants should describe their specific interests within the programs offered by the Department of Spanish and Portuguese, and should indicate why they have chosen the University of New Mexico.&nbsp; In addition, applicants should outline their future career plans in as much detail as possible.&nbsp; Simply stating “I have always enjoyed Spanish,” “I want to learn more about Spanish/improve my abilities,” or “Portuguese is my native language” is not adequate.&nbsp; The M.A. is a professional degree, and applicants need to indicate why they are qualified to undertake this professional training and how they intend to use it in the future.</p><h2>Language Proficiency</h2><h3>Spanish:</h3><p>Candidates seeking a Teaching Assistantship in Spanish must take the Versant Language Proficiency Exam and submit the scores to the Department of Spanish and Portuguese.&nbsp; The test can be purchased at&nbsp;<a href=\"http://www.pearsonhighered.com/versant/\">http://www.pearsonhighered.com/versant/</a>for $25 by selecting the Spanish link at the bottom of the page.&nbsp;&nbsp; The test takes approximately 15 -17 minutes to complete, is taken over the phone, and provides the results within minutes of completing the test.&nbsp; All instructions for taking the test are included with the purchase of the test.&nbsp;&nbsp;&nbsp;</p><h3>Portuguese:</h3><p>Candidates seeking a Teaching Assistantship in Portuguese must submit a Compact Disc, playable on a standard CD player.&nbsp; The CD will be in Portuguese.&nbsp; Native speakers of languages other than English must also provide a recorded statement in English of equal length. The CD should be 5 – 10 minutes long, and should consist of free, spontaneous narration.&nbsp; Appropriate topics include a brief biographical sketch, accounts of travel or other experiences that bear on graduate study in Spanish and Portuguese, reasons for deciding to pursue a graduate career, specific research interests, and awareness of the programs and resources offered by the Department of Spanish and Portuguese at the University of New Mexico.&nbsp; Applicants should try to use as wide a range of grammatical structures as possible, including past, present, future and hypothetical reference, and an appropriately professional vocabulary.&nbsp; No portion of the recording should be read or memorized, nor should the CD be edited in any way.&nbsp; If the submitted recording does not adequately demonstrate the candidate’s linguistic abilities, additional demonstration may be required, such as a supplemental CD, or a telephone or personal interview.</p>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Martha Hurd:</b></i>\n<b>Graduate Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052772974\">(505) 277-2974</a><br>\n<a target=\"_parent\" href=\"mailto:marthah@unm.edu\">marthah@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}