{
  "name": "Positron Emission Tomography",
  "degree": "Certificate",
  "program_description": "<p>The PET/CT Certificate Program at the University of New Mexico is a certificate program designed to prepare those individuals interested in sitting for the:</p><ol><li>Nuclear Medicine Technologist Certification Board (NMTCB) Positron Emission Tomography (PET) specialty exam.</li><li>America Registry of Radiologic Technologists Computed Tomography (CT) specialty exam.</li></ol>",
  "admission_requirements": "<ol><li>Applicant must meet The University of New Mexico admission requirements (refer to UNM Catalog).</li><li>While competitive grade point averages are usually higher, each applicant must have a minimum cumulative grade point average of 2.5 in post-secondary coursework.</li><li>A completed application, three letters of recommendation, three reference forms, and official transcripts must be received by January 31st of each year for acceptance into the program the following summer (Nuclear Medicine Certificate), fall (PET/CT).</li><li>Students participating in the PET/CT Certificate Program must be certified by the American Registry of Radiologic Technologists (ARRT), or the Nuclear Medicine Technologist Certification Board (NMTCB).</li><li>The program selection committee will conduct a personal interview with each qualified student candidate.</li><li>Applicant must have a baccalaureate degree with course work in physics, chemistry, anatomy and physiology and/or ethics; or hold certification as a Radiologic Technologist, Registered Nurse or Medical Technologist; or undergraduate applicant must complete the prerequisites described under Pre-professional Curriculum prior to entry into the program.</li><li>Employment reference checks may be required for application process. A background check will be performed through the State of New Mexico upon acceptance into the program.</li><li>If completing the Bachelor of Science in Radiologic Sciences, Concentration Nuclear Medicine, coursework will be determined based upon prior courses completed.</li><li>The University of New Mexico and the Radiologic Sciences Program does not discriminate against any applicant based on sex, age, race, religion, creed, or national origin.</li></ol>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Pamala Garcia-Ramirez:</b></i>\n<b>Program Coordinator</b><br>\n<a target=\"_parent\" href=\"tel:5052725254\">(505) 272-5254</a><br>\n<a target=\"_parent\" href=\"mailto:PKGarcia@salud.unm.edu\">PKGarcia@salud.unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}