{
  "name": "Post-Master’s Certificate in Nursing",
  "degree": "Grad Certificate",
  "program_description": "&nbsp; &nbsp; &nbsp;&nbsp;This mechanism offers students who hold a master's degree in nursing an opportunity to specialize in an area of nursing not covered in their initial master's program.<p>The program of studies consists of specialty courses in the chosen area (at least 15 graduate credit hours) to be designated by the Specialty Coordinator, with approval from the Executive Dean, Academic Affairs. Course work must be completed within three years, and a 3.0 (B) average is required. Any of the concentration majors offered by the College are available as post-master's concentrations, subject to admission criteria and screening for limited enrollment areas.</p>",
  "admission_requirements": "&nbsp; &nbsp; &nbsp;&nbsp;Hold a bachelor’s degree (e.g., B.S.N.) from an accredited (N.L.N.A.C. or C.C.N.E.) nursing program, with an upper-division major in nursing. (Graduates from non-accredited programs and R.N.s with a baccalaureate degree in non-nursing fields are considered on an individual basis.) R.N.s with non-nursing baccalaureate have one opportunity to pass a Community Health test prior to the application deadline. Results of the exam must be received within 5 days of application deadline.<ul><li>A minimum cumulative GPA of 3.0 (on a 4.0 scale) for baccalaureate work.</li><li>Registered nurse licensure (or eligibility for licensure) in New Mexico.</li><li>A minimum of one-year work experience as a registered nurse. (May vary with concentration.)</li><li>R.N.s with a non-nursing baccalaureate must pass a Community Health test prior to admission.</li><li>Community Health Test Guide (<a href=\"http://nursing.unm.edu/common/docs/programs-grad/ch_test.pdf\">Click here</a>&nbsp;to download the guide)<ul><li>Note: The Community Health test is only offered by arrangement. You must have the results submitted within 5 days of the application deadline, so you must plan ahead. Please contact the advisement office for information regarding administration.</li><li>Cost is $35; payment must be made before the test is ordered. Contact Andrew Russell to schedule the test.<a href=\"mailto:anrussell@salud.unm.edu\">AnRussell@salud.unm.edu</a></li></ul></li></ul><p>For&nbsp;<strong>Application Deadlines</strong>&nbsp;<a href=\"http://nursing.unm.edu/apply-now.html\">click here</a>&nbsp;and select Master's Program.</p>",
  "transfer_agreements": "",
  "career_opportunities": "<p>Nursing combines science and technology with the desire to help people. Nurses assess patient health problems and needs, develop and implement nursing care plans, and maintain medical records. Administer nursing care to ill, injured, convalescent, or disabled patients. Nurses may advise patients on health maintenance and disease prevention or provide case management. Licensing or registration required. Includes advance practice nurses such as: nurse practitioners, clinical nurse specialists, certified nurse midwives, and certified registered nurse anesthetists. Advanced practice nursing is practiced by RNs who have specialized formal, post-basic education and who function in highly autonomous and varied roles.&nbsp;</p><p>In all states, the District of Columbia, and U.S territories, students must graduate from an approved nursing program and pass a national licensing examination, known as the NCLEX-RN, in order to obtain a nursing license. Nurses may be licensed in more than one State, either by examination or by the endorsement of a licensed issued by another State. Nursing programs range from associate degrees to graduate level programs; higher degrees typically involve a broader and more complex scope of patient care. UNM offers a variety of degree options at the bachelor’s, master’s, and doctoral levels.&nbsp;</p>",
  "contact_information": "<i><b>Andrew Russell:</b></i>\n<b>Senior Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052724223\">(505) 272-4223</a><br>\n<a target=\"_parent\" href=\"mailto:anrussell@salud.unm.edu\">anrussell@salud.unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}