{
  "name": "Psychology",
  "degree": "PhD",
  "program_description": "<p>Concentrations: clinical, cognitive/learning, developmental, health psychology, evolutionary, behavioral neuroscience and cognitive neuroscience, and quantitative/methodology. Each student is required to select a concentration.</p><p>Emphasis: health psychology. The health psychology emphasis is not required but is optional for students in any concentration except for the health psychology concentration.</p><p>Students interested in the Graduate Program are advised to have had at least 15 semester hours of college credit in psychology, including one course in psychological statistics and either a laboratory course or independent research in psychology.</p><p>Although the Department awards the M.S. degree (with thesis) under Plan I according to the regulations set forth in earlier pages of this catalog, all screening of new applicants is done in terms of entry for the Ph.D. program. The department will admit new students to the graduate program only for the fall semester of each year; exceptions to this procedure are rare. Since competition for the few available openings each year is strong, only students with excellent academic records as well as first-rate letters of recommendation are likely to succeed in gaining admission.</p><p>Graduate Record Examination (GRE) scores, including the Psychology Subject Test, are required as part of the application procedure.</p><p>General requirements for the Ph.D. are set forth in earlier pages of this catalog. Regulations include a minimum of 48 hours of graduate credits (precise requirements depends upon area) with a grade point average of 3.0 (B) or better, exclusive of thesis and dissertation; satisfactory performance on the doctoral comprehensive examination; and a dissertation accepted by the final oral examining committee.</p>The Department of Psychology considers both teaching and research to be essential aspects of doctoral training and, therefore, requires that all candidates have such experiences during their tenure. These requirements apply regardless of whether remuneration for such activities is received.&nbsp;",
  "admission_requirements": "&nbsp; &nbsp; &nbsp;&nbsp;The following core courses are required in addition to any courses required in the student’s concentration.<br><br><table><tbody><tr><td>&nbsp;</td><td>FALL TERM OF FIRST YEAR</td><td>&nbsp;</td></tr><tr><td>PSY 501</td><td>Advanced Statistics</td><td>3 hrs</td></tr><tr><td>PSY 503L</td><td>Advanced Statistics Lab</td><td>1 hr</td></tr><tr><td>PSY 505</td><td>Research Seminar</td><td>1 hr</td></tr><tr><td>PSY 551</td><td>Graduate Problems</td><td>1-3 hrs</td></tr><tr><td>&nbsp;</td><td>SPRING TERM OF FIRST YEAR</td><td>&nbsp;</td></tr><tr><td>PSY 502</td><td>Design and Analysis of Experiments</td><td>3 hrs</td></tr><tr><td>PSY 504L</td><td>Design and Analysis of Experiments Lab</td><td>1 hr</td></tr><tr><td>PSY 505</td><td>Research Seminar</td><td>1 hr</td></tr><tr><td>PSY 551</td><td>Graduate Problems</td><td>1-3 hrs</td></tr><tr><td>&nbsp;</td><td>Additional required course that is sometimes taken during the first year:</td><td>&nbsp;</td></tr><tr><td>PSY 511</td><td>History and Systems of Psychology</td><td>3 hrs</td></tr><tr><td>&nbsp;&nbsp;</td><td><strong>Note:</strong>&nbsp;This course does&nbsp;<em>not</em>&nbsp;have to be taken during a student's first year, but it does have to be taken prior to a student's comprehensive examinations.</td><td>&nbsp;</td></tr><tr><td></td><td>SPRING TERM OF SECOND YEAR</td><td></td></tr><tr><td>PSY 507</td><td>Teaching Seminar</td><td>2 hrs</td></tr><tr><td></td><td><strong>Note:</strong>&nbsp;This course&nbsp;<strong><em>must</em></strong>&nbsp;be taken prior to a teaching a course within a department.<strong><br></strong></td></tr></tbody></table>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Steven Verney:</b></i>\n<b>Graduate Faculty Advisor </b><br>\n<a target=\"_parent\" href=\"tel:5052774121\">(505) 277-4121</a><br>\n<a target=\"_parent\" href=\"mailto:sverney@unm.edu\">sverney@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}