{
  "name": "Public Administration",
  "degree": "MPA",
  "program_description": "&nbsp;<p>The Master Degree in Public Administration prepares men and women interested in public service and third sector careers for professional and management policy positions. Persons already employed or preparing to enter public service are encouraged to apply for admission. The interdisciplinary nature of the program is designed to utilize faculty resources in departments and colleges across the University, and to offer students a wide choice in their professional preparation.</p><h4>Dual Degrees</h4><p>The School of Public Administration offers joint degree programs with the School of Law and the School of Architecture and Planning.</p><p><strong>MPA/JD Degree Program</strong><br>This dual degree program is designed for students interested in legal careers in the public sector and governmental lobbying, including all levels of government. In this program, a student can earn degrees in law and public administration in about four years. In the first year, the student enrolls in the School of Public Administration (SPA) and completes one year in the program. In the second year, the student enrolls in the School of Law and takes first-year law courses. In the third and fourth years, the student takes selected law and public administration electives. The student must gain the consent of both the Law School Dean and the Public Administration Director in choosing courses for any semester. The law school accepts six hours of public administration credits toward its degree requirements, and the SPA accepts six hours of law credit toward the MPA degree requirements.&nbsp;<strong>It is important to note that the applicant must be admitted to both the Law School and the School of Public Administration</strong>.</p><p><strong>MPA/MCRP Degree Program</strong><br>The Master of Public Administration (MPA) and Master of Community and Regional Planning (MCRP) dual degree addresses the needs of students who desire public, private or non-profit careers in leadership positions requiring professional skill in community and regional planning and public administration. The program enables students to develop key knowledge and experience necessary to assess public needs, determine public goals and objectives, develop community-based strategies, and manage and resolve public disputes. Students admitted to the dual degree program typically aim to become administrators and/or managers in planning projects or programs working with local citizens, special districts, and local, state and federal public agencies. Graduates also work in a variety of consulting situations with community-based for-profit and non-profit clients. Students may earn the MPA/MCRP degree in 61 hours, approximately two-thirds the time it would normally take to earn both degrees separately (92 credit hours are required separately - 50 in CRP and 42 in PADM).&nbsp;<a href=\"http://spa.unm.edu/common/documents/spa-crp-checklist.pdf\">SPA CRP Dual Degree Program Checklist</a></p>",
  "admission_requirements": "&nbsp;<h3>Admission Deadlines</h3><p>Application for admission/readmission must be received no later than the following:</p><p>U.S. Applicants<br>Fall deadline - April 1<br>Spring deadline - October 1</p><p>International Applicants<br>Fall deadline - March 1<br>Spring deadline - August 1</p><p>Request for Deferral of Admission<br>Students who have been accepted to the MPA program and wish to defer admission to a subsequent semester must submit a formal request for a deferral to SPA no later than the Friday of the second week of classes of the original semester of admission. Offers of admission can be deferred for up to one calendar year.&nbsp;</p><p>Admission is competitive, and only applicants with strong academic and professional records are admitted to the program. Applicants must have:</p><p>&nbsp;A baccalaureate degree from an accredited college or university with an undergraduate grade point average for the last 60 hours, or overall major grade point average of at least 3.0 on a 4.0 scale, or equivalent.</p><p>Applicants to the School of Public Administration MPA program should submit an application packet to the&nbsp;<a href=\"http://admissions.unm.edu/\" title=\"UNM Admissions\">UNM Admissions Office</a>. A paper or online application is acceptable, although online is strongly preferred.</p><h4>&nbsp;</h4><h4>The application (Paper or Online) must include the following AND be submitted directly to the UNM Admissions Office:</h4>1. Application &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Question #17: (Major Code is \"MPA-PADM\")&nbsp;2. Residency Form &nbsp; &nbsp; &nbsp; &nbsp; Required of all students&nbsp;3. Application Fee &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; $50.00, non-refundable&nbsp;&nbsp;<h4><strong>The following should be sent&nbsp;directly&nbsp;to the School of Public Administration</strong><strong>:</strong></h4><ul><li><a href=\"http://spa.unm.edu/common/documents/letter-of-intent-guidelines.pdf\" title=\"Letter of Intent Guidelines\">Letter of Intent</a>&nbsp;(2-3 pages)</li><li>Three Letters of Recommendation</li><li>Resume</li><li>Official transcripts from EACH academic institution previously attended, except UNM</li></ul>&nbsp;&nbsp;&nbsp;&nbsp;<p><strong>UNM School of Public Administration Address:</strong></p><p>School of Public Administration<br>Attn: Graduate Academic Advisor<br>MSC05 3100<br>University of New Mexico<br>Albuquerque, NM 87131-0001</p><h4><strong>Non-Degree and Post-Degree Status:</strong></h4><p>Students who take Public Administration or Health Administration courses in non-degree and post-degree status fall into three categories:</p><p>1. Applicants who are denied admission may be advised by the admissions committee to take two core courses (PADM 500, 521, or 525) in non-degree status before reapplying for admission. As non-degree students, they must achieve at least a 3.5 GPA in Public Administration core courses to be reconsidered for admission to the program. Upon completion of coursework, non-degree students must reapply for admission.</p><p>2. Individuals who seek to enroll in a course after the admission deadline, but prior to the start of classes. These persons may only register for two core courses (PADM 500, 521, or 525) in non-degree status, and must obtain approval from the Director of the School of Public Administration. A maximum of six non-degree credit hours may be transferred to the M.P.A. degree.</p><p>3. Students who have already completed a Master’s degree may enroll in post-degree status with approval from the Director of the School of Public Administration. Students in this category pursue a particular concentration and enroll in a specialized course of study to enhance their professional degree.</p>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Gene Vincent Henley:</b></i>\n<b>Program Operations Manager and Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052771095\">(505) 277-1095</a><br>\n<a target=\"_parent\" href=\"mailto:ghenley@unm.edu\">ghenley@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}