{
  "name": "Public Health",
  "degree": "MPH",
  "program_description": "<p>The mission of the Public Health\nProgram at the University of New Mexico is to provide leadership in\ngraduate and community-based education and research grounded in\nsocial justice to improve the health of the diverse populations in\nNew Mexico and the Southwest.</p>\n<p>The program offers a Master of Public\nHealth degree and a graduate Public Health minor. The M.P.H.. degree\nprepares learners to improve the health of populations with a primary\nfocus on New Mexico, the Southwest, the United States/Mexico border\nregion and south of the border. Graduates leave the program prepared\nto work in partnership with New Mexico’s diverse communities,\ntribes and the public and private sectors.</p>\n<p>Two dual degrees are offered, an\nM.D./M.P.H. and an M.A.L.A.S./M.P.H..</p>\n<p>Community Health Concentration</p>\n<p>The mission of the Community Health\nConcentration is to prepare students for leadership roles in\npopulation-based disease prevention and health promotion in public\nand private settings. The philosophical foundation of the\nconcentration relies on a community capacity building, empowerment\napproach to promote social justice and equity in health. The\nconcentration is designed for students with prior experience,\neducation, or interest in community-focused public health practice or\nresearch that values diversity, self-reflection and critical analysis\nof evidence-based practice and practice-based public health\napproaches. The purpose of this concentration is to provide students\nwith the multi-disciplinary knowledge and skills necessary to plan,\nimplement, and evaluate public health programs at multiple levels of\nthe social-ecologic framework.</p>\n<p>Requirements:</p>\n<p>The Community Health Concentration\nrequires:</p>\n<ul>\n\t\n\t\t\n\t\t\t<li><p>Completion of 19 credits of MPH\n\t\t\tcore courses and at least 18 credits in graduate-level course in\n\t\t\tpublic and community health as outlined below;</p>\n\t\t\t</li><li><p>Completion of 2 credits of a\n\t\t\tpractical field experience (PH 598 - Public Health Practicum) in a\n\t\t\tcommunity public health setting; and</p>\n\t\t\t</li><li><p>Completion of at least 3 credits\n\t\t\tdemonstrating competencies in integrating community health\n\t\t\tperspectives through one of the culminating experience options\n\t\t\t(Professional Paper, Intro to Integrative Experience and\n\t\t\tIntegrative Experience, or Thesis, and the Oral Master’s\n\t\t\tExamination).</p>\n\t\t\t</li><li><p>The chair of the culminating\n\t\t\texperience committee must be a core faculty member of the\n\t\t\tconcentration.</p>\n\t\t\t<p></p>\n\t\t</li>\n\t\n</ul>\n<p>Epidemiology Concentration</p>\n<p>The concentration in epidemiology will\nprovide students with the knowledge and skills necessary to collect,\nanalyze, and interpret epidemiologic data for the solution of public\nhealth problems. The concentration will prepare students for\nemployment as a master’s level epidemiologist or research scientist\nin various settings such as the New Mexico Department of Health, the\nUniversity of New Mexico School of Medicine, and other public health\nresearch and service organizations.</p>\n<p>Requirements:</p>\n<ul>\n\t\n\t\t\n\t\t\t<li><p>Completion of 19 credits of MPH\n\t\t\tcore courses and 18 credits of required and elective\n\t\t\tgraduate-level courses in the concentration as outlined below.</p>\n\t\t\t</li><li><p>Completion of 2 credits of a\n\t\t\tpractical field experience (PH 598 – Public Health Practicum) in\n\t\t\tan epidemiologic setting; and</p>\n\t\t\t</li><li><p>Completion of at least 3 credits\n\t\t\tdemonstrating competencies in epidemiology through one of the\n\t\t\tculminating experience options (Professional Paper, Integrative\n\t\t\tExperience, or Thesis and the Oral Master’s Examination).</p>\n\t\t\t</li><li><p>The chair of the culminating\n\t\t\texperience committee must be a core faculty member of the\n\t\t\tEpidemiology Concentration.</p></li></ul>\n<p>Health Systems, Services, and Policy\nConcentration</p>\n<p>The concentration in Health Systems,\nServices, and Policy will provide students with the knowledge and\nskills necessary to analyze health systems, public health and health\ncare services and programs, and related governmental and\nnon-governmental policies. Students will develop the capacity to\nanalyze and develop interventions and health policies at local,\nnational and global levels. The goal of the concentration is to\nprepare students to work in health organizations and policy arenas to\nimprove population health and decrease health inequities.</p>\n<p>Requirements</p>\n<p>The Health Systems, Services and Policy\nConcentration requires:</p>\n<ul>\n\t\n\t\t\n\t\t\t<li><p>Completion of 19 credits of MPH\n\t\t\tcore courses and of 18 credits in graduate-level courses as\n\t\t\toutlined here;</p>\n\t\t\t</li><li><p>Completion of 2 credits of a\n\t\t\tpractical field experience (PH 598 – Public Health Practicum) in\n\t\t\tpolicy, public health or health care service settings; and,</p>\n\t\t\t</li><li><p>Completion of at least 3 credits\n\t\t\tdemonstrating competencies in integrating health systems,\n\t\t\tservices, and policy perspectives through one of the culminating\n\t\t\texperience options (Professional Paper, Integrative Experience, or\n\t\t\tThesis, and the Oral Master’s Examination).</p>\n\t\t\t</li><li><p>The chair of their culminating\n\t\t\texperience committee must be a core faculty member of the\n\t\t\tconcentration.</p>\n\t\t\t<p></p>\n\t\t</li>\n\t\n</ul>\n<p>M.D./M.P.H.</p>\n<p>The dual status M.D./M.P.H. degree\nrequires five years of integrated learning. This integrated learning\nenhances opportunities for medical students to acquire public health\nknowledge and skills with the goals of 1) reducing disparities in\nhealth status within New Mexican populations 2) strengthening\nphysician advocacy and leadership skills in health policy development\n3) fostering evidence-based interventions and 4) using assessment\nskills to better determine population needs and interventions. Each\nM.D./M.P.H. student will be able to successfully complete both\ndegrees in an integrated fashion.</p>\n<p>Student applies simultaneously to both\nthe M.D. and the M.P.H. programs and indicates on the two\napplications that they are applying for dual status. Students must\nmeet the requirements of both programs and be accepted into both\nprograms in order to be considered dual status.</p>\n<p>Students will be admitted to each\nprogram separately. Once they are admitted to both programs, they\nqualify as dual status students. For more information on the\nM.D./M.P.H. dual status degree, contact the Public Health Program.</p>\n<p>M.A.L.A.S./M.P.H.</p>\n<p>The Master of Arts in Latin American\nStudies and Master of Public Health dual degree program is intended\nto prepare graduates to improve the health of Latin American\npopulations and Latin populations in the United States, with a\nprimary focus on New Mexico, the Southwest, the United States/Mexico\nborder region, and regions south of the border. It supplements the\nM.P.H. program with in-depth study of languages, cultures, and\nsocieties that will help prepare graduates to work effectively either\nin Latin America, or with Latin American immigrant populations within\nthe United States.</p>\n<p>The dual degree reduces requires 63\ngraduate credit hours, as compared to the 78 hours of graduate\ncredits required to complete the two degrees separately. A minimum of\n42 hours are required in Public Health courses, and a minimum of 21\nhours are required in Latin American Studies courses. At least 13\nhours of the M.P.H. component must have significant content related\nto Latin America or Latin American immigrant communities in the\nUnited States, to enable the student to integrate the content and\npractice of the two degrees.</p>\n<p>Applicants for the dual degree program\nmust apply separately to and meet the entrance requirements of each\nprogram. Preference is given to students who have public health\nexperience, which may be community development, research, health\neducation, health science, health promotion, or other health-related\nwork. Experience can be paid or voluntary.</p>\n<p>Courses in Public Health (PH) are\ncategorized in content areas.&nbsp; The category for each course\nappears in parenthesis at the end of the course description according\nto the following legend:</p>\n<p>Health Systems, Services and Policy\n(HSSP); Community Health (CH); Epidemiology (E); General Electives\n(G).</p>",
  "admission_requirements": "<p>The program will consider applicants\nwho satisfy all admission requirements as follows:</p>\n<ol>\n\t<li><p>B.S., B.A. or equivalent from an\n\taccredited U.S. institution or a recognized foreign institution.</p>\n\t</li><li><p>G.P.A. of at least 3.0 is\n\tpreferred,&nbsp;or&nbsp;9 credit hours with G.P.A of 3.0 or better\n\tin public health-related graduate courses.</p>\n\t</li><li><p>Undergraduate basic statistics\n\tcourse or graduate-level basic statistics course with a 3.0 or\n\thigher.&nbsp;M.D. and Ph.D. students who have received their\n\taccredited degrees from U.S. institutions are exempt from this\n\trequirement.&nbsp;All students must have recent (within five years)\n\tGRE scores with preferred verbal, quantitative and analytical\n\twriting scores around the 50th percentile,&nbsp;or&nbsp;MCAT with\n\tpreferred total score of 22 and N in writing,&nbsp;or&nbsp;GMAT with\n\tpreferred score of 500 and above.&nbsp;M.D.&nbsp;and Ph.D.\n\tapplicants&nbsp;who received their degrees from a U.S. university\n\tare exempt from submitting the above test scores.&nbsp;Foreign&nbsp;medical\n\tgraduates must be licensed to practice in the U.S. or must have\n\treceived their degrees from an accredited U.S. institution to be\n\texempt from the test scores requirement. Foreign applicants must\n\ttake the TOEFL examination and score at least 550.</p>\n\t</li><li><p>Foreign applicants must submit one\n\tof the following English proficiency tests:&nbsp;</p>\n</li></ol>\n<table>\n\t\n\t\n\t\n\t\n\t<tbody><tr>\n\t\t<td>\n\t\t\t<p><br>\n\t\t\t</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p>Paper Test</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p>Computer Test</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p>IBT</p>\n\t\t</td>\n\t</tr>\n\t<tr>\n\t\t<td>\n\t\t\t<p>Graduate TOEFL</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p>550</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p>213</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p>79-80</p>\n\t\t</td>\n\t</tr>\n\t<tr>\n\t\t<td>\n\t\t\t<p>Graduate IELTS</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p>7.0</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p>7.0</p>\n\t\t</td>\n\t\t<td>\n\t\t\t<p>7.0</p>\n\t\t</td>\n\t</tr>\n</tbody></table>\n<p><br>The Cambridge test may also be\naccepted with a satisfactory score of \"C\" or better&nbsp;for\ngraduate students.</p>\n<p>Preference is given to students who\nhave public health experience. Their experience may be in public\nhealth practice in a health department, community development,\nresearch, health education, health science, health promotion, or\nother health-related work. Experience&nbsp;may be paid or voluntary.</p>\n<p>Students may transfer up to 17 credit\nhours with \"B\" or better to the program from other\ninstitutions or other non-degree or graduate programs within UNM.\nHowever, those hours cannot have been used to meet the requirements\nof another degree program.</p>\n<p>For Office of Graduate Studies\nadmissions requirements, refer to&nbsp;<a href=\"http://ogs.unm.edu/\" target=\"_blank\">OGS\nWeb site</a>.</p>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Nina Wallerstein:</b></i>\n<b>Director</b><br>\n<a target=\"_parent\" href=\"tel:5052774173\">(505) 277-4173</a><br>\n<a target=\"_parent\" href=\"mailto:NWallerstein@salud.unm.edu\">NWallerstein@salud.unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}