{
  "name": "Radiologic Sciences",
  "degree": "BS",
  "program_description": "&nbsp;<p>The Bachelor of Sciences in Radiologic Sciences with a concentration in Radiography or Nuclear Medicine is a degree completion program for those students who would like to finish the last two years of education and gain a bachelor's degree. The program is a part-time or full-time curriculum of classroom instruction. It is designed to accommodate those technologists who are working while finishing their bachelor's degree. The Bachelor of Sciences in Radiologic Sciences with a concentration in Radiography provides the student with the knowledge and skills necessary to perform advanced diagnostic procedures or sound management practices including teaching depending on the emphasis chosen. These emphases include management, Computed Tomography, Nuclear Medicine Imaging or Magnetic Resonance Imaging.</p><p>Eligible participants are registered radiographers, registered nuclear medicine technologists, students enrolled and completing an entry level radiography or nuclear medicine program, as well as any registered technologist in the field of diagnostic imaging. Students are enrolled at the beginning of each semester.&nbsp;</p><p>There is no application deadline for the Bachelor of Sciences in Radiologic Sciences. To be accepted into any of the degree emphases other than management will require the student to follow specific application guidelines for these individual programs. See individual programs for application information.</p>",
  "admission_requirements": "&nbsp;<p>The University of New Mexico School of Medicine (UNM SOM) uses the centralized&nbsp;<a target=\"_blank\" href=\"http://www.aamc.org/students/amcas/start.htm\">American Medical College Application Service</a>&nbsp;(AMCAS) that is supported by the Association of American Medical Colleges. The AMCAS application of those applicants who wish to apply to the UNM SOM will be electronically forwarded to our school.</p><p>Applications must be received by AMCAS by the deadlines listed below:</p><table><tbody><tr><th>&nbsp;</th><th>&nbsp;&nbsp;Early Decision&nbsp;<br>Program (EDP)&nbsp;&nbsp;</th><th>&nbsp;All Other Programs&nbsp;</th></tr><tr><td>Earliest Date to Apply</td><td>June 1</td><td>June 1</td></tr><tr><td>Latest Date to Apply</td><td>August 1</td><td>November 15</td></tr><tr><td>Admissions Decisions Sent</td><td>October 1</td><td>March 15</td></tr></tbody></table><p>&nbsp;</p><p>Applicants will be notified by email if they have been approved to complete the Secondary Application and a residency form.</p><h3><strong>Prerequisite Coursework Requirements</strong></h3><p>The University of New Mexico School of Medicine (UNM SOM) encourages application from all interested students, regardless of their area of academic study. To receive consideration for the admissions process, applicants must have a cumulative GPA of 3.0 or greater. The minimum prerequisites course requirements to apply to the UNM School of Medicine are:</p><table><tbody><tr><td><strong>Required Course</strong></td><td><strong>Laboratory Required</strong></td><td><strong>Length</strong></td></tr><tr><td>General Biology I &amp; II</td><td>Yes</td><td>1 academic year (2 semesters or 3 quarters)</td></tr><tr><td>General Chemistry I &amp; II</td><td>Yes</td><td>1 academic year (2 semesters or 3 quarters)</td></tr><tr><td>Organic Chemistry I &amp; II</td><td>Yes</td><td>1 academic year (2 semesters or 3 quarters)</td></tr><tr><td>General Physics I &amp; II</td><td>No</td><td>1 academic year (2 semesters or 3 quarters)</td></tr><tr><td>Biochemistry*</td><td>No</td><td>1 semester or 2 quarters</td></tr></tbody></table><p><em>*The biochemistry course should be at the 400 level. Students taking biochemistry at UNM may take&nbsp;</em><strong><em>ONE</em></strong><em>&nbsp;of the following class combinations to meet the biochemistry prerequisite requirement:</em></p><ul><li><em>Biochemistry 423 ONLY</em></li><li><em>Both Biochemistry 445 and 446</em></li><li><em>Both Chemistry 421 and 425</em></li></ul><p>All of the prerequisites, except for organic chemistry labs (both I and II) and biochemistry, must be completed&nbsp; prior to the submission of the American Medical College Application Service (AMCAS) application. The organic chemistry labs and biochemistry prerequisites must be completed prior to matriculation.</p><p>All prerequisite coursework must be completed with a letter grade of C or better (C- is not acceptable) and must be earned at colleges and universities recognized by one of the&nbsp;<a href=\"http://hsc.unm.edu/som/admissions/docs/US%20Accrediting%20Agencies.pdf\">U.S. Regional Accrediting Agencies</a>. Pass/Fail (CR/NC) grading is not accepted. Advance Placement (AP) Credit will be accepted for introductory Biology, Chemistry, or Physics&nbsp;<strong>ONLY</strong>&nbsp;if college credit was granted by the institute. College Level Examination Program (CLEP) Credit will be accepted as long as the applicant has the sufficient number of semester hours to fulfill the required prerequisites.</p><p>Foreign national applicants who would like to be considered for admission to the UNM School of Medicine are expected to have the equivalent of at least two years of full-time undergraduate or graduate studies at an accredited college or university in the United States, and to have all the same required course prerequisites. All prerequisite coursework must be earned at colleges and universities recognized by one of the&nbsp;<a href=\"http://hsc.unm.edu/som/admissions/docs/US%20Accrediting%20Agencies.pdf\">U.S. Regional Accrediting Agencies</a>.</p><h4><strong>Online Coursework</strong></h4><p>It is&nbsp;<strong>NOT</strong>&nbsp;recommended that any of the required prerequisite courses be taken through an online course. Any courses taken online to fulfill the required prerequisites MUST be pre-approved by the Assistant Dean for Admissions. Students must also demonstrate a compelling need to take the course online as opposed to in class course. All requests will be considered on a case-by-case basis.</p><h3><strong>Medical College Admissions Test (MCAT)</strong></h3><p>The Medical College Admissions Test (MCAT) is required for admissions to the UNM SOM. The American Medical College Application Service (AMCAS) will transmit the scores to the UNM School of Medicine with your application.&nbsp;<strong>To receive consideration for the admissions process, applicants must have a minimum total numerical MCAT score of 22.&nbsp;</strong>The University of New Mexico School of Medicine will NOT accept MCAT exam scores that are more than four years old at the time of application. The Committee on Admissions will not reconsider an application based on the release of the subsequent MCAT scores after the interview has taken place. Additional questions about the MCAT should be directed to the UNM SOM Office of Admissions by phone (505) 272-4766 or&nbsp;<a href=\"mailto:somadmissions@salud.unm.edu\">email</a><strong>.</strong></p><p>On February 16, 2012, AAMC’s Board of Directors approved the MR5 committee’s recommendations for the 2015 MCAT exam. The changes are designed to help students prepare for a rapidly-changing health care system and an evolving body of medical knowledge while addressing the needs of a growing, aging, and increasingly-diverse population. Among the changes are added emphasis on the social and behavioral sciences, scientific inquiry and reasoning skills, and introductory biochemistry. The critical analysis and reasoning skills section will ask students to analyze information in passages from a wide range of social sciences and humanities disciplines, including ethics and philosophy, cross-cultural studies, and population health. &nbsp;</p><p>To learn more about the new exam, go to&nbsp;<a href=\"http://echo4.bluehornet.com/ct/14930708:17880350788:m:1:1612438702:C51822B7518EF9AB9A835ECEB0F33297:r\">https://www.aamc.org/newsroom/newsreleases/273712/120216.html</a></p><p>Information about the exam is provided in&nbsp;<a href=\"http://www.aamc.org/students/mcat/mcatessentials.pdf\">MCAT Essentials</a>&nbsp;(published by the Association of American Medical Colleges). This information includes detailed descriptions of the content and cognitive skills assessed by the exam. It also provides examples of question formats used on the test and incorporates sample items with response explanations. Full-length&nbsp;<a href=\"http://www.aamc.org/students/mcat/practicetests.htm\">practice exams</a>&nbsp;are available for purchase ($35.00 each) at your convenience.</p><h3><strong>Residency</strong></h3><p>To receive consideration for the admissions process, applicants must be a resident of New Mexico for at least one year at the time of application or have strong ties to New Mexico. Strong ties include graduating from a New Mexico high school in which you attended for at least one year or being financially dependent on a New Mexico resident.</p><p>Consideration is also given to enrolled members of federally recognized American Indian Tribes and Alaska Natives and Villages (AI/AN). It is requested that AI/AN applicants provide their Tribal Affiliation, Certificate of Indian Blood (CIB), Enrollment Number, and/or a written description of their involvement with their tribal community upon invitation to complete the Secondary Application. For more specific information regarding UNM's Residency Policies, visit the Office of the Registrar's page on&nbsp;<a href=\"http://registrar.unm.edu/residency.htm\">Residency Information</a>.</p><p>The university is also a member of the Western Interstate Commission for Higher Education (WICHE). Therefore, consideration is given to residents of participating states that at present have no medical schools (Montana and Wyoming). WICHE applicants must apply through the Early Decision Program and must also have at least the average MCAT/GPA as the last year's entering class in order to receive consideration. The 2012 entering class average MCAT composite score was 28 and the average cumulative GPA was 3.6.</p><p>Foreign national applicants must reside in New Mexico for a least one year prior to application in order to fulfill the residency requirement.</p><h3><strong>Clinical Experience</strong></h3><p>The Committee on Admissions carefully reviews each type of clinical experience in which every individual applicant to medical school has participated. The Committee believes that every applicant should reflect a vibrant interest in medicine demonstrated by clinical experiences with direct patient contact and knowledge of New Mexico's health care issues. The intent is to provide the applicant with the opportunity to prove to himself or herself and to the Committee on Admissions that medicine is the profession in which the individual whole-heartedly wishes to study and work. This volunteer or possible work experience may be in a hospital or clinic setting, perhaps in a nursing home or hospice environment. It is up to each student to take initiative to locate their clinical experiences through interactions with the various volunteer offices of the local hospitals or through interactions with their professors, friends, family members, etc. There is a plethora of summer clinical experience programs around the country; however, application to those programs begins during the winter months, long before the summer starts.</p><p>The Committee also examines the type of community volunteer activities in which applicants have been involved. The Committee believes that individuals who have participated in such activities are more likely to relate well to other people, an essential aspect of the physician-patient interaction.&lt;p&gt;The Committee also examines the type of community volunteer activities in which applicants have been involved.</p><p>The Office of Medical Student Affairs recently established a Shadowing Program that provides local New Mexico high school students the opportunity to follow a UNM physician for a period of time. For more information regarding the Shadowing Program please go to the&nbsp;<a href=\"http://hsc.unm.edu/som/oss/Shadowing.shtml\">Shadowing Program</a>&nbsp;website.</p><h3><strong>Tuition and Fees</strong></h3><p>Estimated tuition and fees for the 2010-2011 academic year:</p><ul><li>Resident tuition - $16,170</li><li>Non-resident tuition - $46,347</li><li>Disability Insurance, per year - $103</li><li>Needlestick Insurance, per year - $60</li><li>Curriculum Fee - $2,700</li><li>Diagnostic Equipment (1st year students only) - $640</li><li>Library Fee - $150</li><li>Microscope Fee (1st year students only) - $100</li></ul><strong><p>For more information regarding tuition, please reference the&nbsp;<a href=\"http://finaid.unm.edu/COA-MED_10-11.pdf\">UNM School of Medicine Tuition Form</a>&nbsp;or go to the&nbsp;<a href=\"http://hsc.unm.edu/som/finaid/coa.shtml\">UNM SOM Financial Aid website</a>.</p></strong><h3><strong>Pre-Med Advisement</strong></h3><p>The UNM SOM Office of Admissions offers pre-med advisement to any students interested in applying to medical school. The Office of Admissions holds monthly advisement workshops to provide students with the basic information on applying to medical school.&nbsp;<strong>All students interested in setting up a one-on-one advisement appointment with one of the UNM SOM Office of Admissions staff persons must first attend an&nbsp;<a href=\"http://hsc.unm.edu/som/admissions/AdviseWorkshop.shtml\">advisement workshop</a>.</strong></p><strong></strong><p>UNM Students can also receive pre-med advisement from The University of New Mexico's University College or the College of Arts and Sciences.</p><strong><p><strong>Be very careful of any outside advice you receive from other physicians and/or current medical students as information on the application process may change from year to year.</strong></p></strong>",
  "transfer_agreements": "",
  "career_opportunities": "<p>“Students have the option of completing a B.S. degree program in Radiologic Sciences with a concentration in\nRadiography. The degree program provides the student with all the necessary skills to perform the job of a Radiologic\nTechnologist and in addition, provides the student with other skills necessary for advancement in the field. The student\nfirst enrolls in the University and satisfactorily completes one year of prerequisites as outlined in the degree plan. In the\nspring semester of the first year, the student makes application for the Radiography Program and is interviewed by a\nselection committee consisting of faculty and clinical personnel.” (from the Department of Radiology website).&nbsp;<br></p><div><p>“Students have the option of completing a B.S. degree program in Radiologic Sciences with concentration in Nuclear\nMedicine. (Curriculum outline for B.S. of Radiographic Sciences with Nuclear Medicine Concentration). The degree\nprogram provides the student with all the necessary skills to perform the job of a Nuclear Medicine Technologist and in\naddition, provides the student with other skills necessary for advancement in the field. The student first enrolls in the\nUniversity and satisfactorily completes two years of prerequisites as outlined in the degree plan. In the Spring semester of\nthe second year, the student makes application for the Nuclear Medicine Imaging Technology Program and is interviewed\nby a selection committee consisting of faculty and clinical personnel.” (from the Department of Radiology website).&nbsp;</p></div>",
  "contact_information": "<i><b>Elizabeth J. Greer:</b></i>\n<b>Director and Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052725512\">(505) 272-5512</a><br>\n<a target=\"_parent\" href=\"mailto:EJGreer@salud.unm.edu\">EJGreer@salud.unm.edu</a><br><br>",
  "online": "degree completion",
  "keywords": null,
  "moratorium": null
}