{
  "name": "Secondary Education",
  "degree": "MA",
  "program_description": "The Secondary Education Program offers licensure programs at the graduate level as well as M.A. programs for experienced classroom teachers.&nbsp; Students seeking licensure as a secondary teacher (grades 7-12) must choose a teaching endorsement in Communicative Arts, Math, Science, Social Studies or World Languages (e.g., Spanish, French and German).&nbsp; Licensed teachers interested in deepening their professional knowledge of teaching and learning can apply for the M.A. in Secondary Education program.",
  "admission_requirements": "<h4>M.A. in Secondary Education (Plan I or Plan II)</h4><p>Prospective students must be licensed teachers.&nbsp; Students may choose either Plan I or Plan II (see previous description).&nbsp; In addition to the required core courses, students choose a specialty area of 12-15 credit hours from subject areas taught in the secondary schools such as language arts; social studies; mathematics; science education; technology education, etc.&nbsp; The student can also define an area of interest and select courses focused on topics like teacher leadership/development and reflective practice.&nbsp; They can also choose courses in other educational programs like educational administration and special education.&nbsp; Students are required to develop and follow a planned program of studies made up of courses selected with the approval of a faculty advisor.&nbsp; Courses taken without an advisor’s prior approval may not be accepted toward completion of the M.A. degree.</p>",
  "transfer_agreements": "",
  "career_opportunities": "<p>Middle school teachers and secondary school teachers help students delve more deeply into subjects introduced in\nelementary school and expose them to more information about the world. Middle and secondary school teachers\nspecialize in a specific subject, such as English, Spanish, Mathematics, History, or Biology. &nbsp;50 states and the District of Columbia require public school teachers to be licensed. In most states a prerequisite for\nlicensure is a bachelor’s degree. Usually licensure is granted by the State Board of Education or a licensure advisory\ncommittee. Requirements for regular licenses to teach kindergarten through grade 12 vary by state.&nbsp;</p>",
  "contact_information": "<i><b>Department of Teacher Education<br>(505) 277-0513<br>ted@unm.edu<br></b></i><br>",
  "online": "partial",
  "keywords": "principal school leadership educational licensure administrator",
  "moratorium": null
}