{
  "name": "Secondary Education (Physical Science Concentration, with Physics Emphasis)",
  "degree": "BSED",
  "program_description": "<p>The curriculum leading to the Bachelor’s Degree (B.A.Ed. or B.S.Ed.) in Secondary Education is designed for students preparing to teach in middle schools, junior high schools or senior high schools (grades 7-12). The program of studies for the Secondary Education major and licensure preparation has three components:</p><ul><li>General Education Requirements</li><li>Concentration-Teaching Field Requirements</li><li>Professional Education Requirements</li></ul><p>Students must meet with a College of Education Academic Advisor for initial consultation about their program, and their secondary faculty advisor through out their program. The Secondary Education faculty advisor must approve enrollment into the professional licensure courses that are offered in a Fall/Spring sequence.</p>",
  "admission_requirements": "<p>This concentration-teaching field requires 30 hours in chemistry and eight hours EACH in biology, earth and planetary sciences, physics and mathematics.</p><table><tbody><tr><td>1.</td><td>Core Courses</td><td>32 hours</td></tr><tr><td>&nbsp;</td><td>BIOL 201, BIOL 202, CHEM 121, CHEM 123L, CHEM 122, CHEM 124L, EPS 101/105L, EPS 201L, PHYC 160/160L, PHYC 262/262L</td><td>&nbsp;</td></tr><tr><td>2.</td><td>Support for Emphasis Area</td><td>20 hours</td></tr><tr><td>&nbsp;</td><td>Select from PHYC 301, PHYC 302, PHYC 303, PHYC 304, PHYC 307, PHYC 308, PHYC 327, PHYC 330, PHYC 405, PHYC 406, PHYC 452, PHYC 491, PHYC 492</td><td>&nbsp;<br><br></td></tr></tbody></table>",
  "transfer_agreements": "",
  "career_opportunities": "<p>&nbsp;Middle school teachers and secondary school teachers help students delve more deeply into subjects introduced in elementary school and expose them to more information about the world. Middle and secondary school teachers specialize in a&nbsp;specific&nbsp;subject, such as English, Spanish, Mathematics, History, or Biology. &nbsp;50 states and the District of Columbia require public school teachers to be licensed. In&nbsp;most states a prerequisite for licensure is a bachelor’s degree. Usually licensure is granted by the State Board of Education or a licensure advisory committee. Requirements for regular licenses to teach kindergarten through grade 12 vary by state.&nbsp;</p>",
  "contact_information": "<i><b>Department of Teacher Education<br>(505) 277-0513<br>ted@unm.edu</b></i>",
  "online": "partial",
  "keywords": "teaching teacher preperation education",
  "moratorium": null
}