{
  "name": "Secondary Education (Social Studies Concentration)",
  "degree": "BAED",
  "program_description": "<p>College of Education vision:<strong><br>Excellence and diversity through people, ideas and innovation.</strong></p><p>Students completing programs in professional education must be prepared for a wider array of professional responsibilities than ever before. Education has expanded beyond the boundaries of the school to address the continuing education of children, youth and adults throughout a lifetime of learning. Such expansion of the perspective of education requires a focused mission and commitment to certain core values.</p><p>Our mission is the study and practice of education through teaching, research and service. We</p><ul><li>address critical educational issues;</li><li>test new ideas and approaches to teaching and learning; and</li><li>educate professionals who can:<ul><li>facilitate human growth and development in schools, homes, communities and workplaces,</li><li>prepare students for participation in a complex and challenging society.</li></ul></li></ul>In carrying out our mission, we value<ul><li>excellence in all we do;</li><li>diversity of people and perspectives;</li><li>relationships of service, accountability, collaboration and advocacy;</li><li>the discovery, discussion and dissemination of ideas; and</li><li>innovation in teaching, technology and leadership.</li></ul><p>The College is organized in multi-programmatic departments. Each is composed of several program units which work together in areas of common interest so that students and faculty make connections across fields of study.&nbsp;<strong>Prospective students should consult with the department in which the program is listed to get an update on any curricular changes approved after the printing of the catalog.</strong></p><p>At the baccalaureate and post-baccalaureate levels, the College offers undergraduate initial (entry level) professional preparation programs for qualified individuals seeking careers in teaching and related occupations.&nbsp;<strong>Admission of qualified individuals to all initial professional preparation programs is competitive and must be successfully completed at least one semester in advance of the projected time of beginning professional study.</strong></p><p>At the graduate level, the College offers advanced professional education in careers in teaching and related occupations. In addition, some advanced professional education programs in specialized areas (e.g., educational leadership, elementary education, secondary education, counseling and organizational learning and instructional technologies) require prerequisite degrees, experiences and/or professional licensure.</p>",
  "admission_requirements": "<li>Grade point average options for applicants with 26 or more hours, or who are transferring from another institution:<ul><li>a. College grade point average 2.50 criteria (See above, eligibility criteria)</li><li>b. 2.70 GPA for last 24 hours, or</li><li>c. 3.0 for last 12 hours at the University of New Mexico (content courses only) plus 2.50 GPA on the previous two semester/quarters wherever taken</li><li>d. For Secondary Education, 2.50 for all course work and 2.50 in the endorsement area.</li><li>e. To be eligible to apply to the Elementary Education program, applicants must have no more than 9 hours remaining in addition to their required Teacher Education hours. Advisors determine eligibility.</li><li>f. To be eligible to apply to the Secondary Education program, applicants must have no more then 6 hours remaining in addition to their required Teacher Education hours. Advisors determine eligibility.</li></ul></li><li>Provide documentation of successfully passing the Professional Skills Assessments: New Mexico Teacher Assessment Tests–Basic Skills section. (The New Mexico Teacher Assessment Tests will be given at scheduled times in different locations in the state. Contact the College Advisement Center for schedule, information and location.)</li><li>Specific program requirements (contact the College Advisement Center).</li><li></li>",
  "transfer_agreements": "",
  "career_opportunities": "<p>&nbsp;Middle school teachers and secondary school teachers help students delve more deeply into subjects introduced in elementary school and expose them to more information about the world. Middle and secondary school teachers specialize in a&nbsp;specific&nbsp;subject, such as English, Spanish, Mathematics, History, or Biology. &nbsp;50 states and the District of Columbia require public school teachers to be licensed. In&nbsp;most states a prerequisite for licensure is a bachelor’s degree. Usually licensure is granted by the State Board of Education or a licensure advisory committee. Requirements for regular licenses to teach kindergarten through grade 12 vary by state.&nbsp;</p>",
  "contact_information": "<i><b>Department of Teacher Education<br>(505) 277-0513<br>ted@unm.edu</b></i><br><br>",
  "online": "partial",
  "keywords": "teaching teacher preperation education",
  "moratorium": null
}