{
  "name": "Signed Language Interpreting",
  "degree": "BS",
  "program_description": "The&nbsp;Bachelor of Science Degree in Signed Language Interpreting&nbsp;requires 128 semester hours of course work, including 40 hours in the major. Each student accepted to the major is assigned an academic advisor, who works closely with the student on course prerequisites and sequences. Incoming students devote the first two years to signed language studies and the acquisition of American Sign Language. The last two years focus on interpreting, transliterating, and cultural studies. <br>",
  "admission_requirements": "&nbsp;<p>A minimum of 26 credit hours; 23 credit hours must be in courses acceptable toward graduation.</p><p>A cumulative grade point average of at least 2.00 on all work.</p><ul><li>Transfer students must have a 2.0 transfer GPA.</li><li>Continuing UNM students must have a 2.00 institutional GPA.</li></ul><p>Demonstrated academic achievement by satisfying the following:</p><ul><li>Completion of the University Speaking and Writing Core.</li><li>Completion of the University Mathematics Core.</li><li>Completion of the University Foreign Language Core.</li></ul><p>Completion of&nbsp;Department of Linguistics&nbsp;major admission coursework with grade(s) of \"C\" or better:</p><ul><li><strong>Linguistics:</strong>&nbsp;LING 301.</li><li><strong>Linguistics with Signed Language Studies concentration:</strong>&nbsp;LING 101 or 301; one LING course at 300-level</li><li><strong>Signed Language Interpreting:</strong>&nbsp;Admission to the College of Arts&nbsp;and Sciences and the Signed Language Interpreting Program is not automatic. &nbsp;Majors must formally apply with the program to gain admission.&nbsp;&nbsp;Contact the program director or<a href=\"mailto:sign@unm.edu\">sign@unm.edu</a>&nbsp;for more information.</li></ul>",
  "transfer_agreements": "",
  "career_opportunities": "<p>&nbsp;Linguistics is the study of how languages work, change, are learned, and are used. Linguists, therefore, see language as an intricate system of interacting semantic, grammatical,&nbsp;phonological, and pragmatic rules and principles to study, describe, and ultimately to understand. The concerns in linguistics overlap with those of other language sciences, making linguistics a truly interdisciplinary field. &nbsp;&nbsp;A bachelor's degree is the minimum formal education required, and qualifies one for entry-level positions in business, nonprofit organizations, and government. Depending upon the student’s career interests, and due to the major’s emphasis on analysis, argumentation and reasoning, and communication, a linguistics major is may pursue a professional degree in law, business, government or education.&nbsp;</p>",
  "contact_information": "<i><b>Phyllis Wilcox:</b></i>\n<b>Professor</b><br>\n<a target=\"_parent\" href=\"tel:5052770928\">(505) 505 277-0928</a><br>\n<a target=\"_parent\" href=\"mailto:pwilcox@unm.edu\">pwilcox@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}