{
  "name": "Sociology",
  "degree": "MA",
  "program_description": "&nbsp;<p>Admission to the sociology M.A. program depends on a strong record of academic performance at the undergraduate level. While the entire application is considered, and no precise GPA cutoff is used, competitive applicants generally have at least a B average (3.0 in a 4.0 system) in previous academic work. GRE scores (general test) are also evaluated as part of the application procedure. Applicants are also asked to submit a letter of intent, three letters of recommendation and two writing samples.</p><p>We recommend that entering graduate student have had 12 hours of advanced undergraduate sociology courses, especially including satisfactory performance in sociological research methods and theory. We also recommend college level algebra or its equivalent. A graduate student admitted with deficiencies in any of these may be required to satisfactorily complete (with a grade of at least B, 3.0) the appropriate undergraduate course work. Credit hours earned in courses taken to remove such deficiencies do not apply to the minimum hours required for a master's degree.</p><p>The M.A. degree requires 24 hours of course work, 6 hours of thesis, a written thesis and passing the Final examination for the Thesis. Students need to maintain a cumulative GPA of at least 3.0, and all required courses must be completed with a grade of at least B-. After completing 12 hours of course work, and in consultation with the major advisor, students must file a Program of Studies with the Office of Graduate Studies. Before writing a thesis, students must appoint a thesis committee consisting of a chairperson and at least two additional faculty members. At least two of the committee members must hold regular full-time faculty appointments at The University of New Mexico.</p><p>Core course requirements for all students seeking a master's degree in sociology consist of (i) Three hours of graduate sociological theory (either Sociology 500, 513, or 514); (ii) A one hour graduate proseminar (Sociology 523) to be taken as soon as possible; (iii) Methods of Social Research I (Sociology 580); (iv) Advanced Social Statistics I (Sociology 581); and (v) at least 12 hours of substantive courses in the social sciences, as approved by the Department's Graduate Committee.</p><p>In addition to these 22 core hours, M.A. students must complete at least 8 more hours of course work, which includes 6 hours of thesis credit (Sociology 599).&nbsp; Once a student enrolls in Sociology 599 she or he must stay continuously enrolled in at least one thesis hour for each semester until all degree requirements are completed.</p>",
  "admission_requirements": "<p>Applicants must submit their application by the posted deadlines in order to be considered for admission.</p><table><tbody><tr><td colspan=\"3\"><h1>Application Deadlines</h1></td></tr><tr><td><p>Admission</p></td><td><p>With a TA/GA*</p></td><td><p>Without a TA/GA</p></td></tr><tr><td><p>Fall 2013</p></td><td><p>January 15*</p></td><td><p>April 15th</p></td></tr></tbody></table><p>* Admitted students will be<em>&nbsp;considered</em>&nbsp;for a Teaching Assistantship/Graduate Assistantship.</p><h3>Application Instructions</h3><p>All applicants must submit the following material by the deadline in order to be considered for admission:</p><p>(<em>For a downloadable checklist of these instructions, please click<a href=\"http://www.unm.edu/~socdept/pdfs/Checklist.docx\">&nbsp;here</a>.</em>)</p><p><br><strong>1. a)<u>&nbsp;Domestic applicants:</u></strong></p><ul><ul><ul><li>Complete the UNM graduate school application found here:<a href=\"http://apply.unm.edu/\">&nbsp;apply.unm.edu</a></li></ul></ul></ul><p><strong>1. b)<u>&nbsp;International Applicants only:</u></strong></p><ul><ul><ul><li>Official International Application found here:<a href=\"http://www.unm.edu/admissions/guidelines/international.html#applying\">http://www.unm.edu/admissions/guidelines/international.html#applying</a></li><li>Follow the international applicant checklist here:<a href=\"http://www.unm.edu/admissions/guidelines/international.html#applying\">http://www.unm.edu/admissions/guidelines/international.html#applying</a><br></li></ul></ul></ul><p><strong>2. Material to be Submitted to the University:</strong></p><ul><li>Submit $50 application fee (it can either be paid as part of the above listed online application or it can be via phone at 505-277-5363).</li><li>Send official, original, sealed copies of all transcripts to:</li></ul><p>The University of New Mexico<br>Office of Admissions<br>P.O. Box 4895<br>Albuquerque, NM 87196-4895<br></p><u><strong>3. Material to be Submitted to the Department:</strong></u><ul><table><tbody><tr><td colspan=\"2\"><h1><strong>Department Mailing Address</strong></h1></td></tr><tr><td><p><strong>US Postal Mailing Address</strong></p></td><td><p><strong>FedEx/DHL/UPS Shipping Address</strong></p></td></tr><tr><td><p>UNM Sociology Department<br>Attn: Sociology Graduate Committee<br>MSC05 3080<br>1 University of New Mexico<br>Albuquerque, NM 87131-001</p></td><td><p>UNM Sociology Department&nbsp;<br>Attn: Sociology Graduate Committee&nbsp;<br>1915 Roma NE Ste. 1103&nbsp;<br>Albuquerque NM 87131-0001</p></td></tr></tbody></table><p>&nbsp;</p><li><strong>A resume or curriculum vitae</strong>. Please include your contact information at the top and all relevant information regarding the following:</li><ul><ul><li>Degrees earned and in progress;</li><li>Academic research experience;</li><li>Teaching or grading experience;</li><li>Work experience;</li><li>Publications;</li><li>Awards, honors, or Professional memberships</li></ul></ul><li><strong>Unofficial copies of transcripts</strong>&nbsp;from each institution attended.</li><li><strong>A letter of intent</strong>&nbsp;that clearly and concisely describes your academic background and interests. Please ensure the letter touches on the following topics:</li><ul><li>The letter should include professional experience, objectives, and any other factors bearing upon qualifications for graduate work in Sociology.</li><li>Your reasons for applying to this particular program.</li><li>Indicate which of the five department specialties are of most interest to you:<ul><ul><li>Crime, Law, and Social Control;</li><li>Sociology of Health &amp; Medicine;</li><li>Race &amp; Ethnicity;</li><li>Social Movements;</li><li>Comparative Sociology</li></ul></ul></li><li>Your reasons for seeking a graduate degree in Sociology.</li><li>If there are any weaknesses in the application file, such as poor grades, lack of previous Sociological coursework, or low GRE scores, you should address them.</li></ul><li><strong>Three letters of recommendation</strong>&nbsp;from academic references that address your past academic performance, including analytical abilities and potential for success in graduate studies. If you request a letter from a professional reference, the letter should address analytical abilities and professional qualifications relevant to Sociological areas of study. Please ensure references include a completed&nbsp;<a href=\"http://www.unm.edu/~socdept/pdfs/Recommend.pdf\" target=\"_blank\" title=\"http://www.unm.edu/~grad/eforms/Recommend.pdf\">cover form</a>.</li><li><strong>Two writing samples</strong>&nbsp;of approximately 5 - 15 pages in length. The samples may be a previously submitted term paper or an original essay. This requirement provides the applicant with the opportunity to demonstrate research and analytical abilities.</li><li><strong>Graduate Record Examination (GRE) scores</strong>&nbsp;are required and should be sent to the Testing and Data Management Division of the University of New Mexico (Institutional code 4845). Applicants should use the area studies code (2102) listed under departmental codes for UNM. Applicants should also send a photocopy of the scores to the Sociology Department.&nbsp;<br></li></ul><table><tbody><tr></tr><tr></tr><tr></tr><tr></tr></tbody></table><p>Please see the links below for more information on our graduate program. You may contact the graduate advisor, Dr. Robert Fiala (<a href=\"mailto:rfiala@unm.edu\">rfiala@unm.edu</a>; 505.277.2725), or the academic advisor (<a href=\"mailto:sadvisor@unm.edu\">sadvisor@unm.edu</a>; 505.277.2501) with questions.</p><p></p>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b> Robert Fiala:</b></i>\n<b>Faculty Graduate Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052772725\">(505) 277-2725</a><br>\n<a target=\"_parent\" href=\"mailto:rfiala@unm.edu\">rfiala@unm.edu</a><br><br>\n<i><b> Christopher Lyons:</b></i>\n<b>Faculty Graduate Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052772501\">(505) 277-2501</a><br>\n<a target=\"_parent\" href=\"mailto:clyons@unm.edu\">clyons@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}