{
  "name": "Spanish",
  "degree": "PhD",
  "program_description": "The Ph.D. in Spanish and Portuguese at the University of New Mexico requires a minimum of 36 hours of graduate courses (not including dissertation hours).&nbsp; The degree consists of a departmental concentration and twelve additional hours in a supporting field.&nbsp; All Ph.D. coursework in Spanish must be at the 500- or 600-level, with the exception of SPAN 438 - Mexican Literature, and SPAN 423 - Cervantes’ Quijote.<br><br>1. Departmental Concentration:&nbsp;The two concentrations are Literature and Linguistics.&nbsp;<br>The concentration in Literature consists 24 credit hours of a group of courses in a genre (narrative, poetry, theater) and a period (Medieval, Renaissance/Golden Age/Colonial, 18th and 19th Centuries, 20th Century) and 12 hours in a supporting field.&nbsp;<br>The concentration in Linguistics requires 36 hours of a range of courses from the various subfields of linguistics offered at UNM.&nbsp;<br><br>2. Required Courses:<br>For the Linguistic concentration either SPAN 542 - History of the Spanish Language or PORT 561 - History of the Portuguese Language and PORT 461 - Graduate Portuguese Reading.&nbsp;<br>For the Literature concentration SPAN 601 (Literary Theory) and six units of Portuguese 400 level or above are required.&nbsp; These required courses may count toward the 36 hours of coursework.<br><br>3. Language Requirement:<br>Research at the graduate and professional levels is enhanced by the mastery of several languages.&nbsp; Students are advised to consider their professional goals in selecting a language to fulfill the department’s requirement. The Portuguese language, as well as Brazilian literature and culture, share many similarities with the Spanish language and Spanish American literature and culture.&nbsp; Coursework in Portuguese is strongly encouraged by the Department of Spanish and Portuguese as it will enhance students’ understanding and appreciation of such similarities.&nbsp; Portuguese 277 is recommended.<br><br>&nbsp;&nbsp;&nbsp;&nbsp; All Ph.D. candidates must demonstrate proficiency equivalent to two years of university-level study in a language apart from English and the student’s language of major study.&nbsp; This proficiency is normally demonstrated by completing, in consultation with the Departmental Graduate Advisor, a fourth-semester or above numbered language course with a grade of B or better.&nbsp; Alternately, the student may complete the requirement by demonstrating proficiency equivalent to one year of university-level study in two foreign languages, by completing second-semester or above numbered language courses in both languages with a grade of B or better.&nbsp; This requirement can be met through coursework done as part of the B.A. and/or M.A.<br><br>4. Comprehensive Examination:<br>The doctoral examination encompasses both the concentration and the additional 12 hours in a supporting field.&nbsp; The Student will compile a reading list in consultation with his or her Chair of Committee on Studies.&nbsp;<br>The examination consists of three parts:<br>a. A 72-hour written examination covering areas of the concentration as well as the supporting field.<br>b. An assigned research essay in the student’s concentration.&nbsp;<br>&nbsp;&nbsp;&nbsp; The research question is developed in collaboration with the Committee on Studies and is generally geared&nbsp;&nbsp;<br>&nbsp;&nbsp;&nbsp; to prepare the student to work on the projected dissertation topic.&nbsp;<br>&nbsp;&nbsp;&nbsp; The student will have two weeks to complete the essay.<br>c. A comprehensive oral examination to be scheduled two weeks after the conclusion of the written<br>&nbsp;&nbsp; examination.<br><br>5. Ph.D. Dissertation:<br>Consult the information and requirements specified in the University of New Mexico Catalog.&nbsp; A dissertation proposal will be presented to and approved by the Dissertation Committee in the semester following the comprehensive examination.&nbsp; An approved copy of the dissertation proposal must be turned in to the Graduate Advisor. <br>",
  "admission_requirements": "&nbsp;<p>The University of New Mexico offers the Ph.D. degree in the Department of Spanish and Portuguese with major concentrations in Hispanic Literature and Hispanic Linguistics, with graduate-level coursework offered in Portuguese.&nbsp; Financial assistance in the form of a teaching assistantship is available for the most highly qualified candidates.&nbsp; Ph.D. students holding a teaching assistantship are normally supported for six semesters of support, providing that they remain in good academic standing, have satisfactory teaching and the availability of University funding.&nbsp; A limited number of summer teaching assistantships are available on a competitive basis.<br><br>The Ph.D. is a research-oriented degree, requiring the completion of a dissertation, which represents a major original scholarly contribution.&nbsp; Holders of a Ph.D. in Spanish and Portuguese typically teach at the college or university level and continue to write and publish research throughout their careers.&nbsp; Not all successful M.A. students will make successful Ph.D. students.&nbsp; Conversely, not all M.A. students will find that a Ph.D. degree fits their needs.&nbsp; Thus, the fact of having completed an M.A. does not in itself ensure admission to the Ph.D. program.&nbsp; A decision for admission is based on a composite of academic grades, faculty recommendations, GRE scores, comprehensive examinations, and other evidence of scholarship.&nbsp; An important factor in considering applications to the Ph.D. program is a demonstration of the ability to undertake sustained research, and a commitment to research that goes beyond the mere satisfaction of program requirements.</p><ul><li>All prospective Ph.D. candidates must hold the M.A. in Spanish or Portuguese or an equivalent degree from another country.</li><li>Admission to the Ph.D. program in Spanish and Portuguese at the University of New Mexico is highly selective, and all applicants, - including those who have received an M.A. in Spanish or Portuguese from UNM - are required to follow the same procedures.</li><li>Applications for admission to the Ph.D. program are considered on an annual basis. The Department of Spanish and Portuguese must receive all material by January 15 for Fall admission.&nbsp; This deadline holds even for applicants who do not request a teaching assistantship.</li></ul><h2>Application Process:</h2><p>Acceptance into the Ph.D. program is based on an evaluation of the following items, which the prospective candidate must provide the University:</p><ol><li>An application, and the application fee to be submitted to Admissions (UNM Spanish and Portuguese M.A. students do<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; not have to submit a new Application, but need to turn in a change of degree form to the department Graduate Advisor).</li><li>Official transcripts of all academic work sent directly to the Office of Admissions. (UNM M.A. students do not have to<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; submit new transcripts, but an unofficial UNM transcript is required by the department).</li><li>A narrative statement of intent, following departmental guidelines.</li><li>A sample research paper prepared in accordance with the MLA Style Sheet for literature students or the LSA Style<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Sheet for linguistics students.</li><li><strong>Spanish candidates:</strong>&nbsp;Must submit the versant language Proficiency exam at&nbsp;<a href=\"http://www.pearsonhighered.com/versant/\">http://www.pearsonhighered.com/versant/</a></li><li>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>Portuguese candidates:</strong>&nbsp;Must submit a recorded autobiography according to departmental guidelines.&nbsp; The compact<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; disc, playable on a standard CD player,will be in Portuguese; native speakers of languages other than English must<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; also provide a recorded statement in English of equal length.</li><li>6.&nbsp;&nbsp; Graduates of U.S. universities must present GRE scores; native speakers of languages other than English.</li><li>7.&nbsp;&nbsp; Three letters of recommendation, preferably from professors in the major field of study. The recommendation forms<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; included with the application or available at&nbsp;<a href=\"http://ogs.unm.edu/resources/ogs-forms/documents/Recommend.pdf\">http://ogs.unm.edu/resources/ogs-forms/documents/Recommend.pdf</a><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; supplemental material may be included on the departmental stationery of the person writing the recommendation.</li></ol>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Martha Hurd:</b></i>\n<b>Graduate Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052772974\">(505) 277-2974</a><br>\n<a target=\"_parent\" href=\"mailto:marthah@unm.edu\">marthah@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}