{
  "name": "Speech and Hearing Sciences",
  "degree": "BA",
  "program_description": "&nbsp;<p>The Bachelor's Degree in Speech and Hearing Sciences allows students to explore the mechanisms and processes of human communication and prepares students to pursue graduate education in the fields of speech-language pathology, audiology, or speech and hearing science. Courses are open to students in other major fields.</p><p>Audiologists are professionals with master's or doctoral degrees specializing in prevention, identification, and assessment of hearing impairment. They also provide habilitation and rehabilitation of persons with hearing loss, and they fit hearing aids. Audiologists work in hospitals, rehabilitation centers, private practices, universities, schools, government agencies, industry, nursing homes, and health departments.</p><p>Speech-language pathologists are professionals with master's or doctoral degrees who assess and treat communication disorders such as stuttering, delayed language development, aphasia, voice disorders, and articulation problems. Speech-language pathologists work in schools, hospitals, rehabilitation centers, nursing homes, research laboratories, universities, and private practices.</p><p>Speech, language, and hearing scientists are professionals, usually with a doctoral degree, who investigate basic and applied aspects of communication. They work mainly in universities, industry, and research institutes.</p><p>There is a continuing need, nationwide, for certified professionals in these fields. The major is an excellent choice for students who have a general interest in human behavior, education, and/or health professions and who are specifically interested in how humans beings acquire, produce, and receive language.</p>",
  "admission_requirements": "&nbsp;<p>A minimum of 26 credit hours; 23 credit hours must be in courses acceptable toward graduation.</p><p>A cumulative grade point average of at least 2.00 on all work.</p><ul><li>Transfer students must have a 2.0 transfer GPA.</li><li>Continuing UNM students must have a 2.00 institutional GPA.</li></ul><p>Demonstrated academic achievement by satisfying the following:</p><ul><li>Completion of the University Speaking and Writing Core.</li><li>Completion of the University Mathematics Core.</li><li>Completion of the University Foreign Language Core.</li></ul><p>Completion of Department of&nbsp;Speech and Hearing Sciences&nbsp;admission coursework with grades of \"C\" or better:</p><ul><li>MATH 121 or 150 or 162 or 180; or BIOL 110 or 123.</li><li>CJ 125 or 325; or PSY 105 or 220; or SOC 101 or 230; or ANTH 110 or 130 or 327.&nbsp;</li></ul><br>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Cameron Langner:</b></i>\n<b>Sr. Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052773489\">505 277-3489</a><br>\n<a target=\"_parent\" href=\"mailto:clangner@unm.edu\">clangner@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": "awesome",
  "moratorium": null
}