{
  "name": "Speech-Language Pathology",
  "degree": "MS",
  "program_description": "<p>The Master of Science program in the Department of Speech and Hearing Sciences at UNM prepares students to become professional speech-language pathologists. Our learning objectives are designed to give students balanced preparation across the scope of practice in our field, so our graduates are well-prepared for the many employment opportunities that are available in this state and nationwide.&nbsp;</p><p>The program is accredited in Audiology and Speech-Language Pathology by the Council of Academic Accreditation (CAA) of the American Speech-Language-Hearing Association (ASHA), 2200 Research Blvd., Rockville, MD 20850-3289, telephone 301-296-5700 or 800-498-2071. The program is designed so that students can complete all academic and clinical credentialing requirements of ASHA and of the New Mexico Speech-Language Pathology, Audiology, and Hearing Aid Dispensing Practices board.</p><p>The UNM program has a number of distinctive features:</p><ul><li><p>special focus on multilingual and multicultural issues in service delivery and research</p></li><li><p>access to a great diversity of clinical sites and populations</p></li><li><p>opportunities for students to be involved in faculty research</p></li><li><p>ability to study on a part-time basis</p><br></li></ul>&nbsp; <br>",
  "admission_requirements": "&nbsp; &nbsp; &nbsp;&nbsp;The minimum requirement for applying to the SLP Master's degree program is a&nbsp;<strong>GPA of 3.4</strong>&nbsp;in at least&nbsp;<strong>9 semester hours of SHS coursework</strong>. If you have not completed at least 9 hours of SHS coursework, please see information for&nbsp;<a href=\"http://shs.unm.edu/programs/non-degree/index.html\">non-degree students</a>.&nbsp;&nbsp;<strong><em>Applications not meeting these minimum requirements will not be considered.</em></strong>",
  "transfer_agreements": "",
  "career_opportunities": "<p>&nbsp;Linguistics is the study of how languages work, change, are learned, and are used. Linguists, therefore, see language as an intricate system of interacting semantic, grammatical,&nbsp;phonological, and pragmatic rules and principles to study, describe, and ultimately to understand. The concerns in linguistics overlap with those of other language sciences, making linguistics a truly interdisciplinary field. &nbsp;&nbsp;A bachelor's degree is the minimum formal education required, and qualifies one for entry-level positions in business, nonprofit organizations, and government. Depending upon the student’s career interests, and due to the major’s emphasis on analysis, argumentation and reasoning, and communication, a linguistics major is may pursue a professional degree in law, business, government or education.&nbsp;</p>",
  "contact_information": "<i><b>Yvonne Martinez-Ingram:</b></i>\n<b>Department Administrator</b><br>\n<a target=\"_parent\" href=\"tel:5052776353\">(505) 277-6353</a><br>\n<a target=\"_parent\" href=\"mailto:ymartin@unm.edu\">ymartin@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}