{
  "name": "Statistics",
  "degree": "PhD",
  "program_description": "<p>The Doctor of Philosophy in Statistics degree is offered by the Statistics Program. Knowledge of a computer language is required, but knowledge of a foreign language is not. General requirements for the Ph.D. include 18 credit hours of course work above the Master’s level. No more than 6 of these&nbsp;credit hours may be taken in reading or special topics. 18 credit hours of dissertation is required for the Ph.D. in Statistics. Students who enter the Ph.D. program with a Master’s degree are expected to take the Ph.D. qualifying examination as soon as possible and no later than one year after admission. The following courses are required for the Ph.D. students: STAT 546, 556, 557, and 567.</p><p><strong>NOTE:</strong>&nbsp;MATH 501 and 502 cannot be counted toward credit hours needed for graduate degrees in Mathematics or Statistics.</p><p>General requirements for both the M.S. and Ph.D. degrees are given in the earlier pages of the catalog. Lists of required courses, the number of credit hours that must be taken in courses labeled STAT and various concentrations can be found in the Handbook for Statistics Graduate Students obtained from the&nbsp;<a href=\"http://www.math.unm.edu/graduate/graduate-studies-statistics\" target=\"_blank\">Statistics Web page</a>.</p>&nbsp;",
  "admission_requirements": "",
  "transfer_agreements": "",
  "career_opportunities": "<p>&nbsp;&nbsp; Conduct research in fundamental mathematics or in&nbsp;application of mathematical techniques to science, management, and other fields. Solve or direct solutions to problems in various fields by mathematical methods. &nbsp;A bachelor's degree is the&nbsp;minimum&nbsp;formal education required. However, many employers also require graduate school. For example, they may require a master's degree, and some require a Ph.D., M.D., or J.D. (law degree).&nbsp;</p>",
  "contact_information": "<i><b>Ana Parra Lombard:</b></i>\n<b>Coordinator, Program Advisement</b><br>\n<a target=\"_parent\" href=\"tel:5052775250\">(505) 277-5250</a><br>\n<a target=\"_parent\" href=\"mailto:alombard@unm.edu\">alombard@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}