{
  "name": "Theatre",
  "degree": "BA",
  "program_description": "<p>The&nbsp;B.A. in Theatre provides the student with the opportunity to obtain a comprehensive background in the discipline of Theatre. It is intended for students who wish to pursue a generalized course of study or who wish to focus their higher studies in the areas of Acting, Dramatic Writing, History and Criticism, or Theatre Education.</p><p>The&nbsp;B.A. in Theatre&nbsp;is designed for students who may wish to pursue further studies of theatre at the graduate level or in a conservatory, and for those who wish to use the study of theatre as a nexus for their general education in the liberal arts.</p>",
  "admission_requirements": "<p>To\nbe eligible for admission as a declared major in the College of Fine\nArts, you must meet the following requirements:</p>\n<ol>\n\t<li><p>Completion\n\tof 26 hours of earned credit.</p>\n\t</li><li><p>A\n\tgrade point average of at least 2.50 in all hours attempted or, a\n\tgrade point average of at least 2.50 in the last 30 hours attempted.</p>\n\t</li><li><p>Competency\n\tin English writing as demonstrated by: achieving a score of 26 or\n\thigher on the English section of the ACT examination or 610 SAT\n\tverbal, or completion of ENGL 101 with a grade of C or better, or\n\treceiving credit through Advanced Placement Exam.</p>\n\t</li><li><p>Competency\n\tin Mathematics as demonstrated by: achieving a score of&nbsp;22 or\n\thigher on the Math section of the ACT examination or&nbsp;510 SAT\n\tmath, or completion of MATH 120 or Math 101 and 102&nbsp;with a\n\tgrade of C or better, or placement into college-level Math by\n\tCompass exam.</p>\n\t</li><li><p>Completion\n\tof 12 credit hours of course work in the major area with at least a\n\t<b>2.5</b>\n\t<!-- CFA faculty have approved this change from a 3.0 to a 2.5 so that the entrance requirements to become a CFA declared major were not more stringent than graduation requirements in regard to the major grade point average.\n -->grade\n\tpoint average.</p>\n\t</li><li><p>Students\n\tseeking the Bachelor of Music or the Bachelor of Music Education\n\tdegree must also have approval to concentrate in the appropriate\n\tinstrument or voice. Refer to the Music section for additional\n\tadmission requirements to the instrumental and voice programs and\n\tthe Bachelor of Music Education program.</p>\n\t</li><li><p>Students\n\tseeking the Bachelor of Fine Arts with a major in Interdisciplinary\n\tFilm&nbsp;and Digital Media must also be admitted through the IFDM\n\tselection process and have completed the first two IFDM core courses\n\twith grades of C or better.</p>\n\t</li><li><p>Students\n\tseeking the Bachelor of Arts in Dance must also be approved to enter\n\tthe program by audition/interview. Contact the Theatre and Dance\n\tdepartment office for further details.</p>\n</li></ol>\n<p>If\nyou plan to major in one of the departments in the College of Fine\nArts, you should transfer to the college as soon as the above\nrequirements have been completed. To apply for transfer, go to the\nCollege of Fine Arts Advisement Center located in the Center for the\nArts, room 1102, to obtain and submit the application for admission\nas a declared major. Applications are accepted during the fall and\nspring semesters.</p>",
  "transfer_agreements": "If you are transferring to the University of New Mexico after having studied at another college or university, you may be eligible for admission directly into the College of Fine Arts. In general, the screening procedures and admission requirements are the same as those described above for admission to become a declared major.",
  "career_opportunities": "<p>&nbsp;The study of theatre involves exposure to creative dramatic expression, and requires collective endeavor. A production may bring together the talents of playwrights, actors, designers, directors and a host of other theatre artists. The major areas of specialization include performance, design, directing, playwriting, theatre education, and theatre history/criticism. &nbsp;The skills learned through this type of degree program can be applied to a broad range of careers. The “presentation skills, ability to perform in public, and control of the voice&nbsp;and body provide a solid basis for working effectively with others. Theatre also develops the ability to concentrate intensely, to listen introspectively, observe keenly, solve problems creatively, think critically, develop a project collaboratively, work independently, work under pressure, meet deadlines, and to maintain composure when faced with the unexpected. Well-developed communication skills enable graduates to contribute and to succeed in many professions” (from the University of Texas – Austin Fine Arts Career Services website).&nbsp;</p>",
  "contact_information": "<i><b>Stacia Smith :</b></i>\n<b>Undergraduate Advisor: Theatre and Dance</b><br>\n<a target=\"_parent\" href=\"tel:5052774332\">(505) 277-4332</a><br>\n<a target=\"_parent\" href=\"mailto:\tstacia@unm.edu\">stacia@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}