{
  "name": "Urban and Regional Design",
  "degree": "Grad Certificate",
  "program_description": "&nbsp;<p>Cities, towns and regional landscapes are among humanity’s largest and most complex achievements. The buildings, public works, plazas and parks of even a small town embody substantial amounts of capital, energy, natural resources, history and aspirations. Cities are among our greatest creations, yet typically no single individual creates them. Rather they arise from the dialog between multiple designers, clients, regulators, critics and users. Sometimes the cities and towns that emerge are sublime places. Frequently they have only fragments of greatness or are soul-deadening and environmentally unhealthy.</p><p>The Certificate in Urban and Regional Design aims to give students the foundations to ask critical questions about, study examples of, and propose approaches to designing the emergence of regions, towns, and cities.</p><ul><li><p>What does it take to create a great place that in and of itself gives life dignity, joy and beauty?</p></li><li><p>What tools are available to help compose places made by multiple designers?</p></li><li><p>How can design inform regulation?</p></li></ul><p>New Mexico offers a unique variety of settlement and district types for study, including Native American pueblos; strip mall development; Spanish Colonial settlements; streetcar suburbs; gated residential developments; acequia villages; railroad, company, courthouse square, military and Mormon towns; second home sprawl; ghost mining towns; Interstate commercial clusters, colonias; and communes. Ruins of Anasazi cities, myths of lost cities, and a rich literature of place provide further opportunities for research. Interactions between the natural and built environment are particularly vivid and strong in New Mexico’s desert and alpine ecosystems. Examples of both extractive settlements and centuries-old renewable resource based settlements are clearly represented in the State and region.</p><p>Questions about the program should be directed to Mark C. Childs, Director of the Certificate Program at&nbsp;<a href=\"mailto: mchilds @ unm.edu\">mchilds @ unm.edu</a>.</p><h2>Benefits of the Certificate</h2><p>The Certificate provides a coherent framework of courses for current graduate students and post-graduates interested in the improving the quality of life in our settlements through the physical design of regions, cities, towns, and their component pieces.</p><p>Completion of the Certificate will be recorded on students’ official UNM transcript.</p><p>Completion of the certificate may aid you in applying for private, public, and non-profit jobs requesting urban design skills, and for design and planning jobs in firms or departments that engage in urban work.&nbsp;&nbsp;<br>Knowledge of urban design can be useful in a wide variety of non-design positions, such as health professionals interested in environmental determinates of health, civil engineers who want a broader understanding of urban composition, lawyers working on urban issues, or public administrators focusing on municipal development.</p><p><a href=\"http://saap.unm.edu/about/sap-people/faculty-profiles/mark-childs.html\">Mark Childs</a>, Director Urban and Regional Design Certificate Program</p>",
  "admission_requirements": "&nbsp;<h2>Qualifications</h2><p>Students must be either:</p><ol><li><p>Currently enrolled as a graduate student in Architecture, Landscape, or Community and Regional Planning at UNM with a minimum GPA of 3.0. We prefer to admit graduate students after they have completed at least one semester of their graduate program.</p></li><li><p>In possession of a professional degree in architecture, planning, or landscape architecture; or</p></li><li><p>Are graduate students currently enrolled in other programs, or design professionals without one of the degrees listed above may be admitted by the Certificate Coordinator upon demonstration of adequate preparation, skills, and aptitude.</p></li></ol><em>Students who are not currently enrolled as graduate students at the University of New Mexico must apply to and be accepted by the University graduate program.&nbsp;<a href=\"http://www.unm.edu/apply/\">Apply Now &gt;</a>&nbsp;</em><h2>Application Submission Requirements</h2><ul><li>A resume</li><li>A statement of intent outlining your goals in pursuing the Certificate</li><li>Proposed program of study (http://ogs.unm.edu/resources/gs-forms/documents/pos-masters.pdf),</li><li>If you are currently in a graduate program please include an&nbsp;<a href=\"http://ogs.unm.edu/resources/gs-forms/documents/add-transcripted-certtificate-form.pdf\">application to add a certificate</a>.&nbsp;</li><li>A brief graphic portfolio of design and planning work. Include&nbsp;no more than&nbsp;ten 8.5x11” pages.</li><li>Samples of original written work. Include&nbsp;no more than&nbsp;five 8.5x11” pages.</li><li>A current academic transcript</li><li>Names and contact information for two people who can speak to your qualifications for the certificate program.</li></ul><p>These materials should demonstrate (1) serious initial investigation of urban and regional design issues in prior work, (2) strong design and/or planning skills, (3) strong craftsmanship and care for the context and external consequences of design and planning work, (4) ability to write cogently, and (5) a clear and compelling set of goals. The coordinator for the graduate certificate may waive any of the above requirements if the application as a whole demonstrates that the student has the skills, background, and ability to successfully complete the Certificate.</p><p><br>Students who have strong applications but whose skills in a particular area need development may be asked in the admission letter to add cours(s) to their studies (e.g. We may require an additional graphic or writing skills course).</p><h2>Deadlines</h2>Submit your application the front office of School or Architecture and Planning by&nbsp;<strong>March 1</strong>&nbsp;for fall term admission, or<strong>November 1</strong>&nbsp;for spring term admission.<br><br><strong>Please submit all materials to:</strong><br><br>School of Architecture and Planning<br>Attn: Beth Rowe, Graduate Advisor<br>MSC04 2530<br>1 University of New Mexico<br>Albuquerque, NM 87131-0001",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Elizabeth Rowe:</b></i>\n<b>Senior Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052771303\">(505) 277-1303</a><br>\n<a target=\"_parent\" href=\"mailto:sedmora@unm.edu\">sedmora@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}