{
  "name": "Water Resources",
  "degree": "MWR",
  "program_description": "The Water Resources Program offers a Masters of Water Resources (MWR), an interdisciplinary professional degree, designed to prepare students for careers in water resources management. Entering students have a basic proficiency in at least one water-related discipline, of which economics is included. The program seeks to expand and deepen students' knowledge of their primary disciplines as well as provide them with an integrated perspective on water in nature and society, improve their capacity to think carefully and comprehensively, and develop their technical and communications skills. Economics graduate students may find it advantageous to complete an MWR in conjunction with their economics graduate degree or to take a WRP water-modeling course, which is cross-listed in economics. These avenues are natural extensions for those students choosing to specialize in resource and environmental economics. A number of economics faculty are also WRP faculty. They not only teach in the program but also serve as advisors and committee members for WRP students' professional projects.",
  "admission_requirements": "<div align=\"center\"><div align=\"left\">Information on admission and application procedures is available at: http://www.unm.edu/~grad/admissions/admissions.html. Applications must include a transcript of all previous college work, three letters of recommendation and a letter of intent. The letters of recommendation and a letter of intent must be sent directly to the WRP Office, not the Office of Graduate Studies (OGS). Admission deadlines are November 15 for the spring semester and July 415 for the fall semester. Only former MWR students seeking readmission are admitted for the summer semester. Early application is encouraged for best consideration. The Office of Graduate Studies may be reached at 505-277-2711 or grad@unm.edu; its web address is www.unm.edu/~grad/. The admission requirements for the MWR degree program are: <br><ul><li>A Bachelor’s degree from an accredited college or university.</li><li>A GPA of at least 3.0 out of 4.0 for the last two years of undergraduate work. A student with a GPA under 3.0 may be admitted if he/she has other exceptional qualifications indicating their likelihood of success in the program.&nbsp;</li><li>Three references from individuals (not friends) qualified to assess the applicant’s academic and/or professional qualifications. At least one of these letters must be from a former professor. Letters from friends or personal acquaintances are not acceptable. Letters of reference must be sent to the WRP Office, not OGS.&nbsp;</li><li>A 1-2 page letter of intent describing the student’s background, interests in water resources, experience in the field, objectives, desired concentration, and future plans. A resume or curriculum vitae is helpful, but does not replace the letter of intent. This letter must be sent to the WRP Office, not OGS. Please put your name and all contact information on your letter.&nbsp;</li><li>Successful completion of the MWR prerequisites in the student’s intended area of study (see below). <br></li></ul>The Graduate Record Examination (GRE) is not required for admission. MWR students who have not been enrolled for three or more consecutive semesters will be dropped from the degree program by OGS. Application forms for readmission are available at www.unm.edu/apply/. The application fee must be repaid. Readmission is not automatic. Admission can be deferred for up to one calendar year. Students must submit a written request to <br>OGS and the WRP requesting deferral. Prerequisites Admission to the program requires completion of the prerequisite courses listed below. <br>Generally students should not apply until all prerequisites have been completed. However, students with a strong academic preparation may, upon occasion, be admitted with only one or two unfulfilled prerequisites. <br><br>Hydroscience Concentration <br><ul><li>Calculus I (Math 180 or 162L), Calculus II (Math 181 or 163L), and Statistics(Stat 145). Note: Math 162L and 163L are highly recommended.&nbsp;</li><li>Introductory Microeconomics (Economics 106) or Intermediate Microeconomics I (Economics 300)&nbsp;</li><li>Three semesters of introductory (or higher) science courses (UNM 100-level) inat least two different disciplines Policy/Management Concentration&nbsp;</li><li>Calculus I (Math 180 or 162L) and Statistics (Stat 145) 5</li><li>Introductory Microeconomics I (Economics 106) or Intermediate Microeconomics I (Economics 300)&nbsp;</li><li>Two semesters of introductory (or higher) science courses (UNM 100-level)&nbsp;</li><li>One introductory or higher course in: sociology (Sociology 101); political science (Political Science 110); or psychology (Psychology 105). Note: a student entering with a degree in one of the above must have taken a course in one of the other two disciplines. <br></li></ul>INTERNATIONAL APPLICANTS <br>International students (non-U.S. citizens) must apply through the UNM Office of International Admissions. Application materials may be requested from the Office of International Admissions, Student Services Building, MSC06 3270, 1 University of New Mexico, Albuquerque, NM 87131-0001 USA. This office may be reached via phone at 505-277-5829&nbsp; (www.unm.edu/admissions/newInternational/graduate.html). International applicants must have a TOEFL exam score of at least 550 on the paper exam or 213 on the computer exam, a certification of financial responsibility form, three copies of their official transcripts and certified English translations (if necessary) with their application package. Deadlines for international applicants for the MWR degree program are August 1 for the Spring semester and March 1 for the Fall semester. Amigo International Scholarship information and applications can be found at www.unm.edu/%7eschol/trans/amigoint.html. These scholarships allow international students to attend UNM for resident tuition fees only. <br></div></div>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Margaret Lumpmouth:</b></i>\n<b>Senior Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052772631\">(505) 277-2631</a><br>\n<a target=\"_parent\" href=\"mailto:\tmaggie78@unm.edu\">maggie78@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}