{
  "name": "Women Studies",
  "degree": "Grad Certificate",
  "program_description": "<p>The University of New Mexico Women Studies Program offers a transcripted graduate certificate in Women Studies that was approved by the New Mexico Department of Education in December 2006. Graduate students already enrolled in a graduate level program at UNM may apply for admission to the WS graduate certificate program on a rolling enrollment basis. Thus students may submit their materials at any time.</p><p>The Graduate Certificate in Women Studies is designed as an area of specialization for students pursuing a master's degree or a doctorate in disciplines in the humanities, social sciences, fine arts, or the professional schools at the University of New Mexico. The Graduate Certificate provides graduate students the opportunity to complete an education program that addresses the history and culture of women, the social structures of gender, and feminist perspectives on scholarship. Courses in Women Studies will also be available to graduate students not pursuing the Women Studies certificate, with permission of the instructor.</p>",
  "admission_requirements": "<p>Students may present Women Studies as a transcripted graduate certificate with 15 hours as follows:</p><p>(Six hours of required courses): with a 3.0 or higher in WMST 510 Feminist Theories and WMST 512 Feminist Research Methodologies. Nine hours of electives approved by Director of WS: Six hours may be taken within the student’s program; three hours must be taken from another department. Students must receive at least a 3.0 in all classes. Other courses may be used upon petition to the Director.</p><p>Applications should include:</p><ol><li>Proof of admission into a graduate program at UNM</li><li>Letter of intent</li><li>Undergraduate transcript</li><li>One letter of recommendation</li><li>Essay describing significant life experience applicant brings to the study of Women Studies, and explaining what he/she hopes to accomplish.</li></ol><p>Applications should be sent to:<br>Director of Women Studies<br>MSC06 3900<br>1 University of New Mexico<br>Albuquerque, NM 87131-0001</p>",
  "transfer_agreements": "",
  "career_opportunities": "",
  "contact_information": "<i><b>Barbara O. Reyes:</b></i>\n<b>Director, Women Studies Program</b><br>\n<a target=\"_parent\" href=\"tel:5052779119\">(505) 277-9119</a><br>\n<a target=\"_parent\" href=\"mailto:breyes3@unm.edu\">breyes3@unm.edu</a><br><br>",
  "online": "partial",
  "keywords": null,
  "moratorium": null
}