{"id"=>589, "dept_id"=>143, "name"=>"Liberal Arts", "degree"=>"BLA", "created_at"=>"2015-02-18T17:10:14.129Z", "updated_at"=>"2015-02-18T17:15:15.416Z", "program_description"=>"<p>The\nfaculty of The University of New Mexico offers the degree of Bachelor\nof Liberal Arts (B.L.A.). This program, approved in 2013, was\nformally known as the Bachelor of University Studies degree\nestablished in 1969, and is administered through University College.</p><p>This\nbaccalaureate degree program provides the opportunity for students to\ndevelop a unique program of study combining courses from three or\nmore University of New Mexico departments and/or colleges. With the\nhelp of a Liberal Arts &amp; Integrative Studies [lais]\nadvisor, students will structure a comprehensive <i>plan\nof study</i>,\nwhich will be thematically based and multidisciplinary in nature. The\nB.L.A. degree also enables students who have obtained a certificate\nor associate degree at an accredited community college to complete a\nbachelor’s degree at UNM. The B.L.A. degree is <b>not</b>\nintended for the undecided student, and it may not be part of a\ndouble major – however, it may be used as a dual or second degree.\nLiberal Arts is a major only, and while no official minor is required\nto be declared with this major, the use of an existing departmental\nminor is encouraged.</p><p>Strict\ncompliance with B.L.A. requirements is mandatory for admission to and\ncontinuation in the program. Changes to approved plans of study may\nbe made only in consultation with an advisor. Students in the Liberal\nArts program must meet the general academic regulations of the\nUniversity for admission, academic standing, and graduation found\nunder the University Catalog headings of <a href=\"http://catalog.unm.edu/catalogs/2012-2013/admissions.html\">Admissions</a>\n&amp; <a href=\"http://catalog.unm.edu/catalogs/2012-2013/undergrad-program.html\">Undergraduate\nPrograms</a>.\n<b>Students\nare responsible for familiarizing themselves with both the specific\nand general current academic regulations.</b>\nStudents who have not been continuously enrolled for 3 consecutive\nsemesters must follow the requirements of the current University of\nNew Mexico Catalog upon readmission.</p><p>\n\n\n\n\n\n</p><p>Questions\nregarding any aspect of the program should be addressed to an advisor\nin the LAIS office. Please also visit the website at\n<a href=\"http://lais.unm.edu/bla\">http://lais.unm.edu/bla</a>\nfor FAQs, Forms and Downloads, and Helpful Hints, etc…</p><p></p>", "admission_requirements"=>"<p>Admission\nto the Liberal Arts program for the current term must take place\nbefore the end of the third week of classes. After that deadline,\nadmission will be for the following term (Fall, Spring or Summer).\nPlease see an advisor for more information on LAIS admission\nrequirements. Please refer to the website for details on designing a\nPlan of Study. <a href=\"http://lais.unm.edu/bla\">http://lais.unm.edu/bla</a></p><p>Minimum\nrequirements to transfer into the Liberal Arts program are as\nfollows:</p><ol>\n\t<li><p>Demonstrated\n\tcompetence in the writing of English as evidenced by one of the\n\tfollowing:</p>\n\t<ul>\n\t\t<li><p>\ta)\n\t\tCompletion of English 101 and 102 with a grade of C (2.00) or\n\t\thigher in both.</p>\n\t\t</li><li><p>\tb)\n\t\tA score of 29 or better on the English portion of the Enhanced ACT.</p>\n\t\t</li><li><p>\tc)\n\t\tA score of 650 or better on the verbal portion of the SAT.</p>\n\t\t</li><li><p>\td)\n\t\tSuccessful completion of a Writing Proficiency Portfolio (see the\n\t\tEnglish Department for details).</p>\n\t\t</li><li><p>\te)\n\t\tCredit for English 102 through CEEB advanced placement program.</p>\n\t</li></ul>\n\t</li><li><p>A\n\tminimum cumulative grade point average of 2.00 or higher.</p>\n\t</li><li><p>Twenty-six\n\tor more hours of earned credit applicable to this program.</p></li></ol><p><b>Application\nProcess</b></p><p>Application\nto the Liberal Arts program includes a preliminary advisement session\nwith an LAIS Academic Advisor. The meeting is the student’s\nopportunity to discuss their ideas and goals for their degree, and\nask any questions they may have before admission to the program.</p><p>In\norder to apply to the Liberal Arts program, students must submit the\nfollowing to an LAIS Advisor:</p><p>\n\n\n\n\n\n\n\n\n</p><ol>\n\t<li><p>A\n\tcomprehensive <i>Plan\n\tof Study</i>.\n\tThis Plan of Study must list all course work taken, including\n\ttransfer work, and especially all remaining courses that the student\n\tintends to take to complete their B.L.A. degree. In preparing a\n\tPlan, the student must consult The University of New Mexico Catalog\n\tto find courses appropriate for their multidisciplinary\n\t(theme-based) plan.</p>\n\t</li><li><p>A\n\t<i>Statement\n\tof Purpose</i>,\n\tno less than 250 words. This statement should describe how the\n\tstudent has organized courses in the Plan to meet the student’s\n\tneeds as well as exactly to what end the student hopes to use their\n\tLiberal Arts degree.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n\t</li><li><p>A\n\tcompleted <i>Qualified\n\tSignature</i>\n\tform. The Qualified Signatures indicate that a student has discussed\n\tthe relevance and appropriateness of their degree plan with a\n\tknowledgeable and experienced individual in their chosen profession\n\tand a Career Development Facilitator. Details on this form will be\n\tdiscussed in the initial interview. &nbsp;&nbsp;</p></li></ol><p></p>", "transfer_agreements"=>"", "career_opportunities"=>"", "contact_information"=>"<i><b>Mariah Harrison:</b></i>\n<b>Senior Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052770112\">(505) 277-0112</a><br>\n<a target=\"_parent\" href=\"mailto:\tmariah09@unm.edu\">mariah09@unm.edu</a><br><br>\n<i><b>Stephanie Heikkinen:</b></i>\n<b>Senior Academic Advisor</b><br>\n<a target=\"_parent\" href=\"tel:5052778276\">(505) 277-8276</a><br>\n<a target=\"_parent\" href=\"mailto:\tsheikkin@unm.edu\">sheikkin@unm.edu</a><br><br>", "online"=>"partial", "keywords"=>nil, "year_id"=>2, "moratorium"=>nil}
